org $088000

;===================================================================================================

Message_00_Pointers:
#_088000: dw Message_00_00_Pointers
#_088002: dw Message_00_01_Pointers
#_088004: dw Message_00_02_Pointers
#_088006: dw Message_00_03_Pointers
#_088008: dw Message_00_04_Pointers
#_08800A: dw Message_00_05_Pointers
#_08800C: dw Message_00_06_Pointers
#_08800E: dw Message_00_07_Pointers
#_088010: dw Message_00_08_Pointers
#_088012: dw Message_00_09_Pointers
#_088014: dw Message_00_0A_Pointers
#_088016: dw Message_00_0B_Pointers
#_088018: dw Message_00_0C_Pointers

;===================================================================================================

; しょうじょ
Message_00_00_00:
#_08801A: db $30, $57, $27, $A2, $57 ; しょうじょ
#_08801F: db $FF ; end of message

;===================================================================================================

; しょうねん
Message_00_00_01:
#_088020: db $30, $57, $27, $3C, $52 ; しょうねん
#_088025: db $FF ; end of message

;===================================================================================================

; われわれ
Message_00_00_02:
#_088026: db $50, $4E, $50, $4E ; われわれ
#_08802A: db $FF ; end of message

;===================================================================================================

; あなたがた
Message_00_00_03:
#_08802B: db $25, $39, $34, $9C, $34 ; あなたがた
#_088030: db $FF ; end of message

;===================================================================================================

; おまえたち
Message_00_00_04:
#_088031: db $29, $43, $28, $34, $35 ; おまえたち
#_088036: db $FF ; end of message

;===================================================================================================

; マグネタイト
Message_00_00_05:
#_088037: db $7B, $B7, $74, $6C, $5E, $70 ; マグネタイト
#_08803D: db $FF ; end of message

;===================================================================================================

; じぶんの へや
Message_00_00_06:
#_08803E: db $A2, $AD, $52, $3D, $CF, $41, $48 ; じぶんの⎵へや
#_088045: db $FF ; end of message

;===================================================================================================

; メッセージ
Message_00_00_07:
#_088046: db $7E, $92, $6A, $5A, $BB ; メッセージ
#_08804B: db $FF ; end of message

;===================================================================================================

; プログラム
Message_00_00_08:
#_08804C: db $CB, $87, $B7, $83, $7D ; プログラム
#_088051: db $FF ; end of message

;===================================================================================================

; コンピュータ
Message_00_00_09:
#_088052: db $66, $8A, $CA, $90, $5A, $6C ; コンピュータ
#_088058: db $FF ; end of message

;===================================================================================================

; イヌの パスカル
Message_00_00_0A:
#_088059: db $5E, $73, $3D, $CF, $C9, $69, $62, $85 ; イヌの⎵パスカル
#_088061: db $FF ; end of message

;===================================================================================================

; ・・・
Message_00_00_0B:
#_088062: db $93, $93, $93 ; ・・・
#_088065: db $FE, $07, $1E ; ext command 07: draw buffered text then wait 29 frames
#_088068: db $FF ; end of message

;===================================================================================================

; バウ!ワウ!
Message_00_00_0C:
#_088069: db $C4, $5F, $94, $88, $5F, $94 ; バウ!ワウ!
#_08806F: db $FF ; end of message

;===================================================================================================

; ありがとう
Message_00_00_0D:
#_088070: db $25, $4C, $9C, $38, $27 ; ありがとう
#_088075: db $FF ; end of message

;===================================================================================================

; たちいりきんし
Message_00_00_0E:
#_088076: db $34, $35, $26, $4C, $2B, $52, $30 ; たちいりきんし
#_08807D: db $FF ; end of message

;===================================================================================================

; かいげんしれいぶ
Message_00_00_0F:
#_08807E: db $2A, $26, $9F, $52, $30, $4E, $26, $AD ; かいげんしれいぶ
#_088086: db $FF ; end of message

;===================================================================================================

; きょうりょく
Message_00_00_10:
#_088087: db $2B, $57, $27, $4C, $57, $2C ; きょうりょく
#_08808D: db $FF ; end of message

;===================================================================================================

; となりのいしゃ
Message_00_00_11:
#_08808E: db $38, $39, $4C, $3D, $26, $30, $55 ; となりのいしゃ
#_088095: db $FF ; end of message

;===================================================================================================

; と はなしますか?
Message_00_00_12:
#_088096: db $38, $CF, $3E, $39, $30, $43, $31, $2A ; と⎵はなしますか
#_08809E: db $95 ; ?
#_08809F: db $FF ; end of message

;===================================================================================================

; アクマしょうかん
Message_00_00_13:
#_0880A0: db $5D, $64, $7B, $30, $57, $27, $2A, $52 ; アクマしょうかん
#_0880A8: db $FF ; end of message

;===================================================================================================

; かいぞうしゅじゅつ
Message_00_00_14:
#_0880A9: db $2A, $26, $A5, $27, $30, $56, $A2, $56 ; かいぞうしゅじゅ
#_0880B1: db $36 ; つ
#_0880B2: db $FF ; end of message

;===================================================================================================

; レジスタンス
Message_00_00_15:
#_0880B3: db $86, $BB, $69, $6C, $8A, $69 ; レジスタンス
#_0880B9: db $FF ; end of message

;===================================================================================================

; リーダー
Message_00_00_16:
#_0880BA: db $84, $5A, $BF, $5A ; リーダー
#_0880BE: db $FF ; end of message

;===================================================================================================

; クーデター
Message_00_00_17:
#_0880BF: db $64, $5A, $C2, $6C, $5A ; クーデター
#_0880C4: db $FF ; end of message

;===================================================================================================

; シンジュク
Message_00_00_18:
#_0880C5: db $68, $8A, $BB, $90, $64 ; シンジュク
#_0880CA: db $FF ; end of message

;===================================================================================================

; イチガヤ
Message_00_00_19:
#_0880CB: db $5E, $6D, $B5, $80 ; イチガヤ
#_0880CF: db $FF ; end of message

;===================================================================================================

; イノガシラ こうえん
Message_00_00_1A:
#_0880D0: db $5E, $75, $B5, $68, $83, $CF, $2E, $27 ; イノガシラ⎵こう
#_0880D8: db $28, $52 ; えん
#_0880DA: db $FF ; end of message

;===================================================================================================

; アメリカ
Message_00_00_1B:
#_0880DB: db $5D, $7E, $84, $62 ; アメリカ
#_0880DF: db $FF ; end of message

;===================================================================================================

; トウキョウ
Message_00_00_1C:
#_0880E0: db $70, $5F, $63, $91, $5F ; トウキョウ
#_0880E5: db $FF ; end of message

;===================================================================================================

; ウフフフフ
Message_00_00_1D:
#_0880E6: db $5F, $78, $78, $78, $78 ; ウフフフフ
#_0880EB: db $FF ; end of message

;===================================================================================================

; さつじんようぎ
Message_00_00_1E:
#_0880EC: db $2F, $36, $A2, $52, $4A, $27, $9D ; さつじんようぎ
#_0880F3: db $FF ; end of message

;===================================================================================================

; とちょうまえひろば
Message_00_00_1F:
#_0880F4: db $38, $35, $57, $27, $43, $28, $3F, $4F ; とちょうまえひろ
#_0880FC: db $AB ; ば
#_0880FD: db $FF ; end of message

;===================================================================================================

; しれいかん
Message_00_00_20:
#_0880FE: db $30, $4E, $26, $2A, $52 ; しれいかん
#_088103: db $FF ; end of message

;===================================================================================================

; せんねんおうこく
Message_00_00_21:
#_088104: db $32, $52, $3C, $52, $29, $27, $2E, $2C ; せんねんおうこく
#_08810C: db $FF ; end of message

;===================================================================================================

; ジエイタイ
Message_00_00_22:
#_08810D: db $BB, $60, $5E, $6C, $5E ; ジエイタイ
#_088112: db $FF ; end of message

;===================================================================================================

; ルシファーさま
Message_00_00_23:
#_088113: db $85, $68, $78, $8B, $5A, $2F, $43 ; ルシファーさま
#_08811A: db $FF ; end of message

;===================================================================================================

; I.C.B.M.
Message_00_00_24:
#_08811B: db $13, $9B, $0D, $9B, $0C, $9B, $17, $9B ; I.C.B.M.
#_088123: db $FF ; end of message

;===================================================================================================

; >ダウンロードします
Message_00_00_25:
#_088124: db $97, $BF, $5F, $8A, $87, $5A, $C3, $30 ; >ダウンロードし
#_08812C: db $43, $31 ; ます
#_08812E: db $DF, $DF, $DF ; delay 7 frames [x3]
#_088131: db $FF ; end of message

;===================================================================================================

; >パラメーターに 18ポイントを
; ふりわけてください
Message_00_00_26:
#_088132: db $97, $C9, $83, $7E, $5A, $6C, $5A, $3A ; >パラメーターに
#_08813A: db $CF, $02, $09, $CD, $5E, $8A, $70, $51 ; ⎵18ポイントを
#_088142: db $F9 ; new line
#_088143: db $40, $4C, $50, $2D, $37, $2C, $A6, $2F ; ふりわけてくださ
#_08814B: db $26 ; い
#_08814C: db $FF ; end of message

;===================================================================================================

; これで いいですか?
Message_00_00_27:
#_08814D: db $2E, $4E, $A9, $CF, $26, $26, $A9, $31 ; これで⎵いいです
#_088155: db $2A, $95 ; か?
#_088157: db $FF ; end of message

;===================================================================================================

; ちからを かしてくれるか
Message_00_00_28:
#_088158: db $35, $2A, $4B, $51, $CF, $2A, $30, $37 ; ちからを⎵かして
#_088160: db $2C, $4E, $4D, $2A ; くれるか
#_088164: db $FF ; end of message

;===================================================================================================

; たすけられませんでした
Message_00_00_29:
#_088165: db $34, $31, $2D, $4B, $4E, $43, $32, $52 ; たすけられません
#_08816D: db $A9, $30, $34 ; でした
#_088170: db $FF ; end of message

;===================================================================================================

; かべに なにか かいてある
Message_00_00_2A:
#_088171: db $2A, $AE, $3A, $CF, $39, $3A, $2A, $CF ; かべに⎵なにか⎵
#_088179: db $2A, $26, $37, $25, $4D ; かいてある
#_08817E: db $FF ; end of message

;===================================================================================================

; とおすわけには いかないな
Message_00_00_2B:
#_08817F: db $38, $29, $31, $50, $2D, $3A, $3E, $CF ; とおすわけには⎵
#_088187: db $26, $2A, $39, $26, $39 ; いかないな
#_08818C: db $FF ; end of message

;===================================================================================================

; だれもいない
Message_00_00_2C:
#_08818D: db $A6, $4E, $47, $26, $39, $26 ; だれもいない
#_088193: db $FF ; end of message

;===================================================================================================

; てにいれた
Message_00_00_2D:
#_088194: db $37, $3A, $26, $4E, $34 ; てにいれた
#_088199: db $FF ; end of message

;===================================================================================================

; >なにを しますか?
Message_00_00_2E:
#_08819A: db $97, $39, $3A, $51, $CF, $30, $43, $31 ; >なにを⎵します
#_0881A2: db $2A, $95 ; か?
#_0881A4: db $FF ; end of message

;===================================================================================================

; ナカマに くわわった
Message_00_00_2F:
#_0881A5: db $71, $62, $7B, $3A, $CF, $2C, $50, $50 ; ナカマに⎵くわわ
#_0881AD: db $58, $34 ; った
#_0881AF: db $FF ; end of message

;===================================================================================================

; かいげんれい
Message_00_00_30:
#_0881B0: db $2A, $26, $9F, $52, $4E, $26 ; かいげんれい
#_0881B6: db $FF ; end of message

;===================================================================================================

; ありがとうございました
Message_00_00_31:
#_0881B7: db $25, $4C, $9C, $38, $27, $A0, $A1, $26 ; ありがとうござい
#_0881BF: db $43, $30, $34 ; ました
#_0881C2: db $FF ; end of message

;===================================================================================================

; いらっしゃいませ
Message_00_00_32:
#_0881C3: db $26, $4B, $58, $30, $55, $26, $43, $32 ; いらっしゃいませ
#_0881CB: db $FF ; end of message

;===================================================================================================

; メシアきょう
Message_00_00_33:
#_0881CC: db $7E, $68, $5D, $2B, $57, $27 ; メシアきょう
#_0881D2: db $FF ; end of message

;===================================================================================================

; ガイアきょう
Message_00_00_34:
#_0881D3: db $B5, $5E, $5D, $2B, $57, $27 ; ガイアきょう
#_0881D9: db $FF ; end of message

;===================================================================================================

; びょういん
Message_00_00_35:
#_0881DA: db $AC, $57, $27, $26, $52 ; びょういん
#_0881DF: db $FF ; end of message

;===================================================================================================

; コンゴウシンカイ
Message_00_00_36:
#_0881E0: db $66, $8A, $B9, $5F, $68, $8A, $62, $5E ; コンゴウシンカイ
#_0881E8: db $FF ; end of message

;===================================================================================================

; エンノオヅノ
Message_00_00_37:
#_0881E9: db $60, $8A, $75, $61, $C1, $75 ; エンノオヅノ
#_0881EF: db $FF ; end of message

;===================================================================================================

; なにか おちている
Message_00_00_38:
#_0881F0: db $39, $3A, $2A, $CF, $29, $35, $37, $26 ; なにか⎵おちてい
#_0881F8: db $4D ; る
#_0881F9: db $FF ; end of message

;===================================================================================================

; >«なにか おちている»
; 10mag を «てにいれた»
Message_00_00_39:
#_0881FA: db $97 ; >
#_0881FB: db $F2, $38 ; prewritten text 38
#_0881FD: db $FC ; wait for key and new line
#_0881FE: db $DC, $0A, $00, $00 ; give 10 MAG
#_088202: db $FA ; clear message box
#_088203: db $02, $01 ; 10
#_088205: db $FE, $66 ; ext command 66: write MAG
#_088207: db $CF, $51, $CF ; ⎵を⎵
#_08820A: db $F2, $2D ; prewritten text 2D
#_08820C: db $FC ; wait for key and new line
#_08820D: db $FF ; end of message

;===================================================================================================

; >ナカマだった [DEMON1]が いる
Message_00_00_3A:
#_08820E: db $D0, $EB ; set progress bit EB
#_088210: db $E4, $00 ; load demon $00
#_088212: db $97, $71, $62, $7B, $A6, $58, $34, $CF ; >ナカマだった⎵
#_08821A: db $F5 ; write demon name from $050A
#_08821B: db $9C, $CF, $26, $4D ; が⎵いる
#_08821F: db $FC ; wait for key and new line
#_088220: db $E9, $00, $40 ; go to message 40 maybe TODO
#_088223: db $FE, $09, $40 ; ext command 09: demon joins party or message 40 if full
#_088226: db $FE, $08, $04, $3B ; ext command 08: something with levels to message 3B, 04 TODO
#_08822A: db $D3, $40 ; go to message 40

;===================================================================================================

; [DEMON1]:
; [CHASE] じゃないか
; げんきだったようだな
Message_00_00_3B:
#_08822C: db $FE, $44, $3C ; ext command 44: something demons message 3C TODO
#_08822F: db $FA ; clear message box
#_088230: db $F5 ; write demon name from $050A
#_088231: db $9A ; :
#_088232: db $F9 ; new line
#_088233: db $F0 ; write player name
#_088234: db $CF, $A2, $55, $39, $26, $2A ; ⎵じゃないか
#_08823A: db $F9 ; new line
#_08823B: db $9F, $52, $2B, $A6, $58, $34, $4A, $27 ; げんきだったよう
#_088243: db $A6, $39 ; だな
#_088245: db $FC ; wait for key and new line
#_088246: db $D3, $3D ; go to message 3D

;===================================================================================================

; [DEMON1]:
; あーら [CHASE]じゃないの
; おひさしぶりね
Message_00_00_3C:
#_088248: db $FA ; clear message box
#_088249: db $F5 ; write demon name from $050A
#_08824A: db $9A ; :
#_08824B: db $F9 ; new line
#_08824C: db $25, $5A, $4B, $CF ; あーら⎵
#_088250: db $F0 ; write player name
#_088251: db $A2, $55, $39, $26, $3D ; じゃないの
#_088256: db $F9 ; new line
#_088257: db $29, $3F, $2F, $30, $AD, $4C, $3C ; おひさしぶりね
#_08825E: db $FC ; wait for key and new line

;===================================================================================================

; >また[DEMON1]«を ナカマに しますか?»
Message_00_00_3D:
#_08825F: db $FA ; clear message box
#_088260: db $97, $43, $34 ; >また
#_088263: db $F5 ; write demon name from $050A
#_088264: db $F2, $7E ; prewritten text 7E
#_088266: db $F8, $3E ; YES/NO - go to message 3E if YES
#_088268: db $FF ; end of message

;===================================================================================================

; [DEMON1]:
; «こんごとも よろしく・・・»
Message_00_00_3E:
#_088269: db $FE, $26, $04 ; ext command 26: something 04 TODO
#_08826C: db $D1, $EB ; clear progress bit EB
#_08826E: db $D4, $03 ; set text box size to 3
#_088270: db $F5 ; write demon name from $050A
#_088271: db $9A ; :
#_088272: db $F9 ; new line
#_088273: db $F2, $41 ; prewritten text 41
#_088275: db $FC ; wait for key and new line
#_088276: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_088278: db $FF ; end of message

;===================================================================================================

; しかし しらんかおを している
Message_00_00_40:
#_088279: db $FA ; clear message box
#_08827A: db $30, $2A, $30, $CF, $30, $4B, $52, $2A ; しかし⎵しらんか
#_088282: db $29, $51, $CF, $30, $37, $26, $4D ; おを⎵している
#_088289: db $FC ; wait for key and new line
#_08828A: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08828C: db $FF ; end of message

;===================================================================================================

; こんごとも よろしく«・・・»
Message_00_00_41:
#_08828D: db $2E, $52, $A0, $38, $47, $CF, $4A, $4F ; こんごとも⎵よろ
#_088295: db $30, $2C ; しく
#_088297: db $F2, $0B ; prewritten text 0B
#_088299: db $FF ; end of message

;===================================================================================================

; しせつけいさつ
Message_00_00_42:
#_08829A: db $30, $32, $36, $2D, $26, $2F, $36 ; しせつけいさつ
#_0882A1: db $FF ; end of message

;===================================================================================================

; では ナカマを へらして
Message_00_00_43:
#_0882A2: db $A9, $3E, $CF, $71, $62, $7B, $51, $CF ; では⎵ナカマを⎵
#_0882AA: db $41, $4B, $30, $37 ; へらして
#_0882AE: db $FF ; end of message

;===================================================================================================

; こうやって サケがのめる
Message_00_00_44:
#_0882AF: db $2E, $27, $48, $58, $37, $CF, $67, $65 ; こうやって⎵サケ
#_0882B7: db $9C, $3D, $46, $4D ; がのめる
#_0882BB: db $FF ; end of message

;===================================================================================================

; おんなのこえ:
; «・・・»たすけて«・・・»
; [CHASE]«・・・» たすけて«・・・»
; >[CHASE]の いしきのなかに
; おんなのこえが ひびいた«・・・»
Message_00_00_45:
#_0882BC: db $29, $52, $39, $3D, $2E, $28, $9A ; おんなのこえ:
#_0882C3: db $F9 ; new line
#_0882C4: db $F2, $0B ; prewritten text 0B
#_0882C6: db $34, $31, $2D, $37 ; たすけて
#_0882CA: db $F2, $0B ; prewritten text 0B
#_0882CC: db $F9 ; new line
#_0882CD: db $F0 ; write player name
#_0882CE: db $F2, $0B ; prewritten text 0B
#_0882D0: db $CF, $34, $31, $2D, $37 ; ⎵たすけて
#_0882D5: db $F2, $0B ; prewritten text 0B
#_0882D7: db $FC ; wait for key and new line
#_0882D8: db $FA ; clear message box
#_0882D9: db $97 ; >
#_0882DA: db $F0 ; write player name
#_0882DB: db $3D, $CF, $26, $30, $2B, $3D, $39, $2A ; の⎵いしきのなか
#_0882E3: db $3A ; に
#_0882E4: db $F9 ; new line
#_0882E5: db $29, $52, $39, $3D, $2E, $28, $9C, $CF ; おんなのこえが⎵
#_0882ED: db $3F, $AC, $26, $34 ; ひびいた
#_0882F1: db $F2, $0B ; prewritten text 0B
#_0882F3: db $FC ; wait for key and new line
#_0882F4: db $FF ; end of message

;===================================================================================================

; サイコダイバー
Message_00_00_46:
#_0882F5: db $67, $5E, $66, $BF, $5E, $C4, $5A ; サイコダイバー
#_0882FC: db $FF ; end of message

;===================================================================================================

; は おらぬようだな
Message_00_00_47:
#_0882FD: db $3E, $CF, $29, $4B, $3B, $4A, $27, $A6 ; は⎵おらぬようだ
#_088305: db $39 ; な
#_088306: db $FF ; end of message

;===================================================================================================

; みな げんきなようだな
Message_00_00_48:
#_088307: db $44, $39, $CF, $9F, $52, $2B, $39, $4A ; みな⎵げんきなよ
#_08830F: db $27, $A6, $39 ; うだな
#_088312: db $FF ; end of message

;===================================================================================================

; みな いきているようだな
Message_00_00_49:
#_088313: db $44, $39, $CF, $26, $2B, $37, $26, $4D ; みな⎵いきている
#_08831B: db $4A, $27, $A6, $39 ; ようだな
#_08831F: db $FF ; end of message

;===================================================================================================

; おねがいします
Message_00_00_4A:
#_088320: db $29, $3C, $9C, $26, $30, $43, $31 ; おねがいします
#_088327: db $FF ; end of message

;===================================================================================================

; とびらは あかない
Message_00_00_4B:
#_088328: db $38, $AC, $4B, $3E, $CF, $25, $2A, $39 ; とびらは⎵あかな
#_088330: db $26 ; い
#_088331: db $FF ; end of message

;===================================================================================================

; ロッポンギ
Message_00_00_4C:
#_088332: db $87, $92, $CD, $8A, $B6 ; ロッポンギ
#_088337: db $FF ; end of message

;===================================================================================================

; コントロール・システム
Message_00_00_4D:
#_088338: db $66, $8A, $70, $87, $5A, $85, $93, $68 ; コントロール・シ
#_088340: db $69, $6F, $7D ; ステム
#_088343: db $FF ; end of message

;===================================================================================================

; ほうせきを もってない
Message_00_00_4E:
#_088344: db $42, $27, $32, $2B, $51, $CF, $47, $58 ; ほうせきを⎵もっ
#_08834C: db $37, $39, $26 ; てない
#_08834F: db $FF ; end of message

;===================================================================================================

; どの ほうせきを こうかんするの?
Message_00_00_4F:
#_088350: db $AA, $3D, $CF, $42, $27, $32, $2B, $51 ; どの⎵ほうせきを
#_088358: db $CF, $2E, $27, $2A, $52, $31, $4D, $3D ; ⎵こうかんするの
#_088360: db $95 ; ?
#_088361: db $FF ; end of message

;===================================================================================================

; あかはくしゃく
Message_00_00_50:
#_088362: db $25, $2A, $3E, $2C, $30, $55, $2C ; あかはくしゃく
#_088369: db $FF ; end of message

;===================================================================================================

; くろだんしゃく
Message_00_00_51:
#_08836A: db $2C, $4F, $A6, $52, $30, $55, $2C ; くろだんしゃく
#_088371: db $FF ; end of message

;===================================================================================================

; あかおじさん
Message_00_00_52:
#_088372: db $25, $2A, $29, $A2, $2F, $52 ; あかおじさん
#_088378: db $FF ; end of message

;===================================================================================================

; くろおじさん
Message_00_00_53:
#_088379: db $2C, $4F, $29, $A2, $2F, $52 ; くろおじさん
#_08837F: db $FF ; end of message

;===================================================================================================

; «・・・»«・・・»«・・・»«・・・»«・・・»
; できた これで ストックできる
; ナカマが2たい ふえた
; わたしの «アクマしょうかん»«プログラム»も
Message_00_00_54:
#_088380: db $F2, $0B ; prewritten text 0B
#_088382: db $F2, $0B ; prewritten text 0B
#_088384: db $F2, $0B ; prewritten text 0B
#_088386: db $F2, $0B ; prewritten text 0B
#_088388: db $F2, $0B ; prewritten text 0B
#_08838A: db $F9 ; new line
#_08838B: db $A9, $2B, $34 ; できた
#_08838E: db $DF, $DF, $DF ; delay 7 frames [x3]
#_088391: db $CF, $2E, $4E, $A9, $CF, $69, $70, $92 ; ⎵これで⎵ストッ
#_088399: db $64, $A9, $2B, $4D ; クできる
#_08839D: db $F9 ; new line
#_08839E: db $71, $62, $7B, $9C, $03, $34, $26, $CF ; ナカマが2たい⎵
#_0883A6: db $40, $28, $34 ; ふえた
#_0883A9: db $F9 ; new line
#_0883AA: db $50, $34, $30, $3D, $CF ; わたしの⎵
#_0883AF: db $F2, $13 ; prewritten text 13
#_0883B1: db $F2, $08 ; prewritten text 08
#_0883B3: db $47 ; も
#_0883B4: db $FF ; end of message

;===================================================================================================

; つかいこなせる
Message_00_00_55:
#_0883B5: db $36, $2A, $26, $2E, $39, $32, $4D ; つかいこなせる
#_0883BC: db $FF ; end of message

;===================================================================================================

; エネルギー
Message_00_00_56:
#_0883BD: db $60, $74, $85, $B6, $5A ; エネルギー
#_0883C2: db $FF ; end of message

;===================================================================================================

; DATE:199Xー10ーX
Message_00_00_57:
#_0883C3: db $0E, $0B, $1E, $0F, $9A, $02, $0A, $0A ; DATE:199
#_0883CB: db $22, $5A, $02, $01, $5A, $22 ; Xー10ーX
#_0883D1: db $FF ; end of message

;===================================================================================================

; NAME:STEVEN
Message_00_00_58:
#_0883D2: db $18, $0B, $17, $0F, $9A, $1D, $1E, $0F ; NAME:STE
#_0883DA: db $20, $0F, $18 ; VEN
#_0883DD: db $FF ; end of message

;===================================================================================================

; オートマッピング
Message_00_00_59:
#_0883DE: db $61, $5A, $70, $7B, $92, $CA, $8A, $B7 ; オートマッピング
#_0883E6: db $FF ; end of message

;===================================================================================================

; セーブ かんりょう しました
Message_00_00_5A:
#_0883E7: db $6A, $5A, $C6, $CF, $2A, $52, $4C, $57 ; セーブ⎵かんりょ
#_0883EF: db $27, $CF, $30, $43, $30, $34 ; う⎵しました
#_0883F5: db $FC ; wait for key and new line
#_0883F6: db $FF ; end of message

;===================================================================================================

; ゲームを つづけますか?
Message_00_00_5B:
#_0883F7: db $B8, $5A, $7D, $51, $CF, $36, $A8, $2D ; ゲームを⎵つづけ
#_0883FF: db $43, $31, $2A, $95 ; ますか?
#_088403: db $FF ; end of message

;===================================================================================================

; カテドラル
Message_00_00_5C:
#_088404: db $62, $6F, $C3, $83, $85 ; カテドラル
#_088409: db $FF ; end of message

;===================================================================================================

; はやく・・・でんげんを・きって・・・くれ・・・
Message_00_00_5D:
#_08840A: db $FA ; clear message box
#_08840B: db $3E ; は
#_08840C: db $DF ; delay 7 frames
#_08840D: db $48 ; や
#_08840E: db $DF ; delay 7 frames
#_08840F: db $2C ; く
#_088410: db $DF ; delay 7 frames
#_088411: db $93 ; ・
#_088412: db $DF ; delay 7 frames
#_088413: db $93 ; ・
#_088414: db $DF ; delay 7 frames
#_088415: db $93 ; ・
#_088416: db $DF ; delay 7 frames
#_088417: db $A9 ; で
#_088418: db $DF ; delay 7 frames
#_088419: db $52 ; ん
#_08841A: db $DF ; delay 7 frames
#_08841B: db $9F ; げ
#_08841C: db $DF ; delay 7 frames
#_08841D: db $52 ; ん
#_08841E: db $DF ; delay 7 frames
#_08841F: db $51 ; を
#_088420: db $DF ; delay 7 frames
#_088421: db $93 ; ・
#_088422: db $DF ; delay 7 frames
#_088423: db $2B ; き
#_088424: db $DF ; delay 7 frames
#_088425: db $58 ; っ
#_088426: db $DF ; delay 7 frames
#_088427: db $37 ; て
#_088428: db $DF ; delay 7 frames
#_088429: db $93 ; ・
#_08842A: db $DF ; delay 7 frames
#_08842B: db $93 ; ・
#_08842C: db $DF ; delay 7 frames
#_08842D: db $93 ; ・
#_08842E: db $DF ; delay 7 frames
#_08842F: db $2C ; く
#_088430: db $DF ; delay 7 frames
#_088431: db $4E ; れ
#_088432: db $DF ; delay 7 frames
#_088433: db $93 ; ・
#_088434: db $DF ; delay 7 frames
#_088435: db $93 ; ・
#_088436: db $DF ; delay 7 frames
#_088437: db $93 ; ・
#_088438: db $DF ; delay 7 frames
#_088439: db $D3, $5E ; go to message 5E

;===================================================================================================

; なにに いたしましょう
Message_00_00_5F:
#_08843B: db $39, $3A, $3A, $CF, $26, $34, $30, $43 ; なにに⎵いたしま
#_088443: db $30, $57, $27 ; しょう
#_088446: db $FF ; end of message

;===================================================================================================

; すみませんが おかねが たりません
Message_00_00_60:
#_088447: db $31, $44, $43, $32, $52, $9C, $CF, $29 ; すみませんが⎵お
#_08844F: db $2A, $3C, $9C, $CF, $34, $4C, $43, $32 ; かねが⎵たりませ
#_088457: db $52 ; ん
#_088458: db $FF ; end of message

;===================================================================================================

; おつれさまは 
Message_00_00_61:
#_088459: db $29, $36, $4E, $2F, $43, $3E, $CF ; おつれさまは⎵
#_088460: db $FF ; end of message

;===================================================================================================

; デスティニーランド
Message_00_00_62:
#_088461: db $C2, $69, $6F, $8C, $72, $5A, $83, $8A ; デスティニーラン
#_088469: db $C3 ; ド
#_08846A: db $FF ; end of message

;===================================================================================================

; ほうのかみ
Message_00_00_63:
#_08846B: db $42, $27, $3D, $2A, $44 ; ほうのかみ
#_088470: db $FF ; end of message

;===================================================================================================

; グワッ グワッ
Message_00_00_64:
#_088471: db $B7, $88, $92, $CF, $B7, $88, $92 ; グワッ⎵グワッ
#_088478: db $FF ; end of message

;===================================================================================================

; オザワさま
Message_00_00_65:
#_088479: db $61, $BA, $88, $2F, $43 ; オザワさま
#_08847E: db $FF ; end of message

;===================================================================================================

; ロウヒーロー
Message_00_00_66:
#_08847F: db $87, $5F, $77, $5A, $87, $5A ; ロウヒーロー
#_088485: db $FF ; end of message

;===================================================================================================

; カオスヒーロー
Message_00_00_67:
#_088486: db $62, $61, $69, $77, $5A, $87, $5A ; カオスヒーロー
#_08848D: db $FF ; end of message

;===================================================================================================

; なかに はいりますか?
Message_00_00_68:
#_08848E: db $39, $2A, $3A, $CF, $3E, $26, $4C, $43 ; なかに⎵はいりま
#_088496: db $31, $2A, $95 ; すか?
#_088499: db $FF ; end of message

;===================================================================================================

; とびらは とざされている
Message_00_00_69:
#_08849A: db $38, $AC, $4B, $3E, $CF, $38, $A1, $2F ; とびらは⎵とざさ
#_0884A2: db $4E, $37, $26, $4D ; れている
#_0884A6: db $FF ; end of message

;===================================================================================================

; カオスヒロイン
Message_00_00_6A:
#_0884A7: db $62, $61, $69, $77, $87, $5E, $8A ; カオスヒロイン
#_0884AE: db $FF ; end of message

;===================================================================================================

; ハッハッハッハッ
Message_00_00_6B:
#_0884AF: db $76, $92, $76, $92, $76, $92, $76, $92 ; ハッハッハッハッ
#_0884B7: db $FF ; end of message

;===================================================================================================

; ルイ・サイファー
Message_00_00_6C:
#_0884B8: db $85, $5E, $93, $67, $5E, $78, $8B, $5A ; ルイ・サイファー
#_0884C0: db $FF ; end of message

;===================================================================================================

; アクマつかい
Message_00_00_6D:
#_0884C1: db $5D, $64, $7B, $36, $2A, $26 ; アクマつかい
#_0884C7: db $FF ; end of message

;===================================================================================================

; なにも うつっていない
Message_00_00_6E:
#_0884C8: db $39, $3A, $47, $CF, $27, $36, $58, $37 ; なにも⎵うつって
#_0884D0: db $26, $39, $26 ; いない
#_0884D3: db $FF ; end of message

;===================================================================================================

; かみの ごかごが あらんことを«・・・»
Message_00_00_6F:
#_0884D4: db $2A, $44, $3D, $CF, $A0, $2A, $A0, $9C ; かみの⎵ごかごが
#_0884DC: db $CF, $25, $4B, $52, $2E, $38, $51 ; ⎵あらんことを
#_0884E3: db $F2, $0B ; prewritten text 0B
#_0884E5: db $FF ; end of message

;===================================================================================================

; ここは «カテドラル»の ちゅうしんぶ らしい
Message_00_00_70:
#_0884E6: db $2E, $2E, $3E, $CF ; ここは⎵
#_0884EA: db $F2, $5C ; prewritten text 5C
#_0884EC: db $3D, $CF, $35, $56, $27, $30, $52, $AD ; の⎵ちゅうしんぶ
#_0884F4: db $CF, $4B, $30, $26 ; ⎵らしい
#_0884F8: db $FF ; end of message

;===================================================================================================

; せいしんの なか
Message_00_00_71:
#_0884F9: db $32, $26, $30, $52, $3D, $CF, $39, $2A ; せいしんの⎵なか
#_088501: db $FF ; end of message

;===================================================================================================

; みつけたが もちきれなかった
Message_00_00_72:
#_088502: db $44, $36, $2D, $34, $9C, $CF, $47, $35 ; みつけたが⎵もち
#_08850A: db $2B, $4E, $39, $2A, $58, $34 ; きれなかった
#_088510: db $FF ; end of message

;===================================================================================================

; どうぐー どうぐー べんりな どうぐー
Message_00_00_73:
#_088511: db $AA, $27, $9E, $5A ; どうぐー
#_088515: db $DF, $DF, $DF ; delay 7 frames [x3]
#_088518: db $CF, $AA, $27, $9E, $5A ; ⎵どうぐー
#_08851D: db $DF, $DF, $DF ; delay 7 frames [x3]
#_088520: db $CF, $AE, $52, $4C, $39, $CF, $AA, $27 ; ⎵べんりな⎵どう
#_088528: db $9E, $5A ; ぐー
#_08852A: db $FF ; end of message

;===================================================================================================

; >たからばこが ある
; あけますか?
Message_00_00_74:
#_08852B: db $D6, $00, $B6, $70, $48 ; place sprite B6 in slot 00 at XY:{70,48}
#_088530: db $97, $34, $2A, $4B, $AB, $2E, $9C, $CF ; >たからばこが⎵
#_088538: db $25, $4D ; ある
#_08853A: db $FC ; wait for key and new line
#_08853B: db $FA ; clear message box
#_08853C: db $25, $2D, $43, $31, $2A, $95 ; あけますか?
#_088542: db $FF ; end of message

;===================================================================================================

; [LEADER]は
; たからばこを あきらめた
Message_00_00_75:
#_088543: db $D4, $03 ; set text box size to 3
#_088545: db $F1 ; write leader's name for team
#_088546: db $3E ; は
#_088547: db $F9 ; new line
#_088548: db $34, $2A, $4B, $AB, $2E, $51, $CF, $25 ; たからばこを⎵あ
#_088550: db $2B, $4B, $46, $34 ; きらめた
#_088554: db $FF ; end of message

;===================================================================================================

; なかは からっぽだった
Message_00_00_76:
#_088555: db $D4, $03 ; set text box size to 3
#_088557: db $39, $2A, $3E, $CF, $2A, $4B, $58, $B4 ; なかは⎵からっぽ
#_08855F: db $A6, $58, $34 ; だった
#_088562: db $FF ; end of message

;===================================================================================================

; >[DEMON1]の ぞうが ある
Message_00_00_77:
#_088563: db $97 ; >
#_088564: db $F5 ; write demon name from $050A
#_088565: db $3D, $CF, $A5, $27, $9C, $CF, $25, $4D ; の⎵ぞうが⎵ある
#_08856D: db $FC ; wait for key and new line
#_08856E: db $FF ; end of message

;===================================================================================================

; [ITEM] [ITEM]
Message_00_00_78:
#_08856F: db $E1, $FA ; set $0A50 to item FA
#_088571: db $F3 ; write item name from $0A50
#_088572: db $CF ; ⎵
#_088573: db $E1, $F9 ; set $0A50 to item F9
#_088575: db $F3 ; write item name from $0A50
#_088576: db $F9 ; new line
#_088577: db $E1, $F8 ; set $0A50 to item F8
#_088579: db $FF ; end of message

;===================================================================================================

; では もちものを へらしてこい
Message_00_00_79:
#_08857A: db $A9, $3E, $CF, $47, $35, $47, $3D, $51 ; では⎵もちものを
#_088582: db $CF, $41, $4B, $30, $37, $2E, $26 ; ⎵へらしてこい
#_088589: db $FF ; end of message

;===================================================================================================

; ホーッホッホッホッホ
Message_00_00_7A:
#_08858A: db $7A, $5A, $92, $7A, $92, $7A, $92, $7A ; ホーッホッホッホ
#_088592: db $92, $7A ; ッホ
#_088594: db $FF ; end of message

;===================================================================================================

; >まだ せっきょうを ききますか?
Message_00_00_7B:
#_088595: db $97, $43, $A6, $CF, $32, $58, $2B, $57 ; >まだ⎵せっきょ
#_08859D: db $27, $51, $CF, $2B, $2B, $43, $31, $2A ; うを⎵ききますか
#_0885A5: db $95 ; ?
#_0885A6: db $FF ; end of message

;===================================================================================================

Message_00_00_7C:
#_0885A7: db $D6, $05, $9F, $60, $00 ; place sprite 9F in slot 05 at XY:{60,00}
#_0885AC: db $FE, $07, $0B ; ext command 07: draw buffered text then wait 10 frames
#_0885AF: db $D6, $05, $00 ; delete sprite in slot 05
#_0885B2: db $FE, $07, $10 ; ext command 07: draw buffered text then wait 15 frames
#_0885B5: db $D6, $05, $9F, $80, $00 ; place sprite 9F in slot 05 at XY:{80,00}
#_0885BA: db $FE, $07, $0B ; ext command 07: draw buffered text then wait 10 frames
#_0885BD: db $D6, $05, $00 ; delete sprite in slot 05
#_0885C0: db $FE, $07, $10 ; ext command 07: draw buffered text then wait 15 frames
#_0885C3: db $D6, $05, $9F, $70, $00 ; place sprite 9F in slot 05 at XY:{70,00}
#_0885C8: db $FE, $07, $0B ; ext command 07: draw buffered text then wait 10 frames
#_0885CB: db $D6, $05, $00 ; delete sprite in slot 05
#_0885CE: db $FE, $07, $08 ; ext command 07: draw buffered text then wait 7 frames
#_0885D1: db $D6, $05, $9F, $60, $00 ; place sprite 9F in slot 05 at XY:{60,00}
#_0885D6: db $FE, $07, $0B ; ext command 07: draw buffered text then wait 10 frames
#_0885D9: db $D6, $05, $00 ; delete sprite in slot 05
#_0885DC: db $FE, $07, $08 ; ext command 07: draw buffered text then wait 7 frames
#_0885DF: db $D6, $05, $9F, $70, $00 ; place sprite 9F in slot 05 at XY:{70,00}
#_0885E4: db $FE, $07, $08 ; ext command 07: draw buffered text then wait 7 frames
#_0885E7: db $D6, $05, $9F, $80, $00 ; place sprite 9F in slot 05 at XY:{80,00}
#_0885EC: db $FE, $07, $03 ; ext command 07: draw buffered text then wait 2 frames
#_0885EF: db $D6, $05, $00 ; delete sprite in slot 05
#_0885F2: db $FE, $07, $08 ; ext command 07: draw buffered text then wait 7 frames
#_0885F5: db $D6, $05, $00 ; delete sprite in slot 05
#_0885F8: db $FE, $07, $06 ; ext command 07: draw buffered text then wait 5 frames
#_0885FB: db $D6, $05, $9F, $60, $00 ; place sprite 9F in slot 05 at XY:{60,00}
#_088600: db $FE, $07, $07 ; ext command 07: draw buffered text then wait 6 frames
#_088603: db $D6, $05, $9F, $70, $00 ; place sprite 9F in slot 05 at XY:{70,00}
#_088608: db $FE, $07, $04 ; ext command 07: draw buffered text then wait 3 frames
#_08860B: db $D6, $05, $00 ; delete sprite in slot 05
#_08860E: db $FE, $07, $07 ; ext command 07: draw buffered text then wait 6 frames
#_088611: db $D6, $05, $00 ; delete sprite in slot 05
#_088614: db $FE, $07, $04 ; ext command 07: draw buffered text then wait 3 frames
#_088617: db $D6, $05, $9F, $80, $00 ; place sprite 9F in slot 05 at XY:{80,00}
#_08861C: db $FE, $07, $06 ; ext command 07: draw buffered text then wait 5 frames
#_08861F: db $D6, $05, $9F, $60, $00 ; place sprite 9F in slot 05 at XY:{60,00}
#_088624: db $FE, $07, $05 ; ext command 07: draw buffered text then wait 4 frames
#_088627: db $D6, $05, $00 ; delete sprite in slot 05
#_08862A: db $FE, $46, $09 ; ext command 46: 09 TODO
#_08862D: db $FE, $07, $06 ; ext command 07: draw buffered text then wait 5 frames
#_088630: db $D6, $05, $00 ; delete sprite in slot 05
#_088633: db $FE, $07, $03 ; ext command 07: draw buffered text then wait 2 frames
#_088636: db $FF ; end of message

;===================================================================================================

Message_00_00_7D:
#_088637: db $D6, $05, $9F, $80, $00 ; place sprite 9F in slot 05 at XY:{80,00}
#_08863C: db $FE, $07, $02 ; ext command 07: draw buffered text then wait 1 frames
#_08863F: db $D6, $05, $9F, $70, $00 ; place sprite 9F in slot 05 at XY:{70,00}
#_088644: db $FE, $07, $06 ; ext command 07: draw buffered text then wait 5 frames
#_088647: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_088649: db $D6, $00, $00 ; delete sprite in slot 00
#_08864C: db $FE, $07, $03 ; ext command 07: draw buffered text then wait 2 frames
#_08864F: db $D6, $05, $00 ; delete sprite in slot 05
#_088652: db $FE, $07, $02 ; ext command 07: draw buffered text then wait 1 frames
#_088655: db $D6, $05, $00 ; delete sprite in slot 05
#_088658: db $D6, $07, $00 ; delete sprite in slot 07
#_08865B: db $FF ; end of message

;===================================================================================================

; を ナカマに しますか?
Message_00_00_7E:
#_08865C: db $51, $CF, $71, $62, $7B, $3A, $CF, $30 ; を⎵ナカマに⎵し
#_088664: db $43, $31, $2A, $95 ; ますか?
#_088668: db $FF ; end of message

;===================================================================================================

; とつぜん [ITEM]が かがやきはじめた
; ひかりが すいめんを てらすと
Message_00_00_7F:
#_088669: db $38, $36, $A4, $52, $CF ; とつぜん⎵
#_08866E: db $F3 ; write item name from $0A50
#_08866F: db $9C, $CF, $2A, $9C, $48, $2B, $3E, $A2 ; が⎵かがやきはじ
#_088677: db $46, $34 ; めた
#_088679: db $F9 ; new line
#_08867A: db $3F, $2A, $4C, $9C, $CF, $31, $26, $46 ; ひかりが⎵すいめ
#_088682: db $52, $51, $CF, $37, $4B, $31, $38 ; んを⎵てらすと
#_088689: db $F9 ; new line
#_08868A: db $FF ; end of message

;===================================================================================================

; [ITEM]が うかびあがってきた
Message_00_00_80:
#_08868B: db $F3 ; write item name from $0A50
#_08868C: db $9C, $CF, $27, $2A, $AC, $25, $9C, $58 ; が⎵うかびあがっ
#_088694: db $37, $2B, $34 ; てきた
#_088697: db $FC ; wait for key and new line
#_088698: db $FF ; end of message

;===================================================================================================

; >[ITEM]が かがやき
; ひかりが とびらを てらした
Message_00_00_81:
#_088699: db $97 ; >
#_08869A: db $F3 ; write item name from $0A50
#_08869B: db $9C, $CF, $2A, $9C, $48, $2B ; が⎵かがやき
#_0886A1: db $F9 ; new line
#_0886A2: db $3F, $2A, $4C, $9C, $CF, $38, $AC, $4B ; ひかりが⎵とびら
#_0886AA: db $51, $CF, $37, $4B, $30, $34 ; を⎵てらした
#_0886B0: db $FC ; wait for key and new line
#_0886B1: db $FE, $1C, $03 ; ext command 1C: $03 TODO
#_0886B4: db $FF ; end of message

;===================================================================================================

; ははのこえ:
; [CHASE] いつまで ねてるの?
; やすみだからって ねぼうは ダメよ
; はやく おきてらっしゃい
Message_00_00_82:
#_0886B5: db $FA ; clear message box
#_0886B6: db $3E, $3E, $3D, $2E, $28, $9A ; ははのこえ:
#_0886BC: db $F9 ; new line
#_0886BD: db $F0 ; write player name
#_0886BE: db $CF, $26, $36, $43, $A9, $CF, $3C, $37 ; ⎵いつまで⎵ねて
#_0886C6: db $4D, $3D, $95 ; るの?
#_0886C9: db $F9 ; new line
#_0886CA: db $48, $31, $44, $A6, $2A, $4B, $58, $37 ; やすみだからって
#_0886D2: db $CF, $3C, $AF, $27, $3E, $CF, $BF, $7E ; ⎵ねぼうは⎵ダメ
#_0886DA: db $4A ; よ
#_0886DB: db $FC ; wait for key and new line
#_0886DC: db $FA ; clear message box
#_0886DD: db $3E, $48, $2C, $CF, $29, $2B, $37, $4B ; はやく⎵おきてら
#_0886E5: db $58, $30, $55, $26 ; っしゃい
#_0886E9: db $FC ; wait for key and new line
#_0886EA: db $FF ; end of message

;===================================================================================================

; くるまいすのおとこ
Message_00_00_83:
#_0886EB: db $2C, $4D, $43, $26, $31, $3D, $29, $38 ; くるまいすのおと
#_0886F3: db $2E ; こ
#_0886F4: db $FF ; end of message

;===================================================================================================

; >てつごうしは ビクともしない
Message_00_00_84:
#_0886F5: db $97, $37, $36, $A0, $27, $30, $3E, $CF ; >てつごうしは⎵
#_0886FD: db $C5, $64, $38, $47, $30, $39, $26 ; ビクともしない
#_088704: db $FC ; wait for key and new line
#_088705: db $FF ; end of message

;===================================================================================================

; やくにたって いるかね?
Message_00_00_85:
#_088706: db $48, $2C, $3A, $34, $58, $37, $CF, $26 ; やくにたって⎵い
#_08870E: db $4D, $2A, $3C, $95 ; るかね?
#_088712: db $FF ; end of message

;===================================================================================================

; マニュアル
Message_00_00_86:
#_088713: db $7B, $72, $90, $5D, $85 ; マニュアル
#_088718: db $FF ; end of message

;===================================================================================================

; セラフてんし
Message_00_00_87:
#_088719: db $6A, $83, $78, $37, $52, $30 ; セラフてんし
#_08871F: db $FF ; end of message

;===================================================================================================

; では もっと レベルを あげてこい
Message_00_00_88:
#_088720: db $A9, $3E, $CF, $47, $58, $38, $CF, $86 ; では⎵もっと⎵レ
#_088728: db $C7, $85, $51, $CF, $25, $9F, $37, $2E ; ベルを⎵あげてこ
#_088730: db $26 ; い
#_088731: db $FC ; wait for key and new line
#_088732: db $FF ; end of message

;===================================================================================================

; そとに でますか?
Message_00_00_89:
#_088733: db $33, $38, $3A, $CF, $A9, $43, $31, $2A ; そとに⎵でますか
#_08873B: db $95 ; ?
#_08873C: db $FF ; end of message

;===================================================================================================

; タイジョウロウクン
Message_00_00_8A:
#_08873D: db $6C, $5E, $BB, $91, $5F, $87, $5F, $64 ; タイジョウロウク
#_088745: db $8A ; ン
#_088746: db $FF ; end of message

;===================================================================================================

; しまいました
Message_00_00_8B:
#_088747: db $30, $43, $26, $43, $30, $34 ; しまいました
#_08874D: db $FF ; end of message

;===================================================================================================

; マッドサイエンティスト
Message_00_00_8C:
#_08874E: db $7B, $92, $C3, $67, $5E, $60, $8A, $6F ; マッドサイエンテ
#_088756: db $8C, $69, $70 ; ィスト
#_088759: db $FF ; end of message

;===================================================================================================

;                
Message_00_00_8D:
#_08875A: db $CF, $CF, $CF, $CF, $CF, $CF, $CF, $CF ; ⎵⎵⎵⎵⎵⎵⎵⎵
#_088762: db $CF, $CF, $CF, $CF, $CF, $CF, $CF ; ⎵⎵⎵⎵⎵⎵⎵
#_088769: db $FF ; end of message

;===================================================================================================

; オートロック
Message_00_00_8E:
#_08876A: db $61, $5A, $70, $87, $92, $64 ; オートロック
#_088770: db $FF ; end of message

;===================================================================================================

; いんちょう
Message_00_00_8F:
#_088771: db $26, $52, $35, $57, $27 ; いんちょう
#_088776: db $FF ; end of message

;===================================================================================================

; ターミナルシステム
Message_00_00_90:
#_088777: db $6C, $5A, $7C, $71, $85, $68, $69, $6F ; ターミナルシステ
#_08877F: db $7D ; ム
#_088780: db $FF ; end of message

;===================================================================================================

; みすぼらしいおとこ:
Message_00_00_91:
#_088781: db $44, $31, $AF, $4B, $30, $26, $29, $38 ; みすぼらしいおと
#_088789: db $2E, $9A ; こ:
#_08878B: db $F9 ; new line
#_08878C: db $FF ; end of message

;===================================================================================================

Message_00_01_00:
#_08878D: db $FA ; clear message box
#_08878E: db $FE, $31, $00 ; ext command 31: 00 TODO
#_088791: db $FC ; wait for key and new line

;===================================================================================================

Message_00_01_01:
#_088792: db $FA ; clear message box
#_088793: db $FE, $31, $01 ; ext command 31: 01 TODO
#_088796: db $FE, $32 ; ext command 32: something TODO
#_088798: db $FE, $33, $00, $02 ; ext command 33: 00 02 TODO
#_08879C: db $FE, $33, $01, $06 ; ext command 33: 01 06 TODO
#_0887A0: db $FE, $33, $02, $08 ; ext command 33: 02 08 TODO
#_0887A4: db $FE, $33, $03, $09 ; ext command 33: 03 09 TODO
#_0887A8: db $FE, $33, $04, $0A ; ext command 33: 04 0A TODO
#_0887AC: db $FE, $33, $05, $0A ; ext command 33: 05 0A TODO
#_0887B0: db $FE, $33, $06, $0A ; ext command 33: 06 0A TODO
#_0887B4: db $FE, $33, $07, $0D ; ext command 33: 07 0D TODO
#_0887B8: db $FE, $33, $FF, $0A ; ext command 33: FF 0A TODO

;===================================================================================================

Message_00_01_02:
#_0887BC: db $FA ; clear message box
#_0887BD: db $FE, $31, $02 ; ext command 31: 02 TODO
#_0887C0: db $FE, $34, $01 ; ext command 34: 01 TODO
#_0887C3: db $FA ; clear message box
#_0887C4: db $FE, $31, $03 ; ext command 31: 03 TODO
#_0887C7: db $F8, $04 ; YES/NO - go to message 04 if YES
#_0887C9: db $D3, $02 ; go to message 02

;===================================================================================================

; >アイテムが いっぱいです
Message_00_01_03:
#_0887CB: db $FA ; clear message box
#_0887CC: db $97, $5D, $5E, $6F, $7D, $9C, $CF, $26 ; >アイテムが⎵い
#_0887D4: db $58, $B0, $26, $A9, $31 ; っぱいです
#_0887D9: db $FC ; wait for key and new line
#_0887DA: db $D3, $01 ; go to message 01

;===================================================================================================

Message_00_01_04:
#_0887DC: db $FE, $3C, $03 ; ext command 3C: go to message 03 if no space for item
#_0887DF: db $FE, $35, $05 ; ext command 35: 05 TODO
#_0887E2: db $FE, $28 ; ext command 28: add item to inventory from $0A50
#_0887E4: db $FE, $54 ; ext command 54: take value in $0A14 away from money
#_0887E6: db $FE, $31, $05 ; ext command 31: 05 TODO
#_0887E9: db $F8, $02 ; YES/NO - go to message 02 if YES
#_0887EB: db $D3, $01 ; go to message 01

;===================================================================================================

Message_00_01_05:
#_0887ED: db $FA ; clear message box
#_0887EE: db $FE, $31, $04 ; ext command 31: 04 TODO
#_0887F1: db $FC ; wait for key and new line
#_0887F2: db $D3, $01 ; go to message 01

;===================================================================================================

Message_00_01_06:
#_0887F4: db $FE, $56, $0B ; ext command 56: Call routine 0FA412 (possibly message 0B) TODO
#_0887F7: db $FA ; clear message box
#_0887F8: db $FE, $31, $06 ; ext command 31: 06 TODO
#_0887FB: db $E3, $01 ; [COMMAND 13] go to message 01 maybe TODO
#_0887FD: db $FA ; clear message box
#_0887FE: db $FE, $31, $07 ; ext command 31: 07 TODO
#_088801: db $F8, $07 ; YES/NO - go to message 07 if YES
#_088803: db $D3, $06 ; go to message 06

;===================================================================================================

Message_00_01_07:
#_088805: db $FE, $29 ; ext command 29: take item from $0A51 TODO
#_088807: db $FE, $55 ; ext command 55: add value in $0A14 to money
#_088809: db $FE, $31, $08 ; ext command 31: 08 TODO
#_08880C: db $F8, $06 ; YES/NO - go to message 06 if YES
#_08880E: db $D3, $01 ; go to message 01

;===================================================================================================

Message_00_01_08:
#_088810: db $FE, $72, $01 ; ext command 72: 01 - equip roster
#_088813: db $D3, $01 ; go to message 01

;===================================================================================================

Message_00_01_09:
#_088815: db $FE, $72, $00 ; ext command 72: 00 - check status roster
#_088818: db $D3, $01 ; go to message 01

;===================================================================================================

Message_00_01_0A:
#_08881A: db $FA ; clear message box
#_08881B: db $FE, $31, $0B ; ext command 31: 0B TODO
#_08881E: db $FC ; wait for key and new line
#_08881F: db $FF ; end of message

;===================================================================================================

; うるものが ありません
Message_00_01_0B:
#_088820: db $FA ; clear message box
#_088821: db $27, $4D, $47, $3D, $9C, $CF, $25, $4C ; うるものが⎵あり
#_088829: db $43, $32, $52 ; ません
#_08882C: db $FC ; wait for key and new line
#_08882D: db $D3, $01 ; go to message 01

;===================================================================================================

; そうびするものが ありません
Message_00_01_0C:
#_08882F: db $FA ; clear message box
#_088830: db $33, $27, $AC, $31, $4D, $47, $3D, $9C ; そうびするものが
#_088838: db $CF, $25, $4C, $43, $32, $52 ; ⎵ありません
#_08883E: db $FC ; wait for key and new line
#_08883F: db $D3, $01 ; go to message 01

;===================================================================================================

; どうする?
Message_00_01_0D:
#_088841: db $FA ; clear message box
#_088842: db $AA, $27, $31, $4D, $95 ; どうする?
#_088847: db $D8, $02 ; option list with 3 options
#_088849: db $23, $0E ; option 1 [23]: go to message 0E
#_08884B: db $24, $0F ; option 2 [24]: go to message 0F
#_08884D: db $25, $01 ; option 3 [25]: go to message 01
#_08884F: db $D3, $01 ; go to message 01

;===================================================================================================

Message_00_01_0E:
#_088851: db $FD, $00 ; write $00 to $0A3B
#_088853: db $D3, $10 ; go to message 10

;===================================================================================================

Message_00_01_0F:
#_088855: db $FD, $01 ; write $01 to $0A3B

;===================================================================================================

; せいとん しゅうりょう
Message_00_01_10:
#_088857: db $FA ; clear message box
#_088858: db $FE, $75 ; ext command 75: Call routine 0FA470 TODO
#_08885A: db $32, $26, $38, $52, $CF, $30, $56, $27 ; せいとん⎵しゅう
#_088862: db $4C, $57, $27 ; りょう
#_088865: db $FC ; wait for key and new line
#_088866: db $D3, $01 ; go to message 01

;===================================================================================================

; サバイバルショップてんいん:
; «いらっしゃいませ»
; きたるべき せいきまつのよを いきぬくための
; しなを とりそろえております
Message_00_02_00:
#_088868: db $67, $C4, $5E, $C4, $85, $68, $91, $92 ; サバイバルショッ
#_088870: db $CB, $37, $52, $26, $52, $9A ; プてんいん:
#_088876: db $F9 ; new line
#_088877: db $F2, $32 ; prewritten text 32
#_088879: db $F9 ; new line
#_08887A: db $2B, $34, $4D, $AE, $2B, $CF, $32, $26 ; きたるべき⎵せい
#_088882: db $2B, $43, $36, $3D, $4A, $51, $CF, $26 ; きまつのよを⎵い
#_08888A: db $2B, $3B, $2C, $34, $46, $3D ; きぬくための
#_088890: db $F9 ; new line
#_088891: db $30, $39, $51, $CF, $38, $4C, $33, $4F ; しなを⎵とりそろ
#_088899: db $28, $37, $29, $4C, $43, $31 ; えております
#_08889F: db $F9 ; new line
#_0888A0: db $FF ; end of message

;===================================================================================================

; ごようを おもうしつけください
Message_00_02_01:
#_0888A1: db $A0, $4A, $27, $51, $CF, $29, $47, $27 ; ごようを⎵おもう
#_0888A9: db $30, $36, $2D, $2C, $A6, $2F, $26 ; しつけください
#_0888B0: db $F9 ; new line
#_0888B1: db $FF ; end of message

;===================================================================================================

; どれに いたしますか?
Message_00_02_02:
#_0888B2: db $AA, $4E, $3A, $CF, $26, $34, $30, $43 ; どれに⎵いたしま
#_0888BA: db $31, $2A, $95 ; すか?
#_0888BD: db $F9 ; new line
#_0888BE: db $FF ; end of message

;===================================================================================================

; [ITEM] は ¥[LONG]
; になりますが よろしいですか?
Message_00_02_03:
#_0888BF: db $F3 ; write item name from $0A50
#_0888C0: db $CF, $3E, $CF, $5B ; ⎵は⎵¥
#_0888C4: db $FB ; write 32-bit integer from $0A54
#_0888C5: db $F9 ; new line
#_0888C6: db $3A, $39, $4C, $43, $31, $9C, $CF, $4A ; になりますが⎵よ
#_0888CE: db $4F, $30, $26, $A9, $31, $2A, $95 ; ろしいですか?
#_0888D5: db $F9 ; new line
#_0888D6: db $FF ; end of message

;===================================================================================================

; とうてんは すべて ていかはんばい です
Message_00_02_04:
#_0888D7: db $38, $27, $37, $52, $3E, $CF, $31, $AE ; とうてんは⎵すべ
#_0888DF: db $37, $CF, $37, $26, $2A, $3E, $52, $AB ; て⎵ていかはんば
#_0888E7: db $26, $CF, $A9, $31 ; い⎵です
#_0888EB: db $F9 ; new line
#_0888EC: db $FF ; end of message

;===================================================================================================

; ほかに なにか おもとめ ですか?
Message_00_02_05:
#_0888ED: db $42, $2A, $3A, $CF, $39, $3A, $2A, $CF ; ほかに⎵なにか⎵
#_0888F5: db $29, $47, $38, $46, $CF, $A9, $31, $2A ; おもとめ⎵ですか
#_0888FD: db $95 ; ?
#_0888FE: db $F9 ; new line
#_0888FF: db $FF ; end of message

;===================================================================================================

; なにを ひきとりますか?
Message_00_02_06:
#_088900: db $39, $3A, $51, $CF, $3F, $2B, $38, $4C ; なにを⎵ひきとり
#_088908: db $43, $31, $2A, $95 ; ますか?
#_08890C: db $F9 ; new line
#_08890D: db $FF ; end of message

;===================================================================================================

; [ITEM] ですか ¥[LONG] で
; ひきとりますが よろしいでしょうか?
Message_00_02_07:
#_08890E: db $F3 ; write item name from $0A50
#_08890F: db $CF, $A9, $31, $2A, $CF, $5B ; ⎵ですか⎵¥
#_088915: db $FB ; write 32-bit integer from $0A54
#_088916: db $CF, $A9 ; ⎵で
#_088918: db $F9 ; new line
#_088919: db $3F, $2B, $38, $4C, $43, $31, $9C, $CF ; ひきとりますが⎵
#_088921: db $4A, $4F, $30, $26, $A9, $30, $57, $27 ; よろしいでしょう
#_088929: db $2A, $95 ; か?
#_08892B: db $F9 ; new line
#_08892C: db $FF ; end of message

;===================================================================================================

; ほかに なにか ひきとりましょうか?
Message_00_02_08:
#_08892D: db $42, $2A, $3A, $CF, $39, $3A, $2A, $CF ; ほかに⎵なにか⎵
#_088935: db $3F, $2B, $38, $4C, $43, $30, $57, $27 ; ひきとりましょう
#_08893D: db $2A, $95 ; か?
#_08893F: db $F9 ; new line
#_088940: db $FF ; end of message

;===================================================================================================

; なにを そうびしますか?
Message_00_02_09:
#_088941: db $39, $3A, $51, $CF, $33, $27, $AC, $30 ; なにを⎵そうびし
#_088949: db $43, $31, $2A, $95 ; ますか?
#_08894D: db $F9 ; new line
#_08894E: db $FF ; end of message

;===================================================================================================

; ほかに なにか そうびしますか?
Message_00_02_0A:
#_08894F: db $42, $2A, $3A, $CF, $39, $3A, $2A, $CF ; ほかに⎵なにか⎵
#_088957: db $33, $27, $AC, $30, $43, $31, $2A, $95 ; そうびしますか?
#_08895F: db $F9 ; new line
#_088960: db $FF ; end of message

;===================================================================================================

; «ありがとうございました»
; とうてんは あなたの じゅうじつした
; サバイバル・ライフを おやくそくします
Message_00_02_0B:
#_088961: db $F2, $31 ; prewritten text 31
#_088963: db $F9 ; new line
#_088964: db $38, $27, $37, $52, $3E, $CF, $25, $39 ; とうてんは⎵あな
#_08896C: db $34, $3D, $CF, $A2, $56, $27, $A2, $36 ; たの⎵じゅうじつ
#_088974: db $30, $34 ; した
#_088976: db $F9 ; new line
#_088977: db $67, $C4, $5E, $C4, $85, $93, $83, $5E ; サバイバル・ライ
#_08897F: db $78, $51, $CF, $29, $48, $2C, $33, $2C ; フを⎵おやくそく
#_088987: db $30, $43, $31 ; します
#_08898A: db $FF ; end of message

;===================================================================================================

; サバイバルショップてんいん:
; «いらっしゃいませ»
; あなたが ひさびさの おきゃくさんですよ
; ひとどおりが なくなりましたからね
Message_00_02_0C:
#_08898B: db $67, $C4, $5E, $C4, $85, $68, $91, $92 ; サバイバルショッ
#_088993: db $CB, $37, $52, $26, $52, $9A ; プてんいん:
#_088999: db $F9 ; new line
#_08899A: db $F2, $32 ; prewritten text 32
#_08899C: db $F9 ; new line
#_08899D: db $25, $39, $34, $9C, $CF, $3F, $2F, $AC ; あなたが⎵ひさび
#_0889A5: db $2F, $3D, $CF, $29, $2B, $55, $2C, $2F ; さの⎵おきゃくさ
#_0889AD: db $52, $A9, $31, $4A ; んですよ
#_0889B1: db $F9 ; new line
#_0889B2: db $3F, $38, $AA, $29, $4C, $9C, $CF, $39 ; ひとどおりが⎵な
#_0889BA: db $2C, $39, $4C, $43, $30, $34, $2A, $4B ; くなりましたから
#_0889C2: db $3C ; ね
#_0889C3: db $FF ; end of message

;===================================================================================================

; まあ ごゆっくりどうぞ
Message_00_02_0D:
#_0889C4: db $43, $25, $CF, $A0, $49, $58, $2C, $4C ; まあ⎵ごゆっくり
#_0889CC: db $AA, $27, $A5 ; どうぞ
#_0889CF: db $F9 ; new line
#_0889D0: db $FF ; end of message

;===================================================================================================

Message_00_02_0E:
#_0889D1: db $D3, $02 ; go to message 02

;===================================================================================================

Message_00_02_0F:
#_0889D3: db $D3, $03 ; go to message 03

;===================================================================================================

; このねだんで サービスしています
; まけるわけには・・・・・・
Message_00_02_10:
#_0889D5: db $2E, $3D, $3C, $A6, $52, $A9, $CF, $67 ; このねだんで⎵サ
#_0889DD: db $5A, $C5, $69, $30, $37, $26, $43, $31 ; ービスしています
#_0889E5: db $F9 ; new line
#_0889E6: db $43, $2D, $4D, $50, $2D, $3A, $3E, $93 ; まけるわけには・
#_0889EE: db $93, $93, $93, $93, $93 ; ・・・・・
#_0889F3: db $F9 ; new line
#_0889F4: db $FF ; end of message

;===================================================================================================

Message_00_02_11:
#_0889F5: db $D3, $05 ; go to message 05

;===================================================================================================

Message_00_02_12:
#_0889F7: db $D3, $06 ; go to message 06

;===================================================================================================

Message_00_02_13:
#_0889F9: db $D3, $07 ; go to message 07

;===================================================================================================

Message_00_02_14:
#_0889FB: db $D3, $08 ; go to message 08

;===================================================================================================

Message_00_02_15:
#_0889FD: db $D3, $09 ; go to message 09

;===================================================================================================

Message_00_02_16:
#_0889FF: db $D3, $0A ; go to message 0A

;===================================================================================================

; «ありがとうございました»
; また どうぞ
Message_00_02_17:
#_088A01: db $F2, $31 ; prewritten text 31
#_088A03: db $F9 ; new line
#_088A04: db $43, $34, $CF, $AA, $27, $A5 ; また⎵どうぞ
#_088A0A: db $FF ; end of message

;===================================================================================================

; ドラッグストアてんいん:
; «いらっしゃいませ»
; くすりのことなら うちに まかせてね
Message_00_02_18:
#_088A0B: db $C3, $83, $92, $B7, $69, $70, $5D, $37 ; ドラッグストアて
#_088A13: db $52, $26, $52, $9A ; んいん:
#_088A17: db $F9 ; new line
#_088A18: db $F2, $32 ; prewritten text 32
#_088A1A: db $F9 ; new line
#_088A1B: db $2C, $31, $4C, $3D, $2E, $38, $39, $4B ; くすりのことなら
#_088A23: db $CF, $27, $35, $3A, $CF, $43, $2A, $32 ; ⎵うちに⎵まかせ
#_088A2B: db $37, $3C ; てね
#_088A2D: db $F9 ; new line
#_088A2E: db $FF ; end of message

;===================================================================================================

; ごようは なに?
Message_00_02_19:
#_088A2F: db $A0, $4A, $27, $3E, $CF, $39, $3A, $95 ; ごようは⎵なに?
#_088A37: db $F9 ; new line
#_088A38: db $FF ; end of message

;===================================================================================================

; どれが ほしいのかしら?
Message_00_02_1A:
#_088A39: db $AA, $4E, $9C, $CF, $42, $30, $26, $3D ; どれが⎵ほしいの
#_088A41: db $2A, $30, $4B, $95 ; かしら?
#_088A45: db $F9 ; new line
#_088A46: db $FF ; end of message

;===================================================================================================

; [ITEM] ね ¥[LONG]
; になるけど いいかしら?
Message_00_02_1B:
#_088A47: db $F3 ; write item name from $0A50
#_088A48: db $CF, $3C, $CF, $5B ; ⎵ね⎵¥
#_088A4C: db $FB ; write 32-bit integer from $0A54
#_088A4D: db $F9 ; new line
#_088A4E: db $3A, $39, $4D, $2D, $AA, $CF, $26, $26 ; になるけど⎵いい
#_088A56: db $2A, $30, $4B, $95 ; かしら?
#_088A5A: db $F9 ; new line
#_088A5B: db $FF ; end of message

;===================================================================================================

; ごめんね おかねが たりないわ
Message_00_02_1C:
#_088A5C: db $A0, $46, $52, $3C, $CF, $29, $2A, $3C ; ごめんね⎵おかね
#_088A64: db $9C, $CF, $34, $4C, $39, $26, $50 ; が⎵たりないわ
#_088A6B: db $F9 ; new line
#_088A6C: db $FF ; end of message

;===================================================================================================

; ほかに なにか いりようかしら?
Message_00_02_1D:
#_088A6D: db $42, $2A, $3A, $CF, $39, $3A, $2A, $CF ; ほかに⎵なにか⎵
#_088A75: db $26, $4C, $4A, $27, $2A, $30, $4B, $95 ; いりようかしら?
#_088A7D: db $F9 ; new line
#_088A7E: db $FF ; end of message

;===================================================================================================

; どれを うってくれるのかしら?
Message_00_02_1E:
#_088A7F: db $AA, $4E, $51, $CF, $27, $58, $37, $2C ; どれを⎵うってく
#_088A87: db $4E, $4D, $3D, $2A, $30, $4B, $95 ; れるのかしら?
#_088A8E: db $F9 ; new line
#_088A8F: db $FF ; end of message

;===================================================================================================

; [ITEM] ね ¥[LONG] で
; かってあげるけど いいかしら?
Message_00_02_1F:
#_088A90: db $F3 ; write item name from $0A50
#_088A91: db $CF, $3C, $CF, $5B ; ⎵ね⎵¥
#_088A95: db $FB ; write 32-bit integer from $0A54
#_088A96: db $CF, $A9 ; ⎵で
#_088A98: db $F9 ; new line
#_088A99: db $2A, $58, $37, $25, $9F, $4D, $2D, $AA ; かってあげるけど
#_088AA1: db $CF, $26, $26, $2A, $30, $4B, $95 ; ⎵いいかしら?
#_088AA8: db $F9 ; new line
#_088AA9: db $FF ; end of message

;===================================================================================================

; ほかに なにか うってくれるのかしら?
Message_00_02_20:
#_088AAA: db $42, $2A, $3A, $CF, $39, $3A, $2A, $CF ; ほかに⎵なにか⎵
#_088AB2: db $27, $58, $37, $2C, $4E, $4D, $3D, $2A ; うってくれるのか
#_088ABA: db $30, $4B, $95 ; しら?
#_088ABD: db $F9 ; new line
#_088ABE: db $FF ; end of message

;===================================================================================================

; まいど どうも ありがとうね
Message_00_02_21:
#_088ABF: db $43, $26, $AA, $CF, $AA, $27, $47, $CF ; まいど⎵どうも⎵
#_088AC7: db $25, $4C, $9C, $38, $27, $3C ; ありがとうね
#_088ACD: db $FF ; end of message

;===================================================================================================

Message_00_02_24:
#_088ACE: db $D3, $18 ; go to message 18

;===================================================================================================

Message_00_02_25:
#_088AD0: db $D3, $19 ; go to message 19

;===================================================================================================

Message_00_02_26:
#_088AD2: db $D3, $1A ; go to message 1A

;===================================================================================================

Message_00_02_27:
#_088AD4: db $D3, $1B ; go to message 1B

;===================================================================================================

Message_00_02_28:
#_088AD6: db $D3, $1C ; go to message 1C

;===================================================================================================

Message_00_02_29:
#_088AD8: db $D3, $1D ; go to message 1D

;===================================================================================================

Message_00_02_2A:
#_088ADA: db $D3, $1E ; go to message 1E

;===================================================================================================

Message_00_02_2B:
#_088ADC: db $D3, $1F ; go to message 1F

;===================================================================================================

Message_00_02_2C:
#_088ADE: db $D3, $20 ; go to message 20

;===================================================================================================

Message_00_02_2D:
#_088AE0: db $D3, $23 ; go to message 23

;===================================================================================================

; ナイフショップてんいん:
; «いらっしゃいませ»
; ナイフのことは おまかせを
Message_00_02_30:
#_088AE2: db $71, $5E, $78, $68, $91, $92, $CB, $37 ; ナイフショップて
#_088AEA: db $52, $26, $52, $9A ; んいん:
#_088AEE: db $F9 ; new line
#_088AEF: db $F2, $32 ; prewritten text 32
#_088AF1: db $F9 ; new line
#_088AF2: db $71, $5E, $78, $3D, $2E, $38, $3E, $CF ; ナイフのことは⎵
#_088AFA: db $29, $43, $2A, $32, $51 ; おまかせを
#_088AFF: db $F9 ; new line
#_088B00: db $FF ; end of message

;===================================================================================================

; どれもじまんの いっぴんだ
Message_00_02_31:
#_088B01: db $AA, $4E, $47, $A2, $43, $52, $3D, $CF ; どれもじまんの⎵
#_088B09: db $26, $58, $B1, $52, $A6 ; いっぴんだ
#_088B0E: db $F9 ; new line
#_088B0F: db $FF ; end of message

;===================================================================================================

; どれに するのかな?
Message_00_02_32:
#_088B10: db $AA, $4E, $3A, $CF, $31, $4D, $3D, $2A ; どれに⎵するのか
#_088B18: db $39, $95 ; な?
#_088B1A: db $F9 ; new line
#_088B1B: db $FF ; end of message

;===================================================================================================

; [ITEM] か ¥[LONG]
; になるが よろしいかな
Message_00_02_33:
#_088B1C: db $F3 ; write item name from $0A50
#_088B1D: db $CF, $2A, $CF, $5B ; ⎵か⎵¥
#_088B21: db $FB ; write 32-bit integer from $0A54
#_088B22: db $F9 ; new line
#_088B23: db $3A, $39, $4D, $9C, $CF, $4A, $4F, $30 ; になるが⎵よろし
#_088B2B: db $26, $2A, $39 ; いかな
#_088B2E: db $F9 ; new line
#_088B2F: db $FF ; end of message

;===================================================================================================

; もうしわけない これより やすくは うれない
Message_00_02_34:
#_088B30: db $47, $27, $30, $50, $2D, $39, $26, $CF ; もうしわけない⎵
#_088B38: db $2E, $4E, $4A, $4C, $CF, $48, $31, $2C ; これより⎵やすく
#_088B40: db $3E, $CF, $27, $4E, $39, $26 ; は⎵うれない
#_088B46: db $F9 ; new line
#_088B47: db $FF ; end of message

;===================================================================================================

; ほかに なにか おもとめに なるかな?
Message_00_02_35:
#_088B48: db $42, $2A, $3A, $CF, $39, $3A, $2A, $CF ; ほかに⎵なにか⎵
#_088B50: db $29, $47, $38, $46, $3A, $CF, $39, $4D ; おもとめに⎵なる
#_088B58: db $2A, $39, $95 ; かな?
#_088B5B: db $F9 ; new line
#_088B5C: db $FF ; end of message

;===================================================================================================

; なにを ひきとらせて いただけるのか?
Message_00_02_36:
#_088B5D: db $39, $3A, $51, $CF, $3F, $2B, $38, $4B ; なにを⎵ひきとら
#_088B65: db $32, $37, $CF, $26, $34, $A6, $2D, $4D ; せて⎵いただける
#_088B6D: db $3D, $2A, $95 ; のか?
#_088B70: db $F9 ; new line
#_088B71: db $FF ; end of message

;===================================================================================================

; [ITEM] ですか ¥[LONG] で
; ひきとらせて いただくが よろしいか?
Message_00_02_37:
#_088B72: db $F3 ; write item name from $0A50
#_088B73: db $CF, $A9, $31, $2A, $CF, $5B ; ⎵ですか⎵¥
#_088B79: db $FB ; write 32-bit integer from $0A54
#_088B7A: db $CF, $A9 ; ⎵で
#_088B7C: db $F9 ; new line
#_088B7D: db $3F, $2B, $38, $4B, $32, $37, $CF, $26 ; ひきとらせて⎵い
#_088B85: db $34, $A6, $2C, $9C, $CF, $4A, $4F, $30 ; ただくが⎵よろし
#_088B8D: db $26, $2A, $95 ; いか?
#_088B90: db $F9 ; new line
#_088B91: db $FF ; end of message

;===================================================================================================

; ほかに なにか ひきとろうか?
Message_00_02_38:
#_088B92: db $42, $2A, $3A, $CF, $39, $3A, $2A, $CF ; ほかに⎵なにか⎵
#_088B9A: db $3F, $2B, $38, $4F, $27, $2A, $95 ; ひきとろうか?
#_088BA1: db $F9 ; new line
#_088BA2: db $FF ; end of message

;===================================================================================================

Message_00_02_39:
#_088BA3: db $D3, $09 ; go to message 09

;===================================================================================================

Message_00_02_3A:
#_088BA5: db $D3, $0A ; go to message 0A

;===================================================================================================

; «ありがとうございました»
; ひとを きずつけるのには つかわないでくれよ
Message_00_02_3B:
#_088BA7: db $F2, $31 ; prewritten text 31
#_088BA9: db $F9 ; new line
#_088BAA: db $3F, $38, $51, $CF, $2B, $A3, $36, $2D ; ひとを⎵きずつけ
#_088BB2: db $4D, $3D, $3A, $3E, $CF, $36, $2A, $50 ; るのには⎵つかわ
#_088BBA: db $39, $26, $A9, $2C, $4E, $4A ; ないでくれよ
#_088BC0: db $FF ; end of message

;===================================================================================================

Message_00_02_3C:
#_088BC1: db $D3, $30 ; go to message 30

;===================================================================================================

Message_00_02_3D:
#_088BC3: db $D3, $31 ; go to message 31

;===================================================================================================

Message_00_02_3E:
#_088BC5: db $D3, $32 ; go to message 32

;===================================================================================================

Message_00_02_3F:
#_088BC7: db $D3, $33 ; go to message 33

;===================================================================================================

Message_00_02_40:
#_088BC9: db $D3, $34 ; go to message 34

;===================================================================================================

Message_00_02_41:
#_088BCB: db $D3, $35 ; go to message 35

;===================================================================================================

Message_00_02_42:
#_088BCD: db $D3, $36 ; go to message 36

;===================================================================================================

Message_00_02_43:
#_088BCF: db $D3, $37 ; go to message 37

;===================================================================================================

Message_00_02_44:
#_088BD1: db $D3, $38 ; go to message 38

;===================================================================================================

Message_00_02_45:
#_088BD3: db $D3, $39 ; go to message 39

;===================================================================================================

Message_00_02_46:
#_088BD5: db $D3, $3A ; go to message 3A

;===================================================================================================

Message_00_02_47:
#_088BD7: db $D3, $3B ; go to message 3B

;===================================================================================================

; いま «おまえたち»が
; ほしいものを うってやる
Message_00_02_48:
#_088BD9: db $26, $43, $CF ; いま⎵
#_088BDC: db $F2, $04 ; prewritten text 04
#_088BDE: db $9C ; が
#_088BDF: db $F9 ; new line
#_088BE0: db $42, $30, $26, $47, $3D, $51, $CF, $27 ; ほしいものを⎵う
#_088BE8: db $58, $37, $48, $4D ; ってやる
#_088BEC: db $F9 ; new line
#_088BED: db $FF ; end of message

;===================================================================================================

; どれも せいのうは たしかだ
Message_00_02_49:
#_088BEE: db $AA, $4E, $47, $CF, $32, $26, $3D, $27 ; どれも⎵せいのう
#_088BF6: db $3E, $CF, $34, $30, $2A, $A6 ; は⎵たしかだ
#_088BFC: db $F9 ; new line
#_088BFD: db $FF ; end of message

;===================================================================================================

; どれに するのか?
Message_00_02_4A:
#_088BFE: db $AA, $4E, $3A, $CF, $31, $4D, $3D, $2A ; どれに⎵するのか
#_088C06: db $95 ; ?
#_088C07: db $F9 ; new line
#_088C08: db $FF ; end of message

;===================================================================================================

; [ITEM] か ¥[LONG] だ
Message_00_02_4B:
#_088C09: db $F3 ; write item name from $0A50
#_088C0A: db $CF, $2A, $CF, $5B ; ⎵か⎵¥
#_088C0E: db $FB ; write 32-bit integer from $0A54
#_088C0F: db $CF, $A6 ; ⎵だ
#_088C11: db $F9 ; new line
#_088C12: db $FF ; end of message

;===================================================================================================

; あぶないはし わたって
; てに いれたんだ
; ちゃんと かねを はらってくれ
Message_00_02_4C:
#_088C13: db $25, $AD, $39, $26, $3E, $30, $CF, $50 ; あぶないはし⎵わ
#_088C1B: db $34, $58, $37 ; たって
#_088C1E: db $F9 ; new line
#_088C1F: db $37, $3A, $CF, $26, $4E, $34, $52, $A6 ; てに⎵いれたんだ
#_088C27: db $F9 ; new line
#_088C28: db $35, $55, $52, $38, $CF, $2A, $3C, $51 ; ちゃんと⎵かねを
#_088C30: db $CF, $3E, $4B, $58, $37, $2C, $4E ; ⎵はらってくれ
#_088C37: db $F9 ; new line
#_088C38: db $FF ; end of message

;===================================================================================================

; まだ なにか ほしいのか?
Message_00_02_4D:
#_088C39: db $43, $A6, $CF, $39, $3A, $2A, $CF, $42 ; まだ⎵なにか⎵ほ
#_088C41: db $30, $26, $3D, $2A, $95 ; しいのか?
#_088C46: db $F9 ; new line
#_088C47: db $FF ; end of message

;===================================================================================================

; なにを ひきとればいいんだ?
Message_00_02_4E:
#_088C48: db $39, $3A, $51, $CF, $3F, $2B, $38, $4E ; なにを⎵ひきとれ
#_088C50: db $AB, $26, $26, $52, $A6, $95 ; ばいいんだ?
#_088C56: db $F9 ; new line
#_088C57: db $FF ; end of message

;===================================================================================================

; [ITEM] か ¥[LONG] で
; ひきとらせて もらう
; これいじょうは だせんな
Message_00_02_4F:
#_088C58: db $F3 ; write item name from $0A50
#_088C59: db $CF, $2A, $CF, $5B ; ⎵か⎵¥
#_088C5D: db $FB ; write 32-bit integer from $0A54
#_088C5E: db $CF, $A9 ; ⎵で
#_088C60: db $F9 ; new line
#_088C61: db $3F, $2B, $38, $4B, $32, $37, $CF, $47 ; ひきとらせて⎵も
#_088C69: db $4B, $27 ; らう
#_088C6B: db $F9 ; new line
#_088C6C: db $2E, $4E, $26, $A2, $57, $27, $3E, $CF ; これいじょうは⎵
#_088C74: db $A6, $32, $52, $39 ; だせんな
#_088C78: db $F9 ; new line
#_088C79: db $FF ; end of message

;===================================================================================================

; ほかに なにか ひきとらせる つもりか?
Message_00_02_50:
#_088C7A: db $42, $2A, $3A, $CF, $39, $3A, $2A, $CF ; ほかに⎵なにか⎵
#_088C82: db $3F, $2B, $38, $4B, $32, $4D, $CF, $36 ; ひきとらせる⎵つ
#_088C8A: db $47, $4C, $2A, $95 ; もりか?
#_088C8E: db $F9 ; new line
#_088C8F: db $FF ; end of message

;===================================================================================================

Message_00_02_51:
#_088C90: db $D3, $09 ; go to message 09

;===================================================================================================

Message_00_02_52:
#_088C92: db $D3, $0A ; go to message 0A

;===================================================================================================

; さいごに たよれるのは
; じぶんのうでと よいじゅうだ
; せいぜい いのちを たいせつにな
Message_00_02_53:
#_088C94: db $2F, $26, $A0, $3A, $CF, $34, $4A, $4E ; さいごに⎵たよれ
#_088C9C: db $4D, $3D, $3E ; るのは
#_088C9F: db $F9 ; new line
#_088CA0: db $A2, $AD, $52, $3D, $27, $A9, $38, $CF ; じぶんのうでと⎵
#_088CA8: db $4A, $26, $A2, $56, $27, $A6 ; よいじゅうだ
#_088CAE: db $F9 ; new line
#_088CAF: db $32, $26, $A4, $26, $CF, $26, $3D, $35 ; せいぜい⎵いのち
#_088CB7: db $51, $CF, $34, $26, $32, $36, $3A, $39 ; を⎵たいせつにな
#_088CBF: db $FF ; end of message

;===================================================================================================

; かみへの きもちを さしだせば
; せいなる しなものが あたえられよう
Message_00_02_54:
#_088CC0: db $2A, $44, $41, $3D, $CF, $2B, $47, $35 ; かみへの⎵きもち
#_088CC8: db $51, $CF, $2F, $30, $A6, $32, $AB ; を⎵さしだせば
#_088CCF: db $F9 ; new line
#_088CD0: db $32, $26, $39, $4D, $CF, $30, $39, $47 ; せいなる⎵しなも
#_088CD8: db $3D, $9C, $CF, $25, $34, $28, $4B, $4E ; のが⎵あたえられ
#_088CE0: db $4A, $27 ; よう
#_088CE2: db $F9 ; new line
#_088CE3: db $FF ; end of message

;===================================================================================================

; いずれも かみの ごかごが えられる しなじな
Message_00_02_55:
#_088CE4: db $26, $A3, $4E, $47, $CF, $2A, $44, $3D ; いずれも⎵かみの
#_088CEC: db $CF, $A0, $2A, $A0, $9C, $CF, $28, $4B ; ⎵ごかごが⎵えら
#_088CF4: db $4E, $4D, $CF, $30, $39, $A2, $39 ; れる⎵しなじな
#_088CFB: db $F9 ; new line
#_088CFC: db $FF ; end of message

;===================================================================================================

; どれに するのかな?
Message_00_02_56:
#_088CFD: db $AA, $4E, $3A, $CF, $31, $4D, $3D, $2A ; どれに⎵するのか
#_088D05: db $39, $95 ; な?
#_088D07: db $F9 ; new line
#_088D08: db $FF ; end of message

;===================================================================================================

; [ITEM] か ¥[LONG] を
; さしだされよ
Message_00_02_57:
#_088D09: db $F3 ; write item name from $0A50
#_088D0A: db $CF, $2A, $CF, $5B ; ⎵か⎵¥
#_088D0E: db $FB ; write 32-bit integer from $0A54
#_088D0F: db $CF, $51 ; ⎵を
#_088D11: db $F9 ; new line
#_088D12: db $2F, $30, $A6, $2F, $4E, $4A ; さしだされよ
#_088D18: db $FF ; end of message

;===================================================================================================

; かみへの きもちが たりないようだ«・・・»
Message_00_02_58:
#_088D19: db $2A, $44, $41, $3D, $CF, $2B, $47, $35 ; かみへの⎵きもち
#_088D21: db $9C, $CF, $34, $4C, $39, $26, $4A, $27 ; が⎵たりないよう
#_088D29: db $A6 ; だ
#_088D2A: db $F2, $0B ; prewritten text 0B
#_088D2C: db $F9 ; new line
#_088D2D: db $FF ; end of message

;===================================================================================================

; まだ いりようなものは あるのかな?
Message_00_02_59:
#_088D2E: db $43, $A6, $CF, $26, $4C, $4A, $27, $39 ; まだ⎵いりような
#_088D36: db $47, $3D, $3E, $CF, $25, $4D, $3D, $2A ; ものは⎵あるのか
#_088D3E: db $39, $95 ; な?
#_088D40: db $F9 ; new line
#_088D41: db $FF ; end of message

;===================================================================================================

; かみへの かんしゃは かかさぬように
Message_00_02_5A:
#_088D42: db $2A, $44, $41, $3D, $CF, $2A, $52, $30 ; かみへの⎵かんし
#_088D4A: db $55, $3E, $CF, $2A, $2A, $2F, $3B, $4A ; ゃは⎵かかさぬよ
#_088D52: db $27, $3A ; うに
#_088D54: db $FF ; end of message

;===================================================================================================

Message_00_02_60:
#_088D55: db $D3, $54 ; go to message 54

;===================================================================================================

Message_00_02_61:
#_088D57: db $D3, $55 ; go to message 55

;===================================================================================================

Message_00_02_62:
#_088D59: db $D3, $56 ; go to message 56

;===================================================================================================

Message_00_02_63:
#_088D5B: db $D3, $57 ; go to message 57

;===================================================================================================

Message_00_02_64:
#_088D5D: db $D3, $58 ; go to message 58

;===================================================================================================

Message_00_02_65:
#_088D5F: db $D3, $59 ; go to message 59

;===================================================================================================

Message_00_02_66:
#_088D61: db $D3, $5F ; go to message 5F
#_088D63: db $FF ; end of message

;===================================================================================================

; かねさえだせば やくだつものを わけてやろう
Message_00_02_6C:
#_088D64: db $2A, $3C, $2F, $28, $A6, $32, $AB, $CF ; かねさえだせば⎵
#_088D6C: db $48, $2C, $A6, $36, $47, $3D, $51, $CF ; やくだつものを⎵
#_088D74: db $50, $2D, $37, $48, $4F, $27 ; わけてやろう
#_088D7A: db $F9 ; new line
#_088D7B: db $FF ; end of message

;===================================================================================================

; いずれも まりょくを ひめたものだ
Message_00_02_6D:
#_088D7C: db $26, $A3, $4E, $47, $CF, $43, $4C, $57 ; いずれも⎵まりょ
#_088D84: db $2C, $51, $CF, $3F, $46, $34, $47, $3D ; くを⎵ひめたもの
#_088D8C: db $A6 ; だ
#_088D8D: db $F9 ; new line
#_088D8E: db $FF ; end of message

;===================================================================================================

; すきなものを えらぶのだ
Message_00_02_6E:
#_088D8F: db $31, $2B, $39, $47, $3D, $51, $CF, $28 ; すきなものを⎵え
#_088D97: db $4B, $AD, $3D, $A6 ; らぶのだ
#_088D9B: db $F9 ; new line
#_088D9C: db $FF ; end of message

;===================================================================================================

; [ITEM] か ¥[LONG]
; よこせば わけてやろう
Message_00_02_6F:
#_088D9D: db $F3 ; write item name from $0A50
#_088D9E: db $CF, $2A, $CF, $5B ; ⎵か⎵¥
#_088DA2: db $FB ; write 32-bit integer from $0A54
#_088DA3: db $F9 ; new line
#_088DA4: db $4A, $2E, $32, $AB, $CF, $50, $2D, $37 ; よこせば⎵わけて
#_088DAC: db $48, $4F, $27 ; やろう
#_088DAF: db $F9 ; new line
#_088DB0: db $FF ; end of message

;===================================================================================================

; かねを だせば わけてやると いっておろうが
Message_00_02_70:
#_088DB1: db $2A, $3C, $51, $CF, $A6, $32, $AB, $CF ; かねを⎵だせば⎵
#_088DB9: db $50, $2D, $37, $48, $4D, $38, $CF, $26 ; わけてやると⎵い
#_088DC1: db $58, $37, $29, $4F, $27, $9C ; っておろうが
#_088DC7: db $F9 ; new line
#_088DC8: db $FF ; end of message

;===================================================================================================

; まだ なにか ほしいのか?
Message_00_02_71:
#_088DC9: db $43, $A6, $CF, $39, $3A, $2A, $CF, $42 ; まだ⎵なにか⎵ほ
#_088DD1: db $30, $26, $3D, $2A, $95 ; しいのか?
#_088DD6: db $F9 ; new line
#_088DD7: db $FF ; end of message

;===================================================================================================

; かねを じゅうぶん もって くるのだ
Message_00_02_72:
#_088DD8: db $2A, $3C, $51, $CF, $A2, $56, $27, $AD ; かねを⎵じゅうぶ
#_088DE0: db $52, $CF, $47, $58, $37, $CF, $2C, $4D ; ん⎵もって⎵くる
#_088DE8: db $3D, $A6 ; のだ
#_088DEA: db $FF ; end of message

;===================================================================================================

; いりような ものが あれば おわけしよう
Message_00_02_78:
#_088DEB: db $26, $4C, $4A, $27, $39, $CF, $47, $3D ; いりような⎵もの
#_088DF3: db $9C, $CF, $25, $4E, $AB, $CF, $29, $50 ; が⎵あれば⎵おわ
#_088DFB: db $2D, $30, $4A, $27 ; けしよう
#_088DFF: db $F9 ; new line
#_088E00: db $FF ; end of message

;===================================================================================================

; わが どうじょうへ きふを していただきたい
Message_00_02_79:
#_088E01: db $50, $9C, $CF, $AA, $27, $A2, $57, $27 ; わが⎵どうじょう
#_088E09: db $41, $CF, $2B, $40, $51, $CF, $30, $37 ; へ⎵きふを⎵して
#_088E11: db $26, $34, $A6, $2B, $34, $26 ; いただきたい
#_088E17: db $F9 ; new line
#_088E18: db $FF ; end of message

;===================================================================================================

; どれが ほしいのか?
Message_00_02_7A:
#_088E19: db $AA, $4E, $9C, $CF, $42, $30, $26, $3D ; どれが⎵ほしいの
#_088E21: db $2A, $95 ; か?
#_088E23: db $F9 ; new line
#_088E24: db $FF ; end of message

;===================================================================================================

; [ITEM] ならば ¥[LONG] の
; きふを おねがいする
Message_00_02_7B:
#_088E25: db $F3 ; write item name from $0A50
#_088E26: db $CF, $39, $4B, $AB, $CF, $5B ; ⎵ならば⎵¥
#_088E2C: db $FB ; write 32-bit integer from $0A54
#_088E2D: db $CF, $3D ; ⎵の
#_088E2F: db $F9 ; new line
#_088E30: db $2B, $40, $51, $CF, $29, $3C, $9C, $26 ; きふを⎵おねがい
#_088E38: db $31, $4D ; する
#_088E3A: db $F9 ; new line
#_088E3B: db $FF ; end of message

;===================================================================================================

; きふが たりねば おわけできん
Message_00_02_7C:
#_088E3C: db $2B, $40, $9C, $CF, $34, $4C, $3C, $AB ; きふが⎵たりねば
#_088E44: db $CF, $29, $50, $2D, $A9, $2B, $52 ; ⎵おわけできん
#_088E4B: db $F9 ; new line
#_088E4C: db $FF ; end of message

;===================================================================================================

; まだ いりようなものは あるか?
Message_00_02_7D:
#_088E4D: db $43, $A6, $CF, $26, $4C, $4A, $27, $39 ; まだ⎵いりような
#_088E55: db $47, $3D, $3E, $CF, $25, $4D, $2A, $95 ; ものは⎵あるか?
#_088E5D: db $F9 ; new line
#_088E5E: db $FF ; end of message

;===================================================================================================

; では またの きかいに
; きふを おねがいしよう
Message_00_02_7E:
#_088E5F: db $A9, $3E, $CF, $43, $34, $3D, $CF, $2B ; では⎵またの⎵き
#_088E67: db $2A, $26, $3A ; かいに
#_088E6A: db $F9 ; new line
#_088E6B: db $2B, $40, $51, $CF, $29, $3C, $9C, $26 ; きふを⎵おねがい
#_088E73: db $30, $4A, $27 ; しよう
#_088E76: db $FF ; end of message

;===================================================================================================

; ぶきや:
; あんた ほんとうに きゃくだろうな?
Message_00_02_84:
#_088E77: db $AD, $2B, $48, $9A ; ぶきや:
#_088E7B: db $F9 ; new line
#_088E7C: db $25, $52, $34, $CF, $42, $52, $38, $27 ; あんた⎵ほんとう
#_088E84: db $3A, $CF, $2B, $55, $2C, $A6, $4F, $27 ; に⎵きゃくだろう
#_088E8C: db $39, $95 ; な?
#_088E8E: db $F9 ; new line
#_088E8F: db $FF ; end of message

;===================================================================================================

; ニンゲンは ほんと しんようできねえからな
Message_00_02_85:
#_088E90: db $72, $8A, $B8, $8A, $3E, $CF, $42, $52 ; ニンゲンは⎵ほん
#_088E98: db $38, $CF, $30, $52, $4A, $27, $A9, $2B ; と⎵しんようでき
#_088EA0: db $3C, $28, $2A, $4B, $39 ; ねえからな
#_088EA5: db $F9 ; new line
#_088EA6: db $FF ; end of message

;===================================================================================================

; あつかってるのは こんなもんだ どれにする?
Message_00_02_86:
#_088EA7: db $25, $36, $2A, $58, $37, $4D, $3D, $3E ; あつかってるのは
#_088EAF: db $CF, $2E, $52, $39, $47, $52, $A6, $CF ; ⎵こんなもんだ⎵
#_088EB7: db $AA, $4E, $3A, $31, $4D, $95 ; どれにする?
#_088EBD: db $F9 ; new line
#_088EBE: db $FF ; end of message

;===================================================================================================

; [ITEM] は ℏ[LONG] だ
; いいか?
Message_00_02_87:
#_088EBF: db $F3 ; write item name from $0A50
#_088EC0: db $CF, $3E, $CF, $5C ; ⎵は⎵ℏ
#_088EC4: db $FB ; write 32-bit integer from $0A54
#_088EC5: db $CF, $A6 ; ⎵だ
#_088EC7: db $F9 ; new line
#_088EC8: db $26, $26, $2A, $95 ; いいか?
#_088ECC: db $F9 ; new line
#_088ECD: db $FF ; end of message

;===================================================================================================

; かねが たりない!?
; まさか むりやり とってくんじゃ
; ねえだろうな?
Message_00_02_88:
#_088ECE: db $2A, $3C, $9C, $CF, $34, $4C, $39, $26 ; かねが⎵たりない
#_088ED6: db $94, $95 ; !?
#_088ED8: db $F9 ; new line
#_088ED9: db $43, $2F, $2A, $CF, $45, $4C, $48, $4C ; まさか⎵むりやり
#_088EE1: db $CF, $38, $58, $37, $2C, $52, $A2, $55 ; ⎵とってくんじゃ
#_088EE9: db $F9 ; new line
#_088EEA: db $3C, $28, $A6, $4F, $27, $39, $95 ; ねえだろうな?
#_088EF1: db $F9 ; new line
#_088EF2: db $FF ; end of message

;===================================================================================================

; ほかのものを かってくれるのか?
Message_00_02_89:
#_088EF3: db $42, $2A, $3D, $47, $3D, $51, $CF, $2A ; ほかのものを⎵か
#_088EFB: db $58, $37, $2C, $4E, $4D, $3D, $2A, $95 ; ってくれるのか?
#_088F03: db $F9 ; new line
#_088F04: db $FF ; end of message

;===================================================================================================

; なにを うってくれるんだ?
Message_00_02_8A:
#_088F05: db $39, $3A, $51, $CF, $27, $58, $37, $2C ; なにを⎵うってく
#_088F0D: db $4E, $4D, $52, $A6, $95 ; れるんだ?
#_088F12: db $F9 ; new line
#_088F13: db $FF ; end of message

;===================================================================================================

; [ITEM] は ℏ[LONG] が
; いいとこだな
Message_00_02_8B:
#_088F14: db $F3 ; write item name from $0A50
#_088F15: db $CF, $3E, $CF, $5C ; ⎵は⎵ℏ
#_088F19: db $FB ; write 32-bit integer from $0A54
#_088F1A: db $CF, $9C ; ⎵が
#_088F1C: db $F9 ; new line
#_088F1D: db $26, $26, $38, $2E, $A6, $39 ; いいとこだな
#_088F23: db $F9 ; new line
#_088F24: db $FF ; end of message

;===================================================================================================

; ほかに なにか うってくれるのか?
Message_00_02_8C:
#_088F25: db $42, $2A, $3A, $CF, $39, $3A, $2A, $CF ; ほかに⎵なにか⎵
#_088F2D: db $27, $58, $37, $2C, $4E, $4D, $3D, $2A ; うってくれるのか
#_088F35: db $95 ; ?
#_088F36: db $F9 ; new line
#_088F37: db $FF ; end of message

;===================================================================================================

Message_00_02_8D:
#_088F38: db $D3, $39 ; go to message 39

;===================================================================================================

Message_00_02_8E:
#_088F3A: db $D3, $3A ; go to message 3A

;===================================================================================================

; いいぶき もってても
; うでが わるけりゃ むだだからな
; ヘマしたのを ぶきのせいにして
; さかうらみすんのは かんべんしてくれよ
Message_00_02_8F:
#_088F3C: db $26, $26, $AD, $2B, $CF, $47, $58, $37 ; いいぶき⎵もって
#_088F44: db $37, $47 ; ても
#_088F46: db $F9 ; new line
#_088F47: db $27, $A9, $9C, $CF, $50, $4D, $2D, $4C ; うでが⎵わるけり
#_088F4F: db $55, $CF, $45, $A6, $A6, $2A, $4B, $39 ; ゃ⎵むだだからな
#_088F57: db $F9 ; new line
#_088F58: db $79, $7B, $30, $34, $3D, $51, $CF, $AD ; ヘマしたのを⎵ぶ
#_088F60: db $2B, $3D, $32, $26, $3A, $30, $37 ; きのせいにして
#_088F67: db $F9 ; new line
#_088F68: db $2F, $2A, $27, $4B, $44, $31, $52, $3D ; さかうらみすんの
#_088F70: db $3E, $CF, $2A, $52, $AE, $52, $30, $37 ; は⎵かんべんして
#_088F78: db $2C, $4E, $4A ; くれよ
#_088F7B: db $F9 ; new line
#_088F7C: db $FF ; end of message

;===================================================================================================

; ぼうぐや:
; うちの しなは ほりだしもの ぞろいさ
Message_00_02_90:
#_088F7D: db $AF, $27, $9E, $48, $9A ; ぼうぐや:
#_088F82: db $F9 ; new line
#_088F83: db $27, $35, $3D, $CF, $30, $39, $3E, $CF ; うちの⎵しなは⎵
#_088F8B: db $42, $4C, $A6, $30, $47, $3D, $CF, $A5 ; ほりだしもの⎵ぞ
#_088F93: db $4F, $26, $2F ; ろいさ
#_088F96: db $F9 ; new line
#_088F97: db $FF ; end of message

;===================================================================================================

; ほんとに ほりだしてきたのも あるけどね
Message_00_02_91:
#_088F98: db $42, $52, $38, $3A, $CF, $42, $4C, $A6 ; ほんとに⎵ほりだ
#_088FA0: db $30, $37, $2B, $34, $3D, $47, $CF, $25 ; してきたのも⎵あ
#_088FA8: db $4D, $2D, $AA, $3C ; るけどね
#_088FAC: db $F9 ; new line
#_088FAD: db $FF ; end of message

;===================================================================================================

; どうだ この しなぞろえ
Message_00_02_92:
#_088FAE: db $AA, $27, $A6, $CF, $2E, $3D, $CF, $30 ; どうだ⎵この⎵し
#_088FB6: db $39, $A5, $4F, $28 ; なぞろえ
#_088FBA: db $F9 ; new line
#_088FBB: db $FF ; end of message

;===================================================================================================

; [ITEM] は ℏ[LONG]
; O.K.?
Message_00_02_93:
#_088FBC: db $F3 ; write item name from $0A50
#_088FBD: db $CF, $3E, $CF, $5C ; ⎵は⎵ℏ
#_088FC1: db $FB ; write 32-bit integer from $0A54
#_088FC2: db $F9 ; new line
#_088FC3: db $19, $9B, $15, $9B, $95 ; O.K.?
#_088FC8: db $F9 ; new line
#_088FC9: db $FF ; end of message

;===================================================================================================

; かねは きっちり はらって もらわねえとな
Message_00_02_94:
#_088FCA: db $2A, $3C, $3E, $CF, $2B, $58, $35, $4C ; かねは⎵きっちり
#_088FD2: db $CF, $3E, $4B, $58, $37, $CF, $47, $4B ; ⎵はらって⎵もら
#_088FDA: db $50, $3C, $28, $38, $39 ; わねえとな
#_088FDF: db $F9 ; new line
#_088FE0: db $FF ; end of message

;===================================================================================================

; ほかの ものは いるかい?
Message_00_02_95:
#_088FE1: db $42, $2A, $3D, $CF, $47, $3D, $3E, $CF ; ほかの⎵ものは⎵
#_088FE9: db $26, $4D, $2A, $26, $95 ; いるかい?
#_088FEE: db $F9 ; new line
#_088FEF: db $FF ; end of message

;===================================================================================================

; ああ うりものも かんげいするよ なんだい?
Message_00_02_96:
#_088FF0: db $25, $25, $CF, $27, $4C, $47, $3D, $47 ; ああ⎵うりものも
#_088FF8: db $CF, $2A, $52, $9F, $26, $31, $4D, $4A ; ⎵かんげいするよ
#_089000: db $CF, $39, $52, $A6, $26, $95 ; ⎵なんだい?
#_089006: db $F9 ; new line
#_089007: db $FF ; end of message

;===================================================================================================

; [ITEM] ねえ ℏ[LONG] で
; どうだ?
Message_00_02_97:
#_089008: db $F3 ; write item name from $0A50
#_089009: db $CF, $3C, $28, $CF, $5C ; ⎵ねえ⎵ℏ
#_08900E: db $FB ; write 32-bit integer from $0A54
#_08900F: db $CF, $A9 ; ⎵で
#_089011: db $F9 ; new line
#_089012: db $AA, $27, $A6, $95 ; どうだ?
#_089016: db $F9 ; new line
#_089017: db $FF ; end of message

;===================================================================================================

; まだ なにか うってくれるのかい?
Message_00_02_98:
#_089018: db $43, $A6, $CF, $39, $3A, $2A, $CF, $27 ; まだ⎵なにか⎵う
#_089020: db $58, $37, $2C, $4E, $4D, $3D, $2A, $26 ; ってくれるのかい
#_089028: db $95 ; ?
#_089029: db $F9 ; new line
#_08902A: db $FF ; end of message

;===================================================================================================

Message_00_02_99:
#_08902B: db $D3, $39 ; go to message 39

;===================================================================================================

Message_00_02_9A:
#_08902D: db $D3, $3A ; go to message 3A

;===================================================================================================

; むかしから いうじゃない
; そなえあれば うれいなし ってね
; また きてくれよ
Message_00_02_9B:
#_08902F: db $45, $2A, $30, $2A, $4B, $CF, $26, $27 ; むかしから⎵いう
#_089037: db $A2, $55, $39, $26 ; じゃない
#_08903B: db $F9 ; new line
#_08903C: db $33, $39, $28, $25, $4E, $AB, $CF, $27 ; そなえあれば⎵う
#_089044: db $4E, $26, $39, $30, $CF, $58, $37, $3C ; れいなし⎵ってね
#_08904C: db $F9 ; new line
#_08904D: db $43, $34, $CF, $2B, $37, $2C, $4E, $4A ; また⎵きてくれよ
#_089055: db $F9 ; new line
#_089056: db $FF ; end of message

;===================================================================================================

; ジャンクや:
; «・・・»なんだ きゃくか«・・・»
Message_00_02_9C:
#_089057: db $BB, $8F, $8A, $64, $48, $9A ; ジャンクや:
#_08905D: db $F9 ; new line
#_08905E: db $F2, $0B ; prewritten text 0B
#_089060: db $39, $52, $A6, $CF, $2B, $55, $2C, $2A ; なんだ⎵きゃくか
#_089068: db $F2, $0B ; prewritten text 0B
#_08906A: db $F9 ; new line
#_08906B: db $FF ; end of message

;===================================================================================================

; なにか ほしいのか?
Message_00_02_9D:
#_08906C: db $39, $3A, $2A, $CF, $42, $30, $26, $3D ; なにか⎵ほしいの
#_089074: db $2A, $95 ; か?
#_089076: db $F9 ; new line
#_089077: db $FF ; end of message

;===================================================================================================

; どれに するんだ?
Message_00_02_9E:
#_089078: db $AA, $4E, $3A, $CF, $31, $4D, $52, $A6 ; どれに⎵するんだ
#_089080: db $95 ; ?
#_089081: db $F9 ; new line
#_089082: db $FF ; end of message

;===================================================================================================

; [ITEM]«・・・»ℏ[LONG]だ
; いいのか?
Message_00_02_9F:
#_089083: db $F3 ; write item name from $0A50
#_089084: db $F2, $0B ; prewritten text 0B
#_089086: db $5C ; ℏ
#_089087: db $FB ; write 32-bit integer from $0A54
#_089088: db $A6 ; だ
#_089089: db $F9 ; new line
#_08908A: db $26, $26, $3D, $2A, $95 ; いいのか?
#_08908F: db $F9 ; new line
#_089090: db $FF ; end of message

;===================================================================================================

; かねが たりんぞ«・・・»
Message_00_02_A0:
#_089091: db $2A, $3C, $9C, $CF, $34, $4C, $52, $A5 ; かねが⎵たりんぞ
#_089099: db $F2, $0B ; prewritten text 0B
#_08909B: db $F9 ; new line
#_08909C: db $FF ; end of message

;===================================================================================================

; まだ 
Message_00_02_A1:
#_08909D: db $43, $A6, $CF ; まだ⎵
#_0890A0: db $D3, $9D ; go to message 9D

;===================================================================================================

; さっさと ブツを だしな
Message_00_02_A2:
#_0890A2: db $2F, $58, $2F, $38, $CF, $C6, $6E, $51 ; さっさと⎵ブツを
#_0890AA: db $CF, $A6, $30, $39 ; ⎵だしな
#_0890AE: db $F9 ; new line
#_0890AF: db $FF ; end of message

;===================================================================================================

Message_00_02_A3:
#_0890B0: db $D3, $9F ; go to message 9F

;===================================================================================================

; まだ あるのか?
Message_00_02_A4:
#_0890B2: db $43, $A6, $CF, $25, $4D, $3D, $2A, $95 ; まだ⎵あるのか?
#_0890BA: db $F9 ; new line
#_0890BB: db $FF ; end of message

;===================================================================================================

; ようが すんだら とっとと かえれ
Message_00_02_A5:
#_0890BC: db $4A, $27, $9C, $CF, $31, $52, $A6, $4B ; ようが⎵すんだら
#_0890C4: db $CF, $38, $58, $38, $38, $CF, $2A, $28 ; ⎵とっとと⎵かえ
#_0890CC: db $4E ; れ
#_0890CD: db $F9 ; new line
#_0890CE: db $FF ; end of message

;===================================================================================================

Message_00_02_A8:
#_0890CF: db $D3, $9C ; go to message 9C

;===================================================================================================

Message_00_02_A9:
#_0890D1: db $D3, $9D ; go to message 9D

;===================================================================================================

Message_00_02_AA:
#_0890D3: db $D3, $9E ; go to message 9E

;===================================================================================================

Message_00_02_AB:
#_0890D5: db $D3, $9F ; go to message 9F

;===================================================================================================

Message_00_02_AC:
#_0890D7: db $D3, $A0 ; go to message A0

;===================================================================================================

Message_00_02_AD:
#_0890D9: db $D3, $A1 ; go to message A1

;===================================================================================================

Message_00_02_AE:
#_0890DB: db $D3, $A2 ; go to message A2

;===================================================================================================

Message_00_02_AF:
#_0890DD: db $D3, $A3 ; go to message A3

;===================================================================================================

Message_00_02_B0:
#_0890DF: db $D3, $A4 ; go to message A4

;===================================================================================================

Message_00_02_B1:
#_0890E1: db $D3, $A7 ; go to message A7
#_0890E3: db $FF ; end of message

;===================================================================================================

; ぶきや:
; ぶきは いらんか«・・・»
Message_00_02_B4:
#_0890E4: db $AD, $2B, $48, $9A ; ぶきや:
#_0890E8: db $F9 ; new line
#_0890E9: db $AD, $2B, $3E, $CF, $26, $4B, $52, $2A ; ぶきは⎵いらんか
#_0890F1: db $F2, $0B ; prewritten text 0B
#_0890F3: db $F9 ; new line
#_0890F4: db $FF ; end of message

;===================================================================================================

; ぶきが ほしいのか?
Message_00_02_B5:
#_0890F5: db $AD, $2B, $9C, $CF, $42, $30, $26, $3D ; ぶきが⎵ほしいの
#_0890FD: db $2A, $95 ; か?
#_0890FF: db $F9 ; new line
#_089100: db $FF ; end of message

;===================================================================================================

; どれだ?
Message_00_02_B6:
#_089101: db $AA, $4E, $A6, $95 ; どれだ?
#_089105: db $F9 ; new line
#_089106: db $FF ; end of message

;===================================================================================================

Message_00_02_B7:
#_089107: db $D3, $9F ; go to message 9F

;===================================================================================================

Message_00_02_B8:
#_089109: db $D3, $A0 ; go to message A0

;===================================================================================================

; まだ 
Message_00_02_B9:
#_08910B: db $43, $A6, $CF ; まだ⎵
#_08910E: db $D3, $B5 ; go to message B5

;===================================================================================================

; なんだ? はやく だせ
Message_00_02_BA:
#_089110: db $39, $52, $A6, $95, $CF, $3E, $48, $2C ; なんだ?⎵はやく
#_089118: db $CF, $A6, $32 ; ⎵だせ
#_08911B: db $F9 ; new line
#_08911C: db $FF ; end of message

;===================================================================================================

Message_00_02_BB:
#_08911D: db $D3, $9F ; go to message 9F

;===================================================================================================

; まだあるのか? 
Message_00_02_BC:
#_08911F: db $43, $A6, $25, $4D, $3D, $2A, $95, $CF ; まだあるのか?⎵
#_089127: db $D3, $BA ; go to message BA

;===================================================================================================

Message_00_02_BD:
#_089129: db $D3, $39 ; go to message 39

;===================================================================================================

Message_00_02_BE:
#_08912B: db $D3, $3A ; go to message 3A

;===================================================================================================

; «・・・»«・・・»«・・・»«・・・»
Message_00_02_BF:
#_08912D: db $F2, $0B ; prewritten text 0B
#_08912F: db $F2, $0B ; prewritten text 0B
#_089131: db $F2, $0B ; prewritten text 0B
#_089133: db $F2, $0B ; prewritten text 0B
#_089135: db $F9 ; new line
#_089136: db $FF ; end of message

;===================================================================================================

Message_00_02_C0:
#_089137: db $D3, $90 ; go to message 90

;===================================================================================================

Message_00_02_C1:
#_089139: db $D3, $91 ; go to message 91

;===================================================================================================

Message_00_02_C2:
#_08913B: db $D3, $92 ; go to message 92

;===================================================================================================

Message_00_02_C3:
#_08913D: db $D3, $93 ; go to message 93

;===================================================================================================

Message_00_02_C4:
#_08913F: db $D3, $94 ; go to message 94

;===================================================================================================

Message_00_02_C5:
#_089141: db $D3, $95 ; go to message 95

;===================================================================================================

Message_00_02_C6:
#_089143: db $D3, $96 ; go to message 96

;===================================================================================================

Message_00_02_C7:
#_089145: db $D3, $97 ; go to message 97

;===================================================================================================

Message_00_02_C8:
#_089147: db $D3, $98 ; go to message 98

;===================================================================================================

Message_00_02_C9:
#_089149: db $D3, $99 ; go to message 99

;===================================================================================================

Message_00_02_CA:
#_08914B: db $D3, $9A ; go to message 9A

;===================================================================================================

Message_00_02_CB:
#_08914D: db $D3, $9B ; go to message 9B

;===================================================================================================

; ジャンクや:
; «どうぐー どうぐー べんりな どうぐー»
Message_00_02_CC:
#_08914F: db $BB, $8F, $8A, $64, $48, $9A ; ジャンクや:
#_089155: db $F9 ; new line
#_089156: db $F2, $73 ; prewritten text 73
#_089158: db $F9 ; new line
#_089159: db $FF ; end of message

;===================================================================================================

; Separate, unused message?
; かってやって ください
Message_08915A:
#_08915A: db $2A, $58, $37, $48, $58, $37, $CF, $2C ; かってやって⎵く
#_089162: db $A6, $2F, $26 ; ださい
#_089165: db $F9 ; new line
#_089166: db $FF ; end of message

;===================================================================================================

; べんりな どうぐが そろってます
Message_00_02_CD:
#_089167: db $AE, $52, $4C, $39, $CF, $AA, $27, $9E ; べんりな⎵どうぐ
#_08916F: db $9C, $CF, $33, $4F, $58, $37, $43, $31 ; が⎵そろってます
#_089177: db $F9 ; new line
#_089178: db $FF ; end of message

;===================================================================================================

; どれに いたしましょう?
Message_00_02_CE:
#_089179: db $AA, $4E, $3A, $CF, $26, $34, $30, $43 ; どれに⎵いたしま
#_089181: db $30, $57, $27, $95 ; しょう?
#_089185: db $F9 ; new line
#_089186: db $FF ; end of message

;===================================================================================================

; [ITEM]ですか«・・・»[ITEM]は
; ℏ[LONG]で ございます
; よろしいでしょうか?
Message_00_02_CF:
#_089187: db $F3 ; write item name from $0A50
#_089188: db $A9, $31, $2A ; ですか
#_08918B: db $F2, $0B ; prewritten text 0B
#_08918D: db $F3 ; write item name from $0A50
#_08918E: db $3E ; は
#_08918F: db $F9 ; new line
#_089190: db $5C ; ℏ
#_089191: db $FB ; write 32-bit integer from $0A54
#_089192: db $A9, $CF, $A0, $A1, $26, $43, $31 ; で⎵ございます
#_089199: db $F9 ; new line
#_08919A: db $4A, $4F, $30, $26, $A9, $30, $57, $27 ; よろしいでしょう
#_0891A2: db $2A, $95 ; か?
#_0891A4: db $F9 ; new line
#_0891A5: db $FF ; end of message

;===================================================================================================

; おかね«・・・»たりません
Message_00_02_D0:
#_0891A6: db $29, $2A, $3C ; おかね
#_0891A9: db $F2, $0B ; prewritten text 0B
#_0891AB: db $34, $4C, $43, $32, $52 ; たりません
#_0891B0: db $F9 ; new line
#_0891B1: db $FF ; end of message

;===================================================================================================

; おつぎは 
Message_00_02_D1:
#_0891B2: db $29, $36, $9D, $3E, $CF ; おつぎは⎵
#_0891B7: db $D3, $CE ; go to message CE

;===================================================================================================

; うりものは なんで ございましょう?
Message_00_02_D2:
#_0891B9: db $27, $4C, $47, $3D, $3E, $CF, $39, $52 ; うりものは⎵なん
#_0891C1: db $A9, $CF, $A0, $A1, $26, $43, $30, $57 ; で⎵ございましょ
#_0891C9: db $27, $95 ; う?
#_0891CB: db $F9 ; new line
#_0891CC: db $FF ; end of message

;===================================================================================================

Message_00_02_D3:
#_0891CD: db $D3, $CF ; go to message CF

;===================================================================================================

; まだ ありますか?
Message_00_02_D4:
#_0891CF: db $43, $A6, $CF, $25, $4C, $43, $31, $2A ; まだ⎵ありますか
#_0891D7: db $95 ; ?
#_0891D8: db $F9 ; new line
#_0891D9: db $FF ; end of message

;===================================================================================================

; まいど «ありがとうございました»
; «どうぐー どうぐー べんりな どうぐー»
Message_00_02_D5:
#_0891DA: db $43, $26, $AA, $CF ; まいど⎵
#_0891DE: db $F2, $31 ; prewritten text 31
#_0891E0: db $F9 ; new line
#_0891E1: db $F2, $73 ; prewritten text 73
#_0891E3: db $F9 ; new line
#_0891E4: db $FF ; end of message
#_0891E5: db $FF ; end of message

;===================================================================================================

Message_00_02_D8:
#_0891E6: db $D3, $84 ; go to message 84

;===================================================================================================

Message_00_02_D9:
#_0891E8: db $D3, $85 ; go to message 85

;===================================================================================================

Message_00_02_DA:
#_0891EA: db $D3, $86 ; go to message 86

;===================================================================================================

Message_00_02_DB:
#_0891EC: db $D3, $87 ; go to message 87

;===================================================================================================

Message_00_02_DC:
#_0891EE: db $D3, $88 ; go to message 88

;===================================================================================================

Message_00_02_DD:
#_0891F0: db $D3, $89 ; go to message 89

;===================================================================================================

Message_00_02_DE:
#_0891F2: db $D3, $8A ; go to message 8A

;===================================================================================================

Message_00_02_DF:
#_0891F4: db $D3, $8B ; go to message 8B

;===================================================================================================

Message_00_02_E0:
#_0891F6: db $D3, $8C ; go to message 8C

;===================================================================================================

Message_00_02_E1:
#_0891F8: db $D3, $39 ; go to message 39

;===================================================================================================

Message_00_02_E2:
#_0891FA: db $D3, $3A ; go to message 3A

;===================================================================================================

Message_00_02_E3:
#_0891FC: db $D3, $8F ; go to message 8F
#_0891FE: db $FF ; end of message

;===================================================================================================

Message_00_02_E4:
#_0891FF: db $D3, $90 ; go to message 90

;===================================================================================================

Message_00_02_E5:
#_089201: db $D3, $91 ; go to message 91

;===================================================================================================

Message_00_02_E6:
#_089203: db $D3, $92 ; go to message 92

;===================================================================================================

Message_00_02_E7:
#_089205: db $D3, $93 ; go to message 93

;===================================================================================================

Message_00_02_E8:
#_089207: db $D3, $94 ; go to message 94

;===================================================================================================

Message_00_02_E9:
#_089209: db $D3, $95 ; go to message 95

;===================================================================================================

Message_00_02_EA:
#_08920B: db $D3, $96 ; go to message 96

;===================================================================================================

Message_00_02_EB:
#_08920D: db $D3, $97 ; go to message 97

;===================================================================================================

Message_00_02_EC:
#_08920F: db $D3, $98 ; go to message 98

;===================================================================================================

Message_00_02_ED:
#_089211: db $D3, $39 ; go to message 39

;===================================================================================================

Message_00_02_EE:
#_089213: db $D3, $3A ; go to message 3A

;===================================================================================================

Message_00_02_EF:
#_089215: db $D3, $9B ; go to message 9B

;===================================================================================================

Message_00_02_F0:
#_089217: db $D3, $9C ; go to message 9C

;===================================================================================================

Message_00_02_F1:
#_089219: db $D3, $9D ; go to message 9D

;===================================================================================================

Message_00_02_F2:
#_08921B: db $D3, $9E ; go to message 9E

;===================================================================================================

Message_00_02_F3:
#_08921D: db $D3, $9F ; go to message 9F

;===================================================================================================

Message_00_02_F4:
#_08921F: db $D3, $A0 ; go to message A0

;===================================================================================================

Message_00_02_F5:
#_089221: db $D3, $A1 ; go to message A1

;===================================================================================================

Message_00_02_F6:
#_089223: db $D3, $A2 ; go to message A2

;===================================================================================================

Message_00_02_F7:
#_089225: db $D3, $A3 ; go to message A3

;===================================================================================================

Message_00_02_F8:
#_089227: db $D3, $A4 ; go to message A4

;===================================================================================================

Message_00_02_F9:
#_089229: db $D3, $A7 ; go to message A7

;===================================================================================================

Message_00_03_00:
#_08922B: db $FE, $1D, $23, $01 ; ext command 1D: load classy message 0123

;===================================================================================================

Message_00_03_01:
#_08922F: db $FE, $1D, $24, $01 ; ext command 1D: load classy message 0124

;===================================================================================================

Message_00_03_02:
#_089233: db $FE, $1D, $25, $01 ; ext command 1D: load classy message 0125

;===================================================================================================

Message_00_03_03:
#_089237: db $FE, $1D, $26, $01 ; ext command 1D: load classy message 0126

;===================================================================================================

Message_00_03_04:
#_08923B: db $FE, $1D, $27, $01 ; ext command 1D: load classy message 0127

;===================================================================================================

Message_00_03_05:
#_08923F: db $FE, $1D, $28, $01 ; ext command 1D: load classy message 0128

;===================================================================================================

Message_00_03_06:
#_089243: db $FE, $1D, $29, $01 ; ext command 1D: load classy message 0129

;===================================================================================================

Message_00_03_07:
#_089247: db $FE, $1D, $2A, $01 ; ext command 1D: load classy message 012A

;===================================================================================================

Message_00_03_08:
#_08924B: db $FE, $1D, $2B, $01 ; ext command 1D: load classy message 012B

;===================================================================================================

Message_00_03_09:
#_08924F: db $FE, $1D, $2C, $01 ; ext command 1D: load classy message 012C

;===================================================================================================

Message_00_03_0A:
#_089253: db $FE, $1D, $2D, $01 ; ext command 1D: load classy message 012D

;===================================================================================================

Message_00_03_0B:
#_089257: db $FE, $1D, $2E, $01 ; ext command 1D: load classy message 012E
#_08925B: db $FF ; end of message

;===================================================================================================

Message_00_03_0C:
#_08925C: db $FE, $1D, $2F, $01 ; ext command 1D: load classy message 012F

;===================================================================================================

Message_00_03_0D:
#_089260: db $FE, $1D, $30, $01 ; ext command 1D: load classy message 0130

;===================================================================================================

Message_00_03_0E:
#_089264: db $FE, $1D, $31, $01 ; ext command 1D: load classy message 0131

;===================================================================================================

Message_00_03_0F:
#_089268: db $FE, $1D, $32, $01 ; ext command 1D: load classy message 0132

;===================================================================================================

Message_00_03_10:
#_08926C: db $FE, $1D, $33, $01 ; ext command 1D: load classy message 0133

;===================================================================================================

Message_00_03_11:
#_089270: db $FE, $1D, $34, $01 ; ext command 1D: load classy message 0134

;===================================================================================================

Message_00_03_12:
#_089274: db $FE, $1D, $35, $01 ; ext command 1D: load classy message 0135

;===================================================================================================

Message_00_03_13:
#_089278: db $FE, $1D, $36, $01 ; ext command 1D: load classy message 0136

;===================================================================================================

Message_00_03_14:
#_08927C: db $FE, $1D, $37, $01 ; ext command 1D: load classy message 0137

;===================================================================================================

Message_00_03_15:
#_089280: db $FE, $1D, $38, $01 ; ext command 1D: load classy message 0138

;===================================================================================================

Message_00_03_16:
#_089284: db $FE, $1D, $39, $01 ; ext command 1D: load classy message 0139

;===================================================================================================

Message_00_03_17:
#_089288: db $FE, $1D, $3A, $01 ; ext command 1D: load classy message 013A

;===================================================================================================

Message_00_03_18:
#_08928C: db $FE, $1D, $47, $01 ; ext command 1D: load classy message 0147

;===================================================================================================

Message_00_03_19:
#_089290: db $FE, $1D, $48, $01 ; ext command 1D: load classy message 0148

;===================================================================================================

Message_00_03_1A:
#_089294: db $FE, $1D, $49, $01 ; ext command 1D: load classy message 0149

;===================================================================================================

Message_00_03_1B:
#_089298: db $FE, $1D, $4A, $01 ; ext command 1D: load classy message 014A

;===================================================================================================

Message_00_03_1C:
#_08929C: db $FE, $1D, $4B, $01 ; ext command 1D: load classy message 014B

;===================================================================================================

Message_00_03_1D:
#_0892A0: db $FE, $1D, $4C, $01 ; ext command 1D: load classy message 014C

;===================================================================================================

Message_00_03_1E:
#_0892A4: db $FE, $1D, $4D, $01 ; ext command 1D: load classy message 014D

;===================================================================================================

Message_00_03_1F:
#_0892A8: db $FE, $1D, $4E, $01 ; ext command 1D: load classy message 014E

;===================================================================================================

Message_00_03_20:
#_0892AC: db $FE, $1D, $4F, $01 ; ext command 1D: load classy message 014F

;===================================================================================================

Message_00_03_21:
#_0892B0: db $FE, $1D, $50, $01 ; ext command 1D: load classy message 0150

;===================================================================================================

Message_00_03_22:
#_0892B4: db $FE, $1D, $51, $01 ; ext command 1D: load classy message 0151

;===================================================================================================

Message_00_03_23:
#_0892B8: db $FE, $1D, $52, $01 ; ext command 1D: load classy message 0152

;===================================================================================================

Message_00_03_24:
#_0892BC: db $FE, $1D, $23, $01 ; ext command 1D: load classy message 0123

;===================================================================================================

Message_00_03_25:
#_0892C0: db $FE, $1D, $24, $01 ; ext command 1D: load classy message 0124

;===================================================================================================

Message_00_03_26:
#_0892C4: db $FE, $1D, $25, $01 ; ext command 1D: load classy message 0125

;===================================================================================================

Message_00_03_27:
#_0892C8: db $FE, $1D, $26, $01 ; ext command 1D: load classy message 0126

;===================================================================================================

Message_00_03_28:
#_0892CC: db $FE, $1D, $27, $01 ; ext command 1D: load classy message 0127

;===================================================================================================

Message_00_03_29:
#_0892D0: db $FE, $1D, $28, $01 ; ext command 1D: load classy message 0128

;===================================================================================================

Message_00_03_2A:
#_0892D4: db $FE, $1D, $29, $01 ; ext command 1D: load classy message 0129

;===================================================================================================

Message_00_03_2B:
#_0892D8: db $FE, $1D, $2A, $01 ; ext command 1D: load classy message 012A

;===================================================================================================

Message_00_03_2C:
#_0892DC: db $FE, $1D, $2B, $01 ; ext command 1D: load classy message 012B

;===================================================================================================

Message_00_03_2D:
#_0892E0: db $FE, $1D, $2C, $01 ; ext command 1D: load classy message 012C

;===================================================================================================

Message_00_03_2E:
#_0892E4: db $FE, $1D, $2D, $01 ; ext command 1D: load classy message 012D

;===================================================================================================

Message_00_03_2F:
#_0892E8: db $FE, $1D, $2E, $01 ; ext command 1D: load classy message 012E

;===================================================================================================

Message_00_03_30:
#_0892EC: db $FE, $1D, $5F, $01 ; ext command 1D: load classy message 015F

;===================================================================================================

Message_00_03_31:
#_0892F0: db $FE, $1D, $60, $01 ; ext command 1D: load classy message 0160

;===================================================================================================

Message_00_03_32:
#_0892F4: db $FE, $1D, $61, $01 ; ext command 1D: load classy message 0161

;===================================================================================================

Message_00_03_33:
#_0892F8: db $FE, $1D, $62, $01 ; ext command 1D: load classy message 0162

;===================================================================================================

Message_00_03_34:
#_0892FC: db $FE, $1D, $63, $01 ; ext command 1D: load classy message 0163

;===================================================================================================

Message_00_03_35:
#_089300: db $FE, $1D, $64, $01 ; ext command 1D: load classy message 0164

;===================================================================================================

Message_00_03_36:
#_089304: db $FE, $1D, $65, $01 ; ext command 1D: load classy message 0165

;===================================================================================================

Message_00_03_37:
#_089308: db $FE, $1D, $66, $01 ; ext command 1D: load classy message 0166

;===================================================================================================

Message_00_03_38:
#_08930C: db $FE, $1D, $67, $01 ; ext command 1D: load classy message 0167

;===================================================================================================

Message_00_03_39:
#_089310: db $FE, $1D, $6A, $01 ; ext command 1D: load classy message 016A

;===================================================================================================

Message_00_03_3C:
#_089314: db $FE, $1D, $17, $01 ; ext command 1D: load classy message 0117

;===================================================================================================

Message_00_03_3D:
#_089318: db $FE, $1D, $18, $01 ; ext command 1D: load classy message 0118

;===================================================================================================

Message_00_03_3E:
#_08931C: db $FE, $1D, $19, $01 ; ext command 1D: load classy message 0119

;===================================================================================================

Message_00_03_3F:
#_089320: db $FE, $1D, $1A, $01 ; ext command 1D: load classy message 011A

;===================================================================================================

Message_00_03_40:
#_089324: db $FE, $1D, $1B, $01 ; ext command 1D: load classy message 011B

;===================================================================================================

Message_00_03_41:
#_089328: db $FE, $1D, $1C, $01 ; ext command 1D: load classy message 011C

;===================================================================================================

Message_00_03_42:
#_08932C: db $FE, $1D, $1D, $01 ; ext command 1D: load classy message 011D

;===================================================================================================

Message_00_03_43:
#_089330: db $FE, $1D, $1E, $01 ; ext command 1D: load classy message 011E

;===================================================================================================

Message_00_03_44:
#_089334: db $FE, $1D, $1F, $01 ; ext command 1D: load classy message 011F

;===================================================================================================

Message_00_03_45:
#_089338: db $FE, $1D, $20, $01 ; ext command 1D: load classy message 0120

;===================================================================================================

Message_00_03_46:
#_08933C: db $FE, $1D, $21, $01 ; ext command 1D: load classy message 0121

;===================================================================================================

Message_00_03_47:
#_089340: db $FE, $1D, $22, $01 ; ext command 1D: load classy message 0122
#_089344: db $FF ; end of message

;===================================================================================================

Message_00_03_48:
#_089345: db $FE, $1D, $23, $01 ; ext command 1D: load classy message 0123

;===================================================================================================

Message_00_03_49:
#_089349: db $FE, $1D, $24, $01 ; ext command 1D: load classy message 0124

;===================================================================================================

Message_00_03_4A:
#_08934D: db $FE, $1D, $25, $01 ; ext command 1D: load classy message 0125

;===================================================================================================

Message_00_03_4B:
#_089351: db $FE, $1D, $26, $01 ; ext command 1D: load classy message 0126

;===================================================================================================

Message_00_03_4C:
#_089355: db $FE, $1D, $27, $01 ; ext command 1D: load classy message 0127

;===================================================================================================

Message_00_03_4D:
#_089359: db $FE, $1D, $28, $01 ; ext command 1D: load classy message 0128

;===================================================================================================

Message_00_03_4E:
#_08935D: db $FE, $1D, $29, $01 ; ext command 1D: load classy message 0129

;===================================================================================================

Message_00_03_4F:
#_089361: db $FE, $1D, $2A, $01 ; ext command 1D: load classy message 012A

;===================================================================================================

Message_00_03_50:
#_089365: db $FE, $1D, $2B, $01 ; ext command 1D: load classy message 012B

;===================================================================================================

Message_00_03_51:
#_089369: db $FE, $1D, $2C, $01 ; ext command 1D: load classy message 012C

;===================================================================================================

Message_00_03_52:
#_08936D: db $FE, $1D, $2D, $01 ; ext command 1D: load classy message 012D

;===================================================================================================

Message_00_03_53:
#_089371: db $FE, $1D, $2E, $01 ; ext command 1D: load classy message 012E
#_089375: db $FF ; end of message

;===================================================================================================

Message_00_03_54:
#_089376: db $FE, $1D, $2F, $01 ; ext command 1D: load classy message 012F

;===================================================================================================

Message_00_03_55:
#_08937A: db $FE, $1D, $30, $01 ; ext command 1D: load classy message 0130

;===================================================================================================

Message_00_03_56:
#_08937E: db $FE, $1D, $31, $01 ; ext command 1D: load classy message 0131

;===================================================================================================

Message_00_03_57:
#_089382: db $FE, $1D, $32, $01 ; ext command 1D: load classy message 0132

;===================================================================================================

Message_00_03_58:
#_089386: db $FE, $1D, $33, $01 ; ext command 1D: load classy message 0133

;===================================================================================================

Message_00_03_59:
#_08938A: db $FE, $1D, $34, $01 ; ext command 1D: load classy message 0134

;===================================================================================================

Message_00_03_5A:
#_08938E: db $FE, $1D, $35, $01 ; ext command 1D: load classy message 0135

;===================================================================================================

Message_00_03_5B:
#_089392: db $FE, $1D, $36, $01 ; ext command 1D: load classy message 0136

;===================================================================================================

Message_00_03_5C:
#_089396: db $FE, $1D, $37, $01 ; ext command 1D: load classy message 0137

;===================================================================================================

Message_00_03_5D:
#_08939A: db $FE, $1D, $3A, $01 ; ext command 1D: load classy message 013A

;===================================================================================================

Message_00_03_60:
#_08939E: db $FE, $1D, $17, $01 ; ext command 1D: load classy message 0117

;===================================================================================================

Message_00_03_61:
#_0893A2: db $FE, $1D, $18, $01 ; ext command 1D: load classy message 0118

;===================================================================================================

Message_00_03_62:
#_0893A6: db $FE, $1D, $19, $01 ; ext command 1D: load classy message 0119

;===================================================================================================

Message_00_03_63:
#_0893AA: db $FE, $1D, $1A, $01 ; ext command 1D: load classy message 011A

;===================================================================================================

Message_00_03_64:
#_0893AE: db $FE, $1D, $1B, $01 ; ext command 1D: load classy message 011B

;===================================================================================================

Message_00_03_65:
#_0893B2: db $FE, $1D, $1C, $01 ; ext command 1D: load classy message 011C

;===================================================================================================

Message_00_03_66:
#_0893B6: db $FE, $1D, $1D, $01 ; ext command 1D: load classy message 011D

;===================================================================================================

Message_00_03_67:
#_0893BA: db $FE, $1D, $1E, $01 ; ext command 1D: load classy message 011E

;===================================================================================================

Message_00_03_68:
#_0893BE: db $FE, $1D, $1F, $01 ; ext command 1D: load classy message 011F

;===================================================================================================

Message_00_03_69:
#_0893C2: db $FE, $1D, $20, $01 ; ext command 1D: load classy message 0120

;===================================================================================================

Message_00_03_6A:
#_0893C6: db $FE, $1D, $21, $01 ; ext command 1D: load classy message 0121

;===================================================================================================

Message_00_03_6B:
#_0893CA: db $FE, $1D, $22, $01 ; ext command 1D: load classy message 0122
#_0893CE: db $FF ; end of message

;===================================================================================================

Message_00_03_6C:
#_0893CF: db $FE, $1D, $47, $01 ; ext command 1D: load classy message 0147

;===================================================================================================

Message_00_03_6D:
#_0893D3: db $FE, $1D, $48, $01 ; ext command 1D: load classy message 0148

;===================================================================================================

Message_00_03_6E:
#_0893D7: db $FE, $1D, $49, $01 ; ext command 1D: load classy message 0149

;===================================================================================================

Message_00_03_6F:
#_0893DB: db $FE, $1D, $4A, $01 ; ext command 1D: load classy message 014A

;===================================================================================================

Message_00_03_70:
#_0893DF: db $FE, $1D, $4B, $01 ; ext command 1D: load classy message 014B

;===================================================================================================

Message_00_03_71:
#_0893E3: db $FE, $1D, $4C, $01 ; ext command 1D: load classy message 014C

;===================================================================================================

Message_00_03_72:
#_0893E7: db $FE, $1D, $4D, $01 ; ext command 1D: load classy message 014D

;===================================================================================================

Message_00_03_73:
#_0893EB: db $FE, $1D, $4E, $01 ; ext command 1D: load classy message 014E

;===================================================================================================

Message_00_03_74:
#_0893EF: db $FE, $1D, $4F, $01 ; ext command 1D: load classy message 014F

;===================================================================================================

Message_00_03_75:
#_0893F3: db $FE, $1D, $50, $01 ; ext command 1D: load classy message 0150

;===================================================================================================

Message_00_03_76:
#_0893F7: db $FE, $1D, $51, $01 ; ext command 1D: load classy message 0151

;===================================================================================================

Message_00_03_77:
#_0893FB: db $FE, $1D, $52, $01 ; ext command 1D: load classy message 0152
#_0893FF: db $FF ; end of message

;===================================================================================================

Message_00_03_78:
#_089400: db $FE, $1D, $47, $01 ; ext command 1D: load classy message 0147

;===================================================================================================

Message_00_03_79:
#_089404: db $FE, $1D, $48, $01 ; ext command 1D: load classy message 0148

;===================================================================================================

Message_00_03_7A:
#_089408: db $FE, $1D, $49, $01 ; ext command 1D: load classy message 0149

;===================================================================================================

Message_00_03_7B:
#_08940C: db $FE, $1D, $4A, $01 ; ext command 1D: load classy message 014A

;===================================================================================================

Message_00_03_7C:
#_089410: db $FE, $1D, $4B, $01 ; ext command 1D: load classy message 014B

;===================================================================================================

Message_00_03_7D:
#_089414: db $FE, $1D, $4C, $01 ; ext command 1D: load classy message 014C

;===================================================================================================

Message_00_03_7E:
#_089418: db $FE, $1D, $4D, $01 ; ext command 1D: load classy message 014D

;===================================================================================================

Message_00_03_7F:
#_08941C: db $FE, $1D, $4E, $01 ; ext command 1D: load classy message 014E

;===================================================================================================

Message_00_03_80:
#_089420: db $FE, $1D, $4F, $01 ; ext command 1D: load classy message 014F

;===================================================================================================

Message_00_03_81:
#_089424: db $FE, $1D, $50, $01 ; ext command 1D: load classy message 0150

;===================================================================================================

Message_00_03_82:
#_089428: db $FE, $1D, $51, $01 ; ext command 1D: load classy message 0151

;===================================================================================================

Message_00_03_83:
#_08942C: db $FE, $1D, $52, $01 ; ext command 1D: load classy message 0152

;===================================================================================================

Message_00_03_84:
#_089430: db $FE, $1D, $23, $01 ; ext command 1D: load classy message 0123

;===================================================================================================

Message_00_03_85:
#_089434: db $FE, $1D, $24, $01 ; ext command 1D: load classy message 0124

;===================================================================================================

Message_00_03_86:
#_089438: db $FE, $1D, $25, $01 ; ext command 1D: load classy message 0125

;===================================================================================================

Message_00_03_87:
#_08943C: db $FE, $1D, $26, $01 ; ext command 1D: load classy message 0126

;===================================================================================================

Message_00_03_88:
#_089440: db $FE, $1D, $27, $01 ; ext command 1D: load classy message 0127

;===================================================================================================

Message_00_03_89:
#_089444: db $FE, $1D, $28, $01 ; ext command 1D: load classy message 0128

;===================================================================================================

Message_00_03_8A:
#_089448: db $FE, $1D, $29, $01 ; ext command 1D: load classy message 0129

;===================================================================================================

Message_00_03_8B:
#_08944C: db $FE, $1D, $2A, $01 ; ext command 1D: load classy message 012A

;===================================================================================================

Message_00_03_8C:
#_089450: db $FE, $1D, $2B, $01 ; ext command 1D: load classy message 012B

;===================================================================================================

Message_00_03_8D:
#_089454: db $FE, $1D, $2C, $01 ; ext command 1D: load classy message 012C

;===================================================================================================

Message_00_03_8E:
#_089458: db $FE, $1D, $2D, $01 ; ext command 1D: load classy message 012D

;===================================================================================================

Message_00_03_8F:
#_08945C: db $FE, $1D, $2E, $01 ; ext command 1D: load classy message 012E

;===================================================================================================

Message_00_03_90:
#_089460: db $FE, $1D, $23, $01 ; ext command 1D: load classy message 0123

;===================================================================================================

Message_00_03_91:
#_089464: db $FE, $1D, $24, $01 ; ext command 1D: load classy message 0124

;===================================================================================================

Message_00_03_92:
#_089468: db $FE, $1D, $25, $01 ; ext command 1D: load classy message 0125

;===================================================================================================

Message_00_03_93:
#_08946C: db $FE, $1D, $26, $01 ; ext command 1D: load classy message 0126

;===================================================================================================

Message_00_03_94:
#_089470: db $FE, $1D, $27, $01 ; ext command 1D: load classy message 0127

;===================================================================================================

Message_00_03_95:
#_089474: db $FE, $1D, $28, $01 ; ext command 1D: load classy message 0128

;===================================================================================================

Message_00_03_96:
#_089478: db $FE, $1D, $29, $01 ; ext command 1D: load classy message 0129

;===================================================================================================

Message_00_03_97:
#_08947C: db $FE, $1D, $2A, $01 ; ext command 1D: load classy message 012A

;===================================================================================================

Message_00_03_98:
#_089480: db $FE, $1D, $2B, $01 ; ext command 1D: load classy message 012B

;===================================================================================================

Message_00_03_99:
#_089484: db $FE, $1D, $2C, $01 ; ext command 1D: load classy message 012C

;===================================================================================================

Message_00_03_9A:
#_089488: db $FE, $1D, $2D, $01 ; ext command 1D: load classy message 012D

;===================================================================================================

Message_00_03_9B:
#_08948C: db $FE, $1D, $2E, $01 ; ext command 1D: load classy message 012E

;===================================================================================================

Message_00_03_9C:
#_089490: db $FE, $1D, $2F, $01 ; ext command 1D: load classy message 012F

;===================================================================================================

Message_00_03_9D:
#_089494: db $FE, $1D, $30, $01 ; ext command 1D: load classy message 0130

;===================================================================================================

Message_00_03_9E:
#_089498: db $FE, $1D, $31, $01 ; ext command 1D: load classy message 0131

;===================================================================================================

Message_00_03_9F:
#_08949C: db $FE, $1D, $32, $01 ; ext command 1D: load classy message 0132

;===================================================================================================

Message_00_03_A0:
#_0894A0: db $FE, $1D, $33, $01 ; ext command 1D: load classy message 0133

;===================================================================================================

Message_00_03_A1:
#_0894A4: db $FE, $1D, $34, $01 ; ext command 1D: load classy message 0134

;===================================================================================================

Message_00_03_A2:
#_0894A8: db $FE, $1D, $35, $01 ; ext command 1D: load classy message 0135

;===================================================================================================

Message_00_03_A3:
#_0894AC: db $FE, $1D, $36, $01 ; ext command 1D: load classy message 0136

;===================================================================================================

Message_00_03_A4:
#_0894B0: db $FE, $1D, $37, $01 ; ext command 1D: load classy message 0137

;===================================================================================================

Message_00_03_A5:
#_0894B4: db $FE, $1D, $3A, $01 ; ext command 1D: load classy message 013A

;===================================================================================================

Message_00_03_A8:
#_0894B8: db $FE, $1D, $5F, $01 ; ext command 1D: load classy message 015F

;===================================================================================================

Message_00_03_A9:
#_0894BC: db $FE, $1D, $60, $01 ; ext command 1D: load classy message 0160

;===================================================================================================

Message_00_03_AA:
#_0894C0: db $FE, $1D, $61, $01 ; ext command 1D: load classy message 0161

;===================================================================================================

Message_00_03_AB:
#_0894C4: db $FE, $1D, $62, $01 ; ext command 1D: load classy message 0162

;===================================================================================================

Message_00_03_AC:
#_0894C8: db $FE, $1D, $63, $01 ; ext command 1D: load classy message 0163

;===================================================================================================

Message_00_03_AD:
#_0894CC: db $FE, $1D, $64, $01 ; ext command 1D: load classy message 0164

;===================================================================================================

Message_00_03_AE:
#_0894D0: db $FE, $1D, $65, $01 ; ext command 1D: load classy message 0165

;===================================================================================================

Message_00_03_AF:
#_0894D4: db $FE, $1D, $66, $01 ; ext command 1D: load classy message 0166

;===================================================================================================

Message_00_03_B0:
#_0894D8: db $FE, $1D, $67, $01 ; ext command 1D: load classy message 0167

;===================================================================================================

Message_00_03_B1:
#_0894DC: db $FE, $1D, $6A, $01 ; ext command 1D: load classy message 016A

;===================================================================================================

Message_00_03_B4:
#_0894E0: db $FE, $1D, $E7, $00 ; ext command 1D: load classy message 00E7

;===================================================================================================

Message_00_03_B5:
#_0894E4: db $FE, $1D, $E8, $00 ; ext command 1D: load classy message 00E8

;===================================================================================================

Message_00_03_B6:
#_0894E8: db $FE, $1D, $E9, $00 ; ext command 1D: load classy message 00E9

;===================================================================================================

; [ITEM]か ℏ[LONG]を
; さしだされよ
Message_00_03_B7:
#_0894EC: db $F3 ; write item name from $0A50
#_0894ED: db $2A, $CF, $5C ; か⎵ℏ
#_0894F0: db $FB ; write 32-bit integer from $0A54
#_0894F1: db $51 ; を
#_0894F2: db $F9 ; new line
#_0894F3: db $2F, $30, $A6, $2F, $4E, $4A ; さしだされよ
#_0894F9: db $FF ; end of message

;===================================================================================================

Message_00_03_B8:
#_0894FA: db $FE, $1D, $EB, $00 ; ext command 1D: load classy message 00EB

;===================================================================================================

Message_00_03_B9:
#_0894FE: db $FE, $1D, $EC, $00 ; ext command 1D: load classy message 00EC

;===================================================================================================

Message_00_03_BA:
#_089502: db $FE, $1D, $F2, $00 ; ext command 1D: load classy message 00F2

;===================================================================================================

Message_00_03_C0:
#_089506: db $FE, $1D, $FF, $00 ; ext command 1D: load classy message 00FF

;===================================================================================================

Message_00_03_C1:
#_08950A: db $FE, $1D, $00, $01 ; ext command 1D: load classy message 0100

;===================================================================================================

Message_00_03_C2:
#_08950E: db $FE, $1D, $01, $01 ; ext command 1D: load classy message 0101

;===================================================================================================

; [ITEM] か ℏ[LONG]
; よこせば わけてやろう
Message_00_03_C3:
#_089512: db $F3 ; write item name from $0A50
#_089513: db $CF, $2A, $CF, $5C ; ⎵か⎵ℏ
#_089517: db $FB ; write 32-bit integer from $0A54
#_089518: db $F9 ; new line
#_089519: db $4A, $2E, $32, $AB, $CF, $50, $2D, $37 ; よこせば⎵わけて
#_089521: db $48, $4F, $27 ; やろう
#_089524: db $F9 ; new line
#_089525: db $FF ; end of message

;===================================================================================================

; Separate, unused message?
Message_089526:
#_089526: db $FE, $1D, $02, $01 ; ext command 1D: load classy message 0102

;===================================================================================================

Message_00_03_C4:
#_08952A: db $FE, $1D, $03, $01 ; ext command 1D: load classy message 0103

;===================================================================================================

Message_00_03_C5:
#_08952E: db $FE, $1D, $04, $01 ; ext command 1D: load classy message 0104

;===================================================================================================

Message_00_03_C6:
#_089532: db $FE, $1D, $0A, $01 ; ext command 1D: load classy message 010A

;===================================================================================================

Message_00_03_CC:
#_089536: db $FE, $1D, $0B, $01 ; ext command 1D: load classy message 010B

;===================================================================================================

Message_00_03_CD:
#_08953A: db $FE, $1D, $0C, $01 ; ext command 1D: load classy message 010C

;===================================================================================================

Message_00_03_CE:
#_08953E: db $FE, $1D, $0D, $01 ; ext command 1D: load classy message 010D

;===================================================================================================

; [ITEM] ならば ℏ[LONG] の
; きふを おねがいする
Message_00_03_CF:
#_089542: db $F3 ; write item name from $0A50
#_089543: db $CF, $39, $4B, $AB, $CF, $5C ; ⎵ならば⎵ℏ
#_089549: db $FB ; write 32-bit integer from $0A54
#_08954A: db $CF, $3D ; ⎵の
#_08954C: db $F9 ; new line
#_08954D: db $2B, $40, $51, $CF, $29, $3C, $9C, $26 ; きふを⎵おねがい
#_089555: db $31, $4D ; する
#_089557: db $F9 ; new line
#_089558: db $FF ; end of message

;===================================================================================================

Message_00_03_D0:
#_089559: db $FE, $1D, $0F, $01 ; ext command 1D: load classy message 010F

;===================================================================================================

Message_00_03_D1:
#_08955D: db $FE, $1D, $10, $01 ; ext command 1D: load classy message 0110

;===================================================================================================

Message_00_03_D2:
#_089561: db $FE, $1D, $16, $01 ; ext command 1D: load classy message 0116

;===================================================================================================

Message_00_03_D8:
#_089565: db $FE, $1D, $E7, $00 ; ext command 1D: load classy message 00E7

;===================================================================================================

Message_00_03_D9:
#_089569: db $FE, $1D, $E8, $00 ; ext command 1D: load classy message 00E8

;===================================================================================================

Message_00_03_DA:
#_08956D: db $FE, $1D, $E9, $00 ; ext command 1D: load classy message 00E9

;===================================================================================================

; [ITEM]か ℏ[LONG]を
; さしだされよ
Message_00_03_DB:
#_089571: db $F3 ; write item name from $0A50
#_089572: db $2A, $CF, $5C ; か⎵ℏ
#_089575: db $FB ; write 32-bit integer from $0A54
#_089576: db $51 ; を
#_089577: db $F9 ; new line
#_089578: db $2F, $30, $A6, $2F, $4E, $4A ; さしだされよ
#_08957E: db $FF ; end of message

;===================================================================================================

Message_00_03_DC:
#_08957F: db $FE, $1D, $EB, $00 ; ext command 1D: load classy message 00EB

;===================================================================================================

Message_00_03_DD:
#_089583: db $FE, $1D, $EC, $00 ; ext command 1D: load classy message 00EC

;===================================================================================================

Message_00_03_DE:
#_089587: db $FE, $1D, $F2, $00 ; ext command 1D: load classy message 00F2

;===================================================================================================

Message_00_04_00:
#_08958B: db $FA ; clear message box
#_08958C: db $FE, $4A, $00 ; ext command 4A: 00 TODO
#_08958F: db $FC ; wait for key and new line
#_089590: db $FA ; clear message box

;===================================================================================================

Message_00_04_01:
#_089591: db $FE, $4A, $01 ; ext command 4A: 01 TODO
#_089594: db $FE, $4B, $03 ; ext command 4B: 03 TODO
#_089597: db $FA ; clear message box
#_089598: db $FE, $4C, $02 ; ext command 4C: 02 TODO
#_08959B: db $FE, $4A, $02 ; ext command 4A: 02 TODO
#_08959E: db $FC ; wait for key and new line
#_08959F: db $D3, $03 ; go to message 03

;===================================================================================================

Message_00_04_02:
#_0895A1: db $FE, $4A, $03 ; ext command 4A: 03 TODO
#_0895A4: db $FC ; wait for key and new line

;===================================================================================================

Message_00_04_03:
#_0895A5: db $FE, $4E, $04 ; ext command 4E: conditionally go to message 04 TODO
#_0895A8: db $FA ; clear message box
#_0895A9: db $FE, $4A, $04 ; ext command 4A: 04 TODO
#_0895AC: db $D3, $01 ; go to message 01

;===================================================================================================

Message_00_04_04:
#_0895AE: db $FA ; clear message box
#_0895AF: db $FE, $4A, $05 ; ext command 4A: 05 TODO
#_0895B2: db $F8, $06 ; YES/NO - go to message 06 if YES

;===================================================================================================

Message_00_04_05:
#_0895B4: db $FA ; clear message box
#_0895B5: db $FE, $4A, $07 ; ext command 4A: 07 TODO
#_0895B8: db $FC ; wait for key and new line
#_0895B9: db $FF ; end of message

;===================================================================================================

Message_00_04_06:
#_0895BA: db $FE, $4A, $06 ; ext command 4A: 06 TODO
#_0895BD: db $FC ; wait for key and new line
#_0895BE: db $D3, $05 ; go to message 05

;===================================================================================================

; マスター:
; «いらっしゃいませ»
; «・・・»なんだ [CHASE]くんか
Message_00_05_00:
#_0895C0: db $7B, $69, $6C, $5A, $9A ; マスター:
#_0895C5: db $F9 ; new line
#_0895C6: db $F2, $32 ; prewritten text 32
#_0895C8: db $F9 ; new line
#_0895C9: db $F2, $0B ; prewritten text 0B
#_0895CB: db $39, $52, $A6, $CF ; なんだ⎵
#_0895CF: db $F0 ; write player name
#_0895D0: db $2C, $52, $2A ; くんか
#_0895D3: db $FF ; end of message

;===================================================================================================

; なにか のんでくかい?
Message_00_05_01:
#_0895D4: db $39, $3A, $2A, $CF, $3D, $52, $A9, $2C ; なにか⎵のんでく
#_0895DC: db $2A, $26, $95 ; かい?
#_0895DF: db $FF ; end of message

;===================================================================================================

; >[NAME2]は
; [DRINK]を のんだ
Message_00_05_02:
#_0895E0: db $97 ; >
#_0895E1: db $EC ; write someone's name
#_0895E2: db $3E ; は
#_0895E3: db $F9 ; new line
#_0895E4: db $FE, $4D ; ext command 4D: Load drink name from $0C42
#_0895E6: db $51, $CF, $3D, $52, $A6 ; を⎵のんだ
#_0895EB: db $FF ; end of message

;===================================================================================================

; きょうは おごりじゃないよ
; おだいは ちゃーんと いただくよ
Message_00_05_03:
#_0895EC: db $2B, $57, $27, $3E, $CF, $29, $A0, $4C ; きょうは⎵おごり
#_0895F4: db $A2, $55, $39, $26, $4A ; じゃないよ
#_0895F9: db $F9 ; new line
#_0895FA: db $29, $A6, $26, $3E, $CF, $35, $55, $5A ; おだいは⎵ちゃー
#_089602: db $52, $38, $CF, $26, $34, $A6, $2C, $4A ; んと⎵いただくよ
#_08960A: db $FF ; end of message

;===================================================================================================

; おつれさんは 
Message_00_05_04:
#_08960B: db $29, $36, $4E, $2F, $52, $3E, $CF ; おつれさんは⎵
#_089612: db $FF ; end of message

;===================================================================================================

; >マスター«と はなしますか?»
Message_00_05_05:
#_089613: db $97, $7B, $69, $6C, $5A ; >マスター
#_089618: db $F2, $12 ; prewritten text 12
#_08961A: db $FF ; end of message

;===================================================================================================

; マスター:
; ゆうべの パトカーの サイレン すごかったね
; えっ しらなかったのかい?
Message_00_05_06:
#_08961B: db $7B, $69, $6C, $5A, $9A ; マスター:
#_089620: db $F9 ; new line
#_089621: db $D2, $06, $51 ; test progress bit 06 for message 51
#_089624: db $D2, $05, $50 ; test progress bit 05 for message 50
#_089627: db $49, $27, $AE, $3D, $CF, $C9, $70, $62 ; ゆうべの⎵パトカ
#_08962F: db $5A, $3D, $CF, $67, $5E, $86, $8A, $CF ; ーの⎵サイレン⎵
#_089637: db $31, $A0, $2A, $58, $34, $3C ; すごかったね
#_08963D: db $F9 ; new line
#_08963E: db $28, $58, $CF, $30, $4B, $39, $2A, $58 ; えっ⎵しらなかっ
#_089646: db $34, $3D, $2A, $26, $95 ; たのかい?
#_08964B: db $FF ; end of message

;===================================================================================================

; また こいよな
Message_00_05_07:
#_08964C: db $43, $34, $CF, $2E, $26, $4A, $39 ; また⎵こいよな
#_089653: db $FF ; end of message

;===================================================================================================

; バーテン:
; «いらっしゃいませ»
Message_00_05_08:
#_089654: db $C4, $5A, $6F, $8A, $9A ; バーテン:
#_089659: db $F9 ; new line
#_08965A: db $F2, $32 ; prewritten text 32
#_08965C: db $FF ; end of message

;===================================================================================================

; «なにに いたしましょう»
Message_00_05_09:
#_08965D: db $F2, $5F ; prewritten text 5F
#_08965F: db $FF ; end of message

;===================================================================================================

Message_00_05_0A:
#_089660: db $D3, $02 ; go to message 02

;===================================================================================================

; «すみませんが おかねが たりません»
Message_00_05_0B:
#_089662: db $F2, $60 ; prewritten text 60
#_089664: db $FF ; end of message

;===================================================================================================

; «おつれさまは »
Message_00_05_0C:
#_089665: db $F2, $61 ; prewritten text 61
#_089667: db $FF ; end of message

;===================================================================================================

; >バーテン«と はなしますか?»
Message_00_05_0D:
#_089668: db $97, $C4, $5A, $6F, $8A ; >バーテン
#_08966D: db $F2, $12 ; prewritten text 12
#_08966F: db $FF ; end of message

;===================================================================================================

; バーテン:
; ゴトウ«しれいかん»の じゃまを するのは
; «アメリカ»ぐんだけじゃないよ
; [MOMO]って おんなが ひきいてる
; グループが そうだ
; «レジスタンス»を なのってるよ
Message_00_05_0E:
#_089670: db $C4, $5A, $6F, $8A, $9A ; バーテン:
#_089675: db $F9 ; new line
#_089676: db $B9, $70, $5F ; ゴトウ
#_089679: db $F2, $20 ; prewritten text 20
#_08967B: db $3D, $CF, $A2, $55, $43, $51, $CF, $31 ; の⎵じゃまを⎵す
#_089683: db $4D, $3D, $3E ; るのは
#_089686: db $F9 ; new line
#_089687: db $F2, $1B ; prewritten text 1B
#_089689: db $9E, $52, $A6, $2D, $A2, $55, $39, $26 ; ぐんだけじゃない
#_089691: db $4A ; よ
#_089692: db $F9 ; new line
#_089693: db $ED ; write female protag name
#_089694: db $58, $37, $CF, $29, $52, $39, $9C, $CF ; って⎵おんなが⎵
#_08969C: db $3F, $2B, $26, $37, $4D ; ひきいてる
#_0896A1: db $F9 ; new line
#_0896A2: db $B7, $85, $5A, $CB, $9C, $CF, $33, $27 ; グループが⎵そう
#_0896AA: db $A6 ; だ
#_0896AB: db $F9 ; new line
#_0896AC: db $F2, $15 ; prewritten text 15
#_0896AE: db $51, $CF, $39, $3D, $58, $37, $4D, $4A ; を⎵なのってるよ
#_0896B6: db $FF ; end of message

;===================================================================================================

; «ありがとうございました»
Message_00_05_0F:
#_0896B7: db $F2, $31 ; prewritten text 31
#_0896B9: db $FF ; end of message

;===================================================================================================

; バーテン:
; «いらっしゃいませ»
Message_00_05_10:
#_0896BA: db $C4, $5A, $6F, $8A, $9A ; バーテン:
#_0896BF: db $F9 ; new line
#_0896C0: db $F2, $32 ; prewritten text 32
#_0896C2: db $FF ; end of message

;===================================================================================================

; «なにに いたしましょう»
Message_00_05_11:
#_0896C3: db $F2, $5F ; prewritten text 5F
#_0896C5: db $FF ; end of message

;===================================================================================================

Message_00_05_12:
#_0896C6: db $D3, $02 ; go to message 02

;===================================================================================================

; «すみませんが おかねが たりません»
Message_00_05_13:
#_0896C8: db $F2, $60 ; prewritten text 60
#_0896CA: db $FF ; end of message

;===================================================================================================

; «おつれさまは »
Message_00_05_14:
#_0896CB: db $F2, $61 ; prewritten text 61
#_0896CD: db $FF ; end of message

;===================================================================================================

; >バーテン«と はなしますか?»
Message_00_05_15:
#_0896CE: db $97, $C4, $5A, $6F, $8A ; >バーテン
#_0896D3: db $F2, $12 ; prewritten text 12
#_0896D5: db $FF ; end of message

;===================================================================================================

; バーテン:
; «レジスタンス»と なのる ひとたちが
; «アメリカ»ぐんの じゃまを しているんです
; ゴトウの ぶかとも おもえないし«・・・»
Message_00_05_16:
#_0896D6: db $C4, $5A, $6F, $8A, $9A ; バーテン:
#_0896DB: db $F9 ; new line
#_0896DC: db $F2, $15 ; prewritten text 15
#_0896DE: db $38, $CF, $39, $3D, $4D, $CF, $3F, $38 ; と⎵なのる⎵ひと
#_0896E6: db $34, $35, $9C ; たちが
#_0896E9: db $F9 ; new line
#_0896EA: db $F2, $1B ; prewritten text 1B
#_0896EC: db $9E, $52, $3D, $CF, $A2, $55, $43, $51 ; ぐんの⎵じゃまを
#_0896F4: db $CF, $30, $37, $26, $4D, $52, $A9, $31 ; ⎵しているんです
#_0896FC: db $F9 ; new line
#_0896FD: db $B9, $70, $5F, $3D, $CF, $AD, $2A, $38 ; ゴトウの⎵ぶかと
#_089705: db $47, $CF, $29, $47, $28, $39, $26, $30 ; も⎵おもえないし
#_08970D: db $F2, $0B ; prewritten text 0B
#_08970F: db $FF ; end of message

;===================================================================================================

; «ありがとうございました»
Message_00_05_17:
#_089710: db $F2, $31 ; prewritten text 31
#_089712: db $FF ; end of message

;===================================================================================================

; バーテン:
; なにか ようか?
Message_00_05_18:
#_089713: db $C4, $5A, $6F, $8A, $9A ; バーテン:
#_089718: db $F9 ; new line
#_089719: db $39, $3A, $2A, $CF, $4A, $27, $2A, $95 ; なにか⎵ようか?
#_089721: db $FF ; end of message

;===================================================================================================

; なにか のむのか?
Message_00_05_19:
#_089722: db $39, $3A, $2A, $CF, $3D, $45, $3D, $2A ; なにか⎵のむのか
#_08972A: db $95 ; ?
#_08972B: db $FF ; end of message

;===================================================================================================

; ガキのくせに サケなんか のみやがって
Message_00_05_1A:
#_08972C: db $B5, $63, $3D, $2C, $32, $3A, $CF, $67 ; ガキのくせに⎵サ
#_089734: db $65, $39, $52, $2A, $CF, $3D, $44, $48 ; ケなんか⎵のみや
#_08973C: db $9C, $58, $37 ; がって
#_08973F: db $FF ; end of message

;===================================================================================================

; かねが ねえぞ
Message_00_05_1B:
#_089740: db $2A, $3C, $9C, $CF, $3C, $28, $A5 ; かねが⎵ねえぞ
#_089747: db $FF ; end of message

;===================================================================================================

; おまえの つれは 
Message_00_05_1C:
#_089748: db $29, $43, $28, $3D, $CF, $36, $4E, $3E ; おまえの⎵つれは
#_089750: db $CF ; ⎵
#_089751: db $FF ; end of message

;===================================================================================================

; >バーテン«と はなしますか?»
Message_00_05_1D:
#_089752: db $97, $C4, $5A, $6F, $8A ; >バーテン
#_089757: db $F2, $12 ; prewritten text 12
#_089759: db $FF ; end of message

;===================================================================================================

; バーテン:
Message_00_05_1E:
#_08975A: db $C4, $5A, $6F, $8A, $9A ; バーテン:
#_08975F: db $F9 ; new line
#_089760: db $D2, $28, $57 ; test progress bit 28 for message 57
#_089763: db $D2, $20, $59 ; test progress bit 20 for message 59
#_089766: db $DD, $F3, $52 ; go to message 52 if missing item F3
#_089769: db $D3, $59 ; go to message 59

;===================================================================================================

; とっとと かえんな
Message_00_05_1F:
#_08976B: db $D2, $20, $5A ; test progress bit 20 for message 5A
#_08976E: db $38, $58, $38, $38, $CF, $2A, $28, $52 ; とっとと⎵かえん
#_089776: db $39 ; な
#_089777: db $FF ; end of message

;===================================================================================================

; バーテン:
; «いらっしゃいませ»
Message_00_05_20:
#_089778: db $C4, $5A, $6F, $8A, $9A ; バーテン:
#_08977D: db $F9 ; new line
#_08977E: db $F2, $32 ; prewritten text 32
#_089780: db $FF ; end of message

;===================================================================================================

; «なにに いたしましょう»
Message_00_05_21:
#_089781: db $F2, $5F ; prewritten text 5F
#_089783: db $FF ; end of message

;===================================================================================================

Message_00_05_22:
#_089784: db $D3, $02 ; go to message 02

;===================================================================================================

; «すみませんが おかねが たりません»
Message_00_05_23:
#_089786: db $F2, $60 ; prewritten text 60
#_089788: db $FF ; end of message
#_089789: db $FF ; end of message

;===================================================================================================

; «おつれさまは »
Message_00_05_24:
#_08978A: db $F2, $61 ; prewritten text 61
#_08978C: db $FF ; end of message

;===================================================================================================

; >バーテン«と はなしますか?»
Message_00_05_25:
#_08978D: db $97, $C4, $5A, $6F, $8A ; >バーテン
#_089792: db $F2, $12 ; prewritten text 12
#_089794: db $FF ; end of message

;===================================================================================================

; バーテン:
; ゴトウだか «アメリカ»たいしだか しらんが
; オレたちの «シンジュク»で かってなマネ
; するなってーの
Message_00_05_26:
#_089795: db $C4, $5A, $6F, $8A, $9A ; バーテン:
#_08979A: db $F9 ; new line
#_08979B: db $D2, $2F, $5B ; test progress bit 2F for message 5B
#_08979E: db $B9, $70, $5F, $A6, $2A, $CF ; ゴトウだか⎵
#_0897A4: db $F2, $1B ; prewritten text 1B
#_0897A6: db $34, $26, $30, $A6, $2A, $CF, $30, $4B ; たいしだか⎵しら
#_0897AE: db $52, $9C ; んが
#_0897B0: db $F9 ; new line
#_0897B1: db $61, $86, $34, $35, $3D, $CF ; オレたちの⎵
#_0897B7: db $F2, $18 ; prewritten text 18
#_0897B9: db $A9, $CF, $2A, $58, $37, $39, $7B, $74 ; で⎵かってなマネ
#_0897C1: db $F9 ; new line
#_0897C2: db $31, $4D, $39, $58, $37, $5A, $3D ; するなってーの
#_0897C9: db $FF ; end of message

;===================================================================================================

; どーも
Message_00_05_27:
#_0897CA: db $AA, $5A, $47 ; どーも
#_0897CD: db $FF ; end of message

;===================================================================================================

; バーテン:
; いらっしゃい
Message_00_05_28:
#_0897CE: db $C4, $5A, $6F, $8A, $9A ; バーテン:
#_0897D3: db $F9 ; new line
#_0897D4: db $26, $4B, $58, $30, $55, $26 ; いらっしゃい
#_0897DA: db $FF ; end of message

;===================================================================================================

; なにを ごちゅうもんで?
Message_00_05_29:
#_0897DB: db $39, $3A, $51, $CF, $A0, $35, $56, $27 ; なにを⎵ごちゅう
#_0897E3: db $47, $52, $A9, $95 ; もんで?
#_0897E7: db $FF ; end of message

;===================================================================================================

Message_00_05_2A:
#_0897E8: db $D3, $02 ; go to message 02

;===================================================================================================

; かねを もってきな ℏを
Message_00_05_2B:
#_0897EA: db $2A, $3C, $51, $CF, $47, $58, $37, $2B ; かねを⎵もってき
#_0897F2: db $39, $CF, $5C, $51 ; な⎵ℏを
#_0897F6: db $FF ; end of message

;===================================================================================================

; そちらは 
Message_00_05_2C:
#_0897F7: db $33, $35, $4B, $3E, $CF ; そちらは⎵
#_0897FC: db $FF ; end of message

;===================================================================================================

; >バーテン«と はなしますか?»
Message_00_05_2D:
#_0897FD: db $97, $C4, $5A, $6F, $8A ; >バーテン
#_089802: db $F2, $12 ; prewritten text 12
#_089804: db $FF ; end of message
#_089805: db $FF ; end of message

;===================================================================================================

; バーテン:
; ひとの せいしんに はいれる とか いってた
; ヨッパライが いてよ
; でも さいきん みかけねえな
Message_00_05_2E:
#_089806: db $C4, $5A, $6F, $8A, $9A ; バーテン:
#_08980B: db $F9 ; new line
#_08980C: db $D2, $47, $5C ; test progress bit 47 for message 5C
#_08980F: db $3F, $38, $3D, $CF, $32, $26, $30, $52 ; ひとの⎵せいしん
#_089817: db $3A, $CF, $3E, $26, $4E, $4D, $CF, $38 ; に⎵はいれる⎵と
#_08981F: db $2A, $CF, $26, $58, $37, $34 ; か⎵いってた
#_089825: db $F9 ; new line
#_089826: db $82, $92, $C9, $83, $5E, $9C, $CF, $26 ; ヨッパライが⎵い
#_08982E: db $37, $4A ; てよ
#_089830: db $FC ; wait for key and new line
#_089831: db $FA ; clear message box
#_089832: db $A9, $47, $CF, $2F, $26, $2B, $52, $CF ; でも⎵さいきん⎵
#_08983A: db $44, $2A, $2D, $3C, $28, $39 ; みかけねえな
#_089840: db $FF ; end of message

;===================================================================================================

; まいどあり
Message_00_05_2F:
#_089841: db $43, $26, $AA, $25, $4C ; まいどあり
#_089846: db $FF ; end of message

;===================================================================================================

Message_00_05_30:
#_089847: db $D3, $28 ; go to message 28

;===================================================================================================

Message_00_05_31:
#_089849: db $D3, $29 ; go to message 29

;===================================================================================================

Message_00_05_32:
#_08984B: db $D3, $02 ; go to message 02

;===================================================================================================

Message_00_05_33:
#_08984D: db $D3, $2B ; go to message 2B

;===================================================================================================

Message_00_05_34:
#_08984F: db $D3, $2C ; go to message 2C

;===================================================================================================

Message_00_05_35:
#_089851: db $D3, $2D ; go to message 2D

;===================================================================================================

; バーテン:
; まいにち まいにち タダで のみやがって
; ちくしょう«・・・»«・・・»
; でも せんのうや しせつけいさつは こわいんだ
; このまちで オザワに さからうやつは いないよ
Message_00_05_36:
#_089853: db $C4, $5A, $6F, $8A, $9A ; バーテン:
#_089858: db $F9 ; new line
#_089859: db $D2, $47, $5D ; test progress bit 47 for message 5D
#_08985C: db $43, $26, $3A, $35, $CF, $43, $26, $3A ; まいにち⎵まいに
#_089864: db $35, $CF, $6C, $BF, $A9, $CF, $3D, $44 ; ち⎵タダで⎵のみ
#_08986C: db $48, $9C, $58, $37 ; やがって
#_089870: db $F9 ; new line
#_089871: db $35, $2C, $30, $57, $27 ; ちくしょう
#_089876: db $F2, $0B ; prewritten text 0B
#_089878: db $F2, $0B ; prewritten text 0B
#_08987A: db $FC ; wait for key and new line
#_08987B: db $FA ; clear message box
#_08987C: db $A9, $47, $CF, $32, $52, $3D, $27, $48 ; でも⎵せんのうや
#_089884: db $CF, $30, $32, $36, $2D, $26, $2F, $36 ; ⎵しせつけいさつ
#_08988C: db $3E, $CF, $2E, $50, $26, $52, $A6 ; は⎵こわいんだ
#_089893: db $F9 ; new line
#_089894: db $2E, $3D, $43, $35, $A9, $CF, $61, $BA ; このまちで⎵オザ
#_08989C: db $88, $3A, $CF, $2F, $2A, $4B, $27, $48 ; ワに⎵さからうや
#_0898A4: db $36, $3E, $CF, $26, $39, $26, $4A ; つは⎵いないよ
#_0898AB: db $FF ; end of message

;===================================================================================================

Message_00_05_37:
#_0898AC: db $D3, $2F ; go to message 2F

;===================================================================================================

Message_00_05_38:
#_0898AE: db $D3, $28 ; go to message 28

;===================================================================================================

Message_00_05_39:
#_0898B0: db $D3, $29 ; go to message 29

;===================================================================================================

Message_00_05_3A:
#_0898B2: db $D3, $02 ; go to message 02

;===================================================================================================

Message_00_05_3B:
#_0898B4: db $D3, $2B ; go to message 2B

;===================================================================================================

Message_00_05_3C:
#_0898B6: db $D3, $2C ; go to message 2C

;===================================================================================================

Message_00_05_3D:
#_0898B8: db $D3, $2D ; go to message 2D

;===================================================================================================

; バーテン:
; まあ ほそぼそと みせを やらせてもらってます
Message_00_05_3E:
#_0898BA: db $C4, $5A, $6F, $8A, $9A ; バーテン:
#_0898BF: db $F9 ; new line
#_0898C0: db $43, $25, $CF, $42, $33, $AF, $33, $38 ; まあ⎵ほそぼそと
#_0898C8: db $CF, $44, $32, $51, $CF, $48, $4B, $32 ; ⎵みせを⎵やらせ
#_0898D0: db $37, $47, $4B, $58, $37, $43, $31 ; てもらってます
#_0898D7: db $FF ; end of message

;===================================================================================================

Message_00_05_3F:
#_0898D8: db $D3, $2F ; go to message 2F

;===================================================================================================

Message_00_05_40:
#_0898DA: db $D3, $20 ; go to message 20

;===================================================================================================

Message_00_05_41:
#_0898DC: db $D3, $21 ; go to message 21

;===================================================================================================

Message_00_05_42:
#_0898DE: db $D3, $02 ; go to message 02

;===================================================================================================

Message_00_05_43:
#_0898E0: db $D3, $23 ; go to message 23

;===================================================================================================

Message_00_05_44:
#_0898E2: db $D3, $24 ; go to message 24

;===================================================================================================

Message_00_05_45:
#_0898E4: db $D3, $25 ; go to message 25

;===================================================================================================

; バーテン:
; まあ ゆっくり たのしんで いきな
; ところで «ロッポンギ»から かえってきたやつが
; ひとりだけ いたんだ
; いのちからがら にげだしてきたらしくて
; ひとこと いうのが やっとだったよ
; はくしゃくは つぼを こわがっている«・・・»
; ってね いったい なんのことだ?
Message_00_05_46:
#_0898E6: db $C4, $5A, $6F, $8A, $9A ; バーテン:
#_0898EB: db $F9 ; new line
#_0898EC: db $43, $25, $CF, $49, $58, $2C, $4C, $CF ; まあ⎵ゆっくり⎵
#_0898F4: db $34, $3D, $30, $52, $A9, $CF, $26, $2B ; たのしんで⎵いき
#_0898FC: db $39 ; な
#_0898FD: db $FC ; wait for key and new line
#_0898FE: db $FA ; clear message box
#_0898FF: db $38, $2E, $4F, $A9, $CF ; ところで⎵
#_089904: db $F2, $4C ; prewritten text 4C
#_089906: db $2A, $4B, $CF, $2A, $28, $58, $37, $2B ; から⎵かえってき
#_08990E: db $34, $48, $36, $9C ; たやつが
#_089912: db $F9 ; new line
#_089913: db $3F, $38, $4C, $A6, $2D, $CF, $26, $34 ; ひとりだけ⎵いた
#_08991B: db $52, $A6 ; んだ
#_08991D: db $F9 ; new line
#_08991E: db $26, $3D, $35, $2A, $4B, $9C, $4B, $CF ; いのちからがら⎵
#_089926: db $3A, $9F, $A6, $30, $37, $2B, $34, $4B ; にげだしてきたら
#_08992E: db $30, $2C, $37 ; しくて
#_089931: db $F9 ; new line
#_089932: db $3F, $38, $2E, $38, $CF, $26, $27, $3D ; ひとこと⎵いうの
#_08993A: db $9C, $CF, $48, $58, $38, $A6, $58, $34 ; が⎵やっとだった
#_089942: db $4A ; よ
#_089943: db $FC ; wait for key and new line
#_089944: db $FA ; clear message box
#_089945: db $3E, $2C, $30, $55, $2C, $3E, $CF, $36 ; はくしゃくは⎵つ
#_08994D: db $AF, $51, $CF, $2E, $50, $9C, $58, $37 ; ぼを⎵こわがって
#_089955: db $26, $4D ; いる
#_089957: db $F2, $0B ; prewritten text 0B
#_089959: db $F9 ; new line
#_08995A: db $58, $37, $3C, $CF, $26, $58, $34, $26 ; ってね⎵いったい
#_089962: db $CF, $39, $52, $3D, $2E, $38, $A6, $95 ; ⎵なんのことだ?
#_08996A: db $FF ; end of message

;===================================================================================================

Message_00_05_47:
#_08996B: db $D3, $27 ; go to message 27

;===================================================================================================

Message_00_05_48:
#_08996D: db $D3, $20 ; go to message 20

;===================================================================================================

Message_00_05_49:
#_08996F: db $D3, $21 ; go to message 21

;===================================================================================================

Message_00_05_4A:
#_089971: db $D3, $02 ; go to message 02

;===================================================================================================

Message_00_05_4B:
#_089973: db $D3, $23 ; go to message 23

;===================================================================================================

Message_00_05_4C:
#_089975: db $D3, $24 ; go to message 24

;===================================================================================================

Message_00_05_4D:
#_089977: db $D3, $25 ; go to message 25

;===================================================================================================

; バーテン:
; «ロッポンギ»の うわさきいて
; あつまってきた やつらが
; ベリアルの まりょくで たぶらかされて
; ネビロスに たましい ぬかれちまったわけだな
Message_00_05_4E:
#_089979: db $C4, $5A, $6F, $8A, $9A ; バーテン:
#_08997E: db $F9 ; new line
#_08997F: db $F2, $4C ; prewritten text 4C
#_089981: db $3D, $CF, $27, $50, $2F, $2B, $26, $37 ; の⎵うわさきいて
#_089989: db $F9 ; new line
#_08998A: db $25, $36, $43, $58, $37, $2B, $34, $CF ; あつまってきた⎵
#_089992: db $48, $36, $4B, $9C ; やつらが
#_089996: db $F9 ; new line
#_089997: db $C7, $84, $5D, $85, $3D, $CF, $43, $4C ; ベリアルの⎵まり
#_08999F: db $57, $2C, $A9, $CF, $34, $AD, $4B, $2A ; ょくで⎵たぶらか
#_0899A7: db $2F, $4E, $37 ; されて
#_0899AA: db $F9 ; new line
#_0899AB: db $74, $C5, $87, $69, $3A, $CF, $34, $43 ; ネビロスに⎵たま
#_0899B3: db $30, $26, $CF, $3B, $2A, $4E, $35, $43 ; しい⎵ぬかれちま
#_0899BB: db $58, $34, $50, $2D, $A6, $39 ; ったわけだな
#_0899C1: db $FF ; end of message

;===================================================================================================

Message_00_05_4F:
#_0899C2: db $D3, $27 ; go to message 27

;===================================================================================================

; こうえんで さつじんが あったんだって!
; びっくりしたよ
; そのせいで «たちいりきんし»だったのが
; もうすぐ かいじょ されるらしいよ
; でもさ こうえんの いりぐちに
; へんな じいさんが いるんだよ
Message_00_05_50:
#_0899C4: db $2E, $27, $28, $52, $A9, $CF, $2F, $36 ; こうえんで⎵さつ
#_0899CC: db $A2, $52, $9C, $CF, $25, $58, $34, $52 ; じんが⎵あったん
#_0899D4: db $A6, $58, $37, $94 ; だって!
#_0899D8: db $F9 ; new line
#_0899D9: db $AC, $58, $2C, $4C, $30, $34, $4A ; びっくりしたよ
#_0899E0: db $FC ; wait for key and new line
#_0899E1: db $FA ; clear message box
#_0899E2: db $33, $3D, $32, $26, $A9, $CF ; そのせいで⎵
#_0899E8: db $F2, $0E ; prewritten text 0E
#_0899EA: db $A6, $58, $34, $3D, $9C ; だったのが
#_0899EF: db $F9 ; new line
#_0899F0: db $47, $27, $31, $9E, $CF, $2A, $26, $A2 ; もうすぐ⎵かいじ
#_0899F8: db $57, $CF, $2F, $4E, $4D, $4B, $30, $26 ; ょ⎵されるらしい
#_089A00: db $4A ; よ
#_089A01: db $F9 ; new line
#_089A02: db $A9, $47, $2F, $CF, $2E, $27, $28, $52 ; でもさ⎵こうえん
#_089A0A: db $3D, $CF, $26, $4C, $9E, $35, $3A ; の⎵いりぐちに
#_089A11: db $F9 ; new line
#_089A12: db $41, $52, $39, $CF, $A2, $26, $2F, $52 ; へんな⎵じいさん
#_089A1A: db $9C, $CF, $26, $4D, $52, $A6, $4A ; が⎵いるんだよ
#_089A21: db $FF ; end of message

;===================================================================================================

; えきの みなみぐちの エコービルは
; なんねんも つかわれてないの しってるだろう?
; あそこから ばけものが でてきたって
; うわさ きいたかい?
Message_00_05_51:
#_089A22: db $28, $2B, $3D, $CF, $44, $39, $44, $9E ; えきの⎵みなみぐ
#_089A2A: db $35, $3D, $CF, $60, $66, $5A, $C5, $85 ; ちの⎵エコービル
#_089A32: db $3E ; は
#_089A33: db $F9 ; new line
#_089A34: db $39, $52, $3C, $52, $47, $CF, $36, $2A ; なんねんも⎵つか
#_089A3C: db $50, $4E, $37, $39, $26, $3D, $CF, $30 ; われてないの⎵し
#_089A44: db $58, $37, $4D, $A6, $4F, $27, $95 ; ってるだろう?
#_089A4B: db $FC ; wait for key and new line
#_089A4C: db $FA ; clear message box
#_089A4D: db $25, $33, $2E, $2A, $4B, $CF, $AB, $2D ; あそこから⎵ばけ
#_089A55: db $47, $3D, $9C, $CF, $A9, $37, $2B, $34 ; ものが⎵でてきた
#_089A5D: db $58, $37 ; って
#_089A5F: db $F9 ; new line
#_089A60: db $27, $50, $2F, $CF, $2B, $26, $34, $2A ; うわさ⎵きいたか
#_089A68: db $26, $95 ; い?
#_089A6A: db $FF ; end of message

;===================================================================================================

; みなれん かおだな«・・・»
; «・・・»ん? «おまえたち»は«・・・»
; おまえは «アクマしょうかん»«プログラム»を
; もっているか?
; «・・・»ひとちがいか«・・・»
Message_00_05_52:
#_089A6B: db $44, $39, $4E, $52, $CF, $2A, $29, $A6 ; みなれん⎵かおだ
#_089A73: db $39 ; な
#_089A74: db $F2, $0B ; prewritten text 0B
#_089A76: db $F9 ; new line
#_089A77: db $F2, $0B ; prewritten text 0B
#_089A79: db $52, $95, $CF ; ん?⎵
#_089A7C: db $F2, $04 ; prewritten text 04
#_089A7E: db $3E ; は
#_089A7F: db $F2, $0B ; prewritten text 0B
#_089A81: db $FC ; wait for key and new line
#_089A82: db $FA ; clear message box
#_089A83: db $29, $43, $28, $3E, $CF ; おまえは⎵
#_089A88: db $F2, $13 ; prewritten text 13
#_089A8A: db $F2, $08 ; prewritten text 08
#_089A8C: db $51 ; を
#_089A8D: db $F9 ; new line
#_089A8E: db $47, $58, $37, $26, $4D, $2A, $95 ; もっているか?
#_089A95: db $F8, $53 ; YES/NO - go to message 53 if YES
#_089A97: db $F2, $0B ; prewritten text 0B
#_089A99: db $3F, $38, $35, $9C, $26, $2A ; ひとちがいか
#_089A9F: db $F2, $0B ; prewritten text 0B
#_089AA1: db $FF ; end of message

;===================================================================================================

; アクマが あばれまわる じょうたいを
; ほうっておいて よいと おもうか?
; へいわを とりもどすために
; より おおきな ちからを ふるっては
; いけないと おもうか?
Message_00_05_53:
#_089AA2: db $5D, $64, $7B, $9C, $CF, $25, $AB, $4E ; アクマが⎵あばれ
#_089AAA: db $43, $50, $4D, $CF, $A2, $57, $27, $34 ; まわる⎵じょうた
#_089AB2: db $26, $51 ; いを
#_089AB4: db $F9 ; new line
#_089AB5: db $42, $27, $58, $37, $29, $26, $37, $CF ; ほうっておいて⎵
#_089ABD: db $4A, $26, $38, $CF, $29, $47, $27, $2A ; よいと⎵おもうか
#_089AC5: db $95 ; ?
#_089AC6: db $F8, $55 ; YES/NO - go to message 55 if YES
#_089AC8: db $FA ; clear message box
#_089AC9: db $41, $26, $50, $51, $CF, $38, $4C, $47 ; へいわを⎵とりも
#_089AD1: db $AA, $31, $34, $46, $3A ; どすために
#_089AD6: db $F9 ; new line
#_089AD7: db $4A, $4C, $CF, $29, $29, $2B, $39, $CF ; より⎵おおきな⎵
#_089ADF: db $35, $2A, $4B, $51, $CF, $40, $4D, $58 ; ちからを⎵ふるっ
#_089AE7: db $37, $3E ; ては
#_089AE9: db $F9 ; new line
#_089AEA: db $26, $2D, $39, $26, $38, $CF, $29, $47 ; いけないと⎵おも
#_089AF2: db $27, $2A, $95 ; うか?
#_089AF5: db $F8, $54 ; YES/NO - go to message 54 if YES
#_089AF7: db $D3, $55 ; go to message 55

;===================================================================================================

; おまえに わたすものがある
; これを もっていけ
; さがしているひとに あえるだろう
; >[LEADER]は [ITEM]を
; «てにいれた»
Message_00_05_54:
#_089AF9: db $FA ; clear message box
#_089AFA: db $29, $43, $28, $3A, $CF, $50, $34, $31 ; おまえに⎵わたす
#_089B02: db $47, $3D, $9C, $25, $4D ; ものがある
#_089B07: db $E1, $F3 ; set $0A50 to item F3
#_089B09: db $FE, $3C, $56 ; ext command 3C: go to message 56 if no space for item
#_089B0C: db $FC ; wait for key and new line
#_089B0D: db $FA ; clear message box
#_089B0E: db $2E, $4E, $51, $CF, $47, $58, $37, $26 ; これを⎵もってい
#_089B16: db $2D ; け
#_089B17: db $F9 ; new line
#_089B18: db $2F, $9C, $30, $37, $26, $4D, $3F, $38 ; さがしているひと
#_089B20: db $3A, $CF, $25, $28, $4D, $A6, $4F, $27 ; に⎵あえるだろう
#_089B28: db $FC ; wait for key and new line
#_089B29: db $FA ; clear message box
#_089B2A: db $97 ; >
#_089B2B: db $F1 ; write leader's name for team
#_089B2C: db $3E, $CF ; は⎵
#_089B2E: db $F3 ; write item name from $0A50
#_089B2F: db $51 ; を
#_089B30: db $F9 ; new line
#_089B31: db $F2, $2D ; prewritten text 2D
#_089B33: db $FE, $28 ; ext command 28: add item to inventory from $0A50
#_089B35: db $FF ; end of message

;===================================================================================================

; そうか«・・・»
Message_00_05_55:
#_089B36: db $FA ; clear message box
#_089B37: db $33, $27, $2A ; そうか
#_089B3A: db $F2, $0B ; prewritten text 0B
#_089B3C: db $FF ; end of message

;===================================================================================================

; が«・・・»
; もちものが いっぱいだな へらしてこい
Message_00_05_56:
#_089B3D: db $9C ; が
#_089B3E: db $F2, $0B ; prewritten text 0B
#_089B40: db $FC ; wait for key and new line
#_089B41: db $FA ; clear message box
#_089B42: db $47, $35, $47, $3D, $9C, $CF, $26, $58 ; もちものが⎵いっ
#_089B4A: db $B0, $26, $A6, $39, $CF, $41, $4B, $30 ; ぱいだな⎵へらし
#_089B52: db $37, $2E, $26 ; てこい
#_089B55: db $FF ; end of message

;===================================================================================================

; あの ゆりこって おんな
; «リーダー»を ねらって ここに でいりしてたとは
; うかつだった
; これで «レジスタンス»も おしまいか
Message_00_05_57:
#_089B56: db $D2, $27, $58 ; test progress bit 27 for message 58
#_089B59: db $25, $3D, $CF, $49, $4C, $2E, $58, $37 ; あの⎵ゆりこって
#_089B61: db $CF, $29, $52, $39 ; ⎵おんな
#_089B65: db $F9 ; new line
#_089B66: db $F2, $16 ; prewritten text 16
#_089B68: db $51, $CF, $3C, $4B, $58, $37, $CF, $2E ; を⎵ねらって⎵こ
#_089B70: db $2E, $3A, $CF, $A9, $26, $4C, $30, $37 ; こに⎵でいりして
#_089B78: db $34, $38, $3E ; たとは
#_089B7B: db $F9 ; new line
#_089B7C: db $27, $2A, $36, $A6, $58, $34 ; うかつだった
#_089B82: db $F9 ; new line
#_089B83: db $2E, $4E, $A9, $CF ; これで⎵
#_089B87: db $F2, $15 ; prewritten text 15
#_089B89: db $47, $CF, $29, $30, $43, $26, $2A ; も⎵おしまいか
#_089B90: db $FF ; end of message

;===================================================================================================

; «リーダー»を たすけてくれて
; ほんとうに «ありがとう»よ
Message_00_05_58:
#_089B91: db $F2, $16 ; prewritten text 16
#_089B93: db $51, $CF, $34, $31, $2D, $37, $2C, $4E ; を⎵たすけてくれ
#_089B9B: db $37 ; て
#_089B9C: db $F9 ; new line
#_089B9D: db $42, $52, $38, $27, $3A, $CF ; ほんとうに⎵
#_089BA3: db $F2, $0D ; prewritten text 0D
#_089BA5: db $4A ; よ
#_089BA6: db $FF ; end of message

;===================================================================================================

; ガキのくせに こんなところを
; うろうろしてんじゃねえ
Message_00_05_59:
#_089BA7: db $B5, $63, $3D, $2C, $32, $3A, $CF, $2E ; ガキのくせに⎵こ
#_089BAF: db $52, $39, $38, $2E, $4F, $51 ; んなところを
#_089BB5: db $F9 ; new line
#_089BB6: db $27, $4F, $27, $4F, $30, $37, $52, $A2 ; うろうろしてんじ
#_089BBE: db $55, $3C, $28 ; ゃねえ
#_089BC1: db $FF ; end of message

;===================================================================================================

; おまえらも きを つけな
Message_00_05_5A:
#_089BC2: db $29, $43, $28, $4B, $47, $CF, $2B, $51 ; おまえらも⎵きを
#_089BCA: db $CF, $36, $2D, $39 ; ⎵つけな
#_089BCE: db $FF ; end of message

;===================================================================================================

; ここは «ロッポンギ»
; あれはてた «トウキョウ»の オアシスですよ
Message_00_05_5B:
#_089BCF: db $2E, $2E, $3E, $CF ; ここは⎵
#_089BD3: db $F2, $4C ; prewritten text 4C
#_089BD5: db $F9 ; new line
#_089BD6: db $25, $4E, $3E, $37, $34, $CF ; あれはてた⎵
#_089BDC: db $F2, $1C ; prewritten text 1C
#_089BDE: db $3D, $CF, $61, $5D, $68, $69, $A9, $31 ; の⎵オアシスです
#_089BE6: db $4A ; よ
#_089BE7: db $FF ; end of message

;===================================================================================================

; せっかく いままで オザワに
; せっせと ワイロを わたしてたのに
; パーに なっちまった
Message_00_05_5C:
#_089BE8: db $32, $58, $2A, $2C, $CF, $26, $43, $43 ; せっかく⎵いまま
#_089BF0: db $A9, $CF, $61, $BA, $88, $3A ; で⎵オザワに
#_089BF6: db $F9 ; new line
#_089BF7: db $32, $58, $32, $38, $CF, $88, $5E, $87 ; せっせと⎵ワイロ
#_089BFF: db $51, $CF, $50, $34, $30, $37, $34, $3D ; を⎵わたしてたの
#_089C07: db $3A ; に
#_089C08: db $F9 ; new line
#_089C09: db $C9, $5A, $3A, $CF, $39, $58, $35, $43 ; パーに⎵なっちま
#_089C11: db $58, $34 ; った
#_089C13: db $FF ; end of message

;===================================================================================================

; オザワの やつめ ざまあみろ
; ついに ばちが あたったんだ
Message_00_05_5D:
#_089C14: db $61, $BA, $88, $3D, $CF, $48, $36, $46 ; オザワの⎵やつめ
#_089C1C: db $CF, $A1, $43, $25, $44, $4F ; ⎵ざまあみろ
#_089C22: db $F9 ; new line
#_089C23: db $36, $26, $3A, $CF, $AB, $35, $9C, $CF ; ついに⎵ばちが⎵
#_089C2B: db $25, $34, $58, $34, $52, $A6 ; あたったんだ
#_089C31: db $FF ; end of message

;===================================================================================================

; けいかん:
; そこに はいってろ!
Message_00_07_00:
#_089C32: db $FE, $37 ; ext command 37: reload dungeon view
#_089C34: db $D7, $33 ; load scene 33
#_089C36: db $D2, $12, $0E ; test progress bit 12 for message 0E
#_089C39: db $D2, $10, $09 ; test progress bit 10 for message 09
#_089C3C: db $D2, $0F, $01 ; test progress bit 0F for message 01
#_089C3F: db $D6, $01, $62, $70, $28 ; place sprite 62 in slot 01 at XY:{70,28}
#_089C44: db $FE, $1C, $00 ; ext command 1C: $00 TODO
#_089C47: db $2D, $26, $2A, $52, $9A ; けいかん:
#_089C4C: db $F9 ; new line
#_089C4D: db $33, $2E, $3A, $CF, $3E, $26, $58, $37 ; そこに⎵はいって
#_089C55: db $4F, $94 ; ろ!
#_089C57: db $FC ; wait for key and new line
#_089C58: db $D0, $0F ; set progress bit 0F
#_089C5A: db $D0, $0C ; set progress bit 0C
#_089C5C: db $FE, $1A, $18, $06, $01, $00, $02, $03 ; ext command 1A: 18,06,01,00,02,03
#_089C64: db $FF ; end of message

;===================================================================================================

; «>てつごうしは ビクともしない»
Message_00_07_01:
#_089C65: db $F2, $84 ; prewritten text 84
#_089C67: db $FF ; end of message

;===================================================================================================

; «しょうねん»:
; «・・・»きみも つかまったんですか«・・・»
; あっ«・・・»きみは«・・・»
; [CHASE]くん ですか!?
; ゆめじゃないんですね!
; ぼくは [JIMMY]です
; おぼえていますか?
; [CHASE]くん きいてください
; ぼくの かのじょが
; ゆくえふめいに なってしまいました
; かのじょを さがしているうちに
; アクマが おそってきて«・・・»
; たたかっていたら
; けいさつに つかまったんです
Message_00_07_02:
#_089C68: db $D2, $10, $08 ; test progress bit 10 for message 08
#_089C6B: db $D6, $00, $2B, $70, $48 ; place sprite 2B in slot 00 at XY:{70,48}
#_089C70: db $D2, $11, $03 ; test progress bit 11 for message 03
#_089C73: db $D5, $45 ; send 45 to APU
#_089C75: db $F2, $01 ; prewritten text 01
#_089C77: db $9A ; :
#_089C78: db $F9 ; new line
#_089C79: db $F2, $0B ; prewritten text 0B
#_089C7B: db $2B, $44, $47, $CF, $36, $2A, $43, $58 ; きみも⎵つかまっ
#_089C83: db $34, $52, $A9, $31, $2A ; たんですか
#_089C88: db $F2, $0B ; prewritten text 0B
#_089C8A: db $F9 ; new line
#_089C8B: db $25, $58 ; あっ
#_089C8D: db $F2, $0B ; prewritten text 0B
#_089C8F: db $2B, $44, $3E ; きみは
#_089C92: db $F2, $0B ; prewritten text 0B
#_089C94: db $F9 ; new line
#_089C95: db $D6, $00, $2E, $70, $28 ; place sprite 2E in slot 00 at XY:{70,28}
#_089C9A: db $F0 ; write player name
#_089C9B: db $2C, $52, $CF, $A9, $31, $2A, $94, $95 ; くん⎵ですか!?
#_089CA3: db $FC ; wait for key and new line
#_089CA4: db $FA ; clear message box
#_089CA5: db $49, $46, $A2, $55, $39, $26, $52, $A9 ; ゆめじゃないんで
#_089CAD: db $31, $3C, $94 ; すね!
#_089CB0: db $F9 ; new line
#_089CB1: db $AF, $2C, $3E, $CF ; ぼくは⎵
#_089CB5: db $EE ; write lawful hero name
#_089CB6: db $A9, $31 ; です
#_089CB8: db $F9 ; new line
#_089CB9: db $29, $AF, $28, $37, $26, $43, $31, $2A ; おぼえていますか
#_089CC1: db $95 ; ?
#_089CC2: db $FC ; wait for key and new line
#_089CC3: db $FA ; clear message box
#_089CC4: db $F0 ; write player name
#_089CC5: db $2C, $52, $CF, $2B, $26, $37, $2C, $A6 ; くん⎵きいてくだ
#_089CCD: db $2F, $26 ; さい
#_089CCF: db $F9 ; new line
#_089CD0: db $AF, $2C, $3D, $CF, $2A, $3D, $A2, $57 ; ぼくの⎵かのじょ
#_089CD8: db $9C ; が
#_089CD9: db $F9 ; new line
#_089CDA: db $49, $2C, $28, $40, $46, $26, $3A, $CF ; ゆくえふめいに⎵
#_089CE2: db $39, $58, $37, $30, $43, $26, $43, $30 ; なってしまいまし
#_089CEA: db $34 ; た
#_089CEB: db $FC ; wait for key and new line
#_089CEC: db $FA ; clear message box
#_089CED: db $2A, $3D, $A2, $57, $51, $CF, $2F, $9C ; かのじょを⎵さが
#_089CF5: db $30, $37, $26, $4D, $27, $35, $3A ; しているうちに
#_089CFC: db $F9 ; new line
#_089CFD: db $5D, $64, $7B, $9C, $CF, $29, $33, $58 ; アクマが⎵おそっ
#_089D05: db $37, $2B, $37 ; てきて
#_089D08: db $F2, $0B ; prewritten text 0B
#_089D0A: db $FC ; wait for key and new line
#_089D0B: db $FA ; clear message box
#_089D0C: db $34, $34, $2A, $58, $37, $26, $34, $4B ; たたかっていたら
#_089D14: db $F9 ; new line
#_089D15: db $2D, $26, $2F, $36, $3A, $CF, $36, $2A ; けいさつに⎵つか
#_089D1D: db $43, $58, $34, $52, $A9, $31 ; まったんです
#_089D23: db $FC ; wait for key and new line
#_089D24: db $D0, $11 ; set progress bit 11
#_089D26: db $FA ; clear message box
#_089D27: db $D3, $04 ; go to message 04

;===================================================================================================

; [JIMMY]:
Message_00_07_03:
#_089D29: db $EE ; write lawful hero name
#_089D2A: db $9A ; :
#_089D2B: db $F9 ; new line

;===================================================================================================

; かのじょを はやく さがさないと«・・・»
; さがすのを てつだって くれませんか?
; そうですか«・・・»すみません
; つい ゆめの つもりで
; きやすく たのんでしまったんです
Message_00_07_04:
#_089D2C: db $2A, $3D, $A2, $57, $51, $CF, $3E, $48 ; かのじょを⎵はや
#_089D34: db $2C, $CF, $2F, $9C, $2F, $39, $26, $38 ; く⎵さがさないと
#_089D3C: db $F2, $0B ; prewritten text 0B
#_089D3E: db $FC ; wait for key and new line
#_089D3F: db $FA ; clear message box
#_089D40: db $2F, $9C, $31, $3D, $51, $CF, $37, $36 ; さがすのを⎵てつ
#_089D48: db $A6, $58, $37, $CF, $2C, $4E, $43, $32 ; だって⎵くれませ
#_089D50: db $52, $2A, $95 ; んか?
#_089D53: db $F8, $05 ; YES/NO - go to message 05 if YES
#_089D55: db $D4, $03 ; set text box size to 3
#_089D57: db $33, $27, $A9, $31, $2A ; そうですか
#_089D5C: db $F2, $0B ; prewritten text 0B
#_089D5E: db $31, $44, $43, $32, $52 ; すみません
#_089D63: db $F9 ; new line
#_089D64: db $36, $26, $CF, $49, $46, $3D, $CF, $36 ; つい⎵ゆめの⎵つ
#_089D6C: db $47, $4C, $A9 ; もりで
#_089D6F: db $F9 ; new line
#_089D70: db $2B, $48, $31, $2C, $CF, $34, $3D, $52 ; きやすく⎵たのん
#_089D78: db $A9, $30, $43, $58, $34, $52, $A9, $31 ; でしまったんです
#_089D80: db $D6, $00, $2B, $70, $48 ; place sprite 2B in slot 00 at XY:{70,48}
#_089D85: db $FC ; wait for key and new line
#_089D86: db $FF ; end of message

;===================================================================================================

; ほんとうですか «ありがとう»ございます
; >[JIMMY]が «ナカマに くわわった»
; [JIMMY]:
; かのじょのなまえは [MOMO] です
; えっ [CHASE]くんは
; [MOMO]の いえの
; となりに すんでいたんですか«・・・»
Message_00_07_05:
#_089D87: db $D4, $03 ; set text box size to 3
#_089D89: db $D6, $00, $2E, $70, $28 ; place sprite 2E in slot 00 at XY:{70,28}
#_089D8E: db $42, $52, $38, $27, $A9, $31, $2A, $CF ; ほんとうですか⎵
#_089D96: db $F2, $0D ; prewritten text 0D
#_089D98: db $A0, $A1, $26, $43, $31 ; ございます
#_089D9D: db $FC ; wait for key and new line
#_089D9E: db $FE, $26, $02 ; ext command 26: something 02 TODO
#_089DA1: db $FA ; clear message box
#_089DA2: db $97 ; >
#_089DA3: db $EE ; write lawful hero name
#_089DA4: db $9C, $CF ; が⎵
#_089DA6: db $F2, $2F ; prewritten text 2F
#_089DA8: db $FC ; wait for key and new line
#_089DA9: db $D0, $10 ; set progress bit 10
#_089DAB: db $FA ; clear message box
#_089DAC: db $EE ; write lawful hero name
#_089DAD: db $9A ; :
#_089DAE: db $F9 ; new line
#_089DAF: db $2A, $3D, $A2, $57, $3D, $39, $43, $28 ; かのじょのなまえ
#_089DB7: db $3E, $CF ; は⎵
#_089DB9: db $ED ; write female protag name
#_089DBA: db $CF, $A9, $31 ; ⎵です
#_089DBD: db $FC ; wait for key and new line
#_089DBE: db $FA ; clear message box
#_089DBF: db $28, $58, $CF ; えっ⎵
#_089DC2: db $F0 ; write player name
#_089DC3: db $2C, $52, $3E ; くんは
#_089DC6: db $F9 ; new line
#_089DC7: db $ED ; write female protag name
#_089DC8: db $3D, $CF, $26, $28, $3D ; の⎵いえの
#_089DCD: db $F9 ; new line
#_089DCE: db $38, $39, $4C, $3A, $CF, $31, $52, $A9 ; となりに⎵すんで
#_089DD6: db $26, $34, $52, $A9, $31, $2A ; いたんですか
#_089DDC: db $F2, $0B ; prewritten text 0B
#_089DDE: db $FC ; wait for key and new line

;===================================================================================================

Message_00_07_06:
#_089DDF: db $FA ; clear message box

;===================================================================================================

; とにかく だっしゅつする てを
; かんがえましょう
Message_00_07_07:
#_089DE0: db $38, $3A, $2A, $2C, $CF, $A6, $58, $30 ; とにかく⎵だっし
#_089DE8: db $56, $36, $31, $4D, $CF, $37, $51 ; ゅつする⎵てを
#_089DEF: db $F9 ; new line
#_089DF0: db $2A, $52, $9C, $28, $43, $30, $57, $27 ; かんがえましょう
#_089DF8: db $FC ; wait for key and new line
#_089DF9: db $D6, $00, $00 ; delete sprite in slot 00
#_089DFC: db $FF ; end of message

;===================================================================================================

; [JIMMY]:
Message_00_07_08:
#_089DFD: db $D6, $00, $2E, $70, $28 ; place sprite 2E in slot 00 at XY:{70,28}
#_089E02: db $EE ; write lawful hero name
#_089E03: db $9A ; :
#_089E04: db $F9 ; new line
#_089E05: db $D3, $07 ; go to message 07

;===================================================================================================

; かかりいん:
; しゅじゅつの じかんだ でてもらおう
; >[JIMMY]が かかりいんに
Message_00_07_09:
#_089E07: db $D6, $07, $53, $70, $28 ; place sprite 53 in slot 07 at XY:{70,28}
#_089E0C: db $2A, $2A, $4C, $26, $52, $9A ; かかりいん:
#_089E12: db $F9 ; new line
#_089E13: db $30, $56, $A2, $56, $36, $3D, $CF, $A2 ; しゅじゅつの⎵じ
#_089E1B: db $2A, $52, $A6, $CF, $A9, $37, $47, $4B ; かんだ⎵でてもら
#_089E23: db $29, $27 ; おう
#_089E25: db $FC ; wait for key and new line
#_089E26: db $FE, $62 ; ext command 62: Call routine 0FA371 TODO
#_089E28: db $E9, $02, $0D ; go to message 0D maybe TODO
#_089E2B: db $FA ; clear message box
#_089E2C: db $97 ; >
#_089E2D: db $EE ; write lawful hero name
#_089E2E: db $9C, $CF, $2A, $2A, $4C, $26, $52, $3A ; が⎵かかりいんに
#_089E36: db $F9 ; new line

;===================================================================================================

;  かかりいんに
; とびかかった!
Message_00_07_0A:
#_089E2F: db $CF, $2A, $2A, $4C, $26, $52, $3A ; ⎵かかりいんに
#_089E36: db $F9 ; new line
#_089E37: db $38, $AC, $2A, $2A, $58, $34, $94 ; とびかかった!
#_089E3E: db $FC ; wait for key and new line
#_089E3F: db $FA ; clear message box
#_089E40: db $D5, $2B ; send 2B to APU
#_089E42: db $D6, $07, $00 ; delete sprite in slot 07
#_089E45: db $FE, $07, $40 ; ext command 07: draw buffered text then wait 63 frames

;===================================================================================================

; [JIMMY]:
; さあ いまのうちに そとへ
Message_00_07_0B:
#_089E48: db $E9, $02, $0C ; go to message 0C maybe TODO
#_089E4B: db $D6, $07, $2E, $70, $28 ; place sprite 2E in slot 07 at XY:{70,28}
#_089E50: db $FA ; clear message box
#_089E51: db $EE ; write lawful hero name
#_089E52: db $9A ; :
#_089E53: db $F9 ; new line
#_089E54: db $2F, $25, $CF, $26, $43, $3D, $27, $35 ; さあ⎵いまのうち
#_089E5C: db $3A, $CF, $33, $38, $41 ; に⎵そとへ
#_089E61: db $FC ; wait for key and new line

;===================================================================================================

Message_00_07_0C:
#_089E62: db $D0, $12 ; set progress bit 12
#_089E64: db $D6, $00, $00 ; delete sprite in slot 00
#_089E67: db $FE, $1A, $18, $04, $01, $00, $02, $03 ; ext command 1A: 18,04,01,00,02,03
#_089E6F: db $FF ; end of message

;===================================================================================================

; >[CHASE]が
Message_00_07_0D:
#_089E70: db $97 ; >
#_089E71: db $F0 ; write player name
#_089E72: db $9C ; が
#_089E73: db $D3, $0A ; go to message 0A

;===================================================================================================

; >«だれもいない»
Message_00_07_0E:
#_089E75: db $97 ; >
#_089E76: db $F2, $2C ; prewritten text 2C
#_089E78: db $FC ; wait for key and new line
#_089E79: db $FF ; end of message

;===================================================================================================

; >みぎの へやから
; ものおとが きこえる«・・・»
Message_00_07_0F:
#_089E7A: db $97, $44, $9D, $3D, $CF, $41, $48, $2A ; >みぎの⎵へやか
#_089E82: db $4B ; ら
#_089E83: db $F9 ; new line
#_089E84: db $47, $3D, $29, $38, $9C, $CF, $2B, $2E ; ものおとが⎵きこ
#_089E8C: db $28, $4D ; える
#_089E8E: db $F2, $0B ; prewritten text 0B
#_089E90: db $FC ; wait for key and new line
#_089E91: db $FF ; end of message

;===================================================================================================

; かんじゃ:
; たいほしたのに どうして
; «びょういん»に いれるんだ?
Message_00_07_10:
#_089E92: db $D7, $85, $33 ; load scenes 85 and 33
#_089E95: db $D2, $14, $1B ; test progress bit 14 for message 1B
#_089E98: db $D6, $07, $69, $70, $28 ; place sprite 69 in slot 07 at XY:{70,28}
#_089E9D: db $2A, $52, $A2, $55, $9A ; かんじゃ:
#_089EA2: db $F9 ; new line
#_089EA3: db $34, $26, $42, $30, $34, $3D, $3A, $CF ; たいほしたのに⎵
#_089EAB: db $AA, $27, $30, $37 ; どうして
#_089EAF: db $F9 ; new line
#_089EB0: db $F2, $35 ; prewritten text 35
#_089EB2: db $3A, $CF, $26, $4E, $4D, $52, $A6, $95 ; に⎵いれるんだ?
#_089EBA: db $FC ; wait for key and new line
#_089EBB: db $FF ; end of message

;===================================================================================================

; かんじゃ:
; たすけてくれ! «かいぞうしゅじゅつ» なんて
; いやだ!!
Message_00_07_11:
#_089EBC: db $D7, $85, $33 ; load scenes 85 and 33
#_089EBF: db $D2, $14, $1B ; test progress bit 14 for message 1B
#_089EC2: db $D6, $07, $4A, $78, $28 ; place sprite 4A in slot 07 at XY:{78,28}
#_089EC7: db $2A, $52, $A2, $55, $9A ; かんじゃ:
#_089ECC: db $F9 ; new line
#_089ECD: db $34, $31, $2D, $37, $2C, $4E, $94, $CF ; たすけてくれ!⎵
#_089ED5: db $F2, $14 ; prewritten text 14
#_089ED7: db $CF, $39, $52, $37 ; ⎵なんて
#_089EDB: db $F9 ; new line
#_089EDC: db $26, $48, $A6, $94, $94 ; いやだ!!
#_089EE1: db $FC ; wait for key and new line
#_089EE2: db $FF ; end of message

;===================================================================================================

; かかりいん:
; «いんちょう»は むてきの へいしをつくる
; じっけんを しているのです
; わたしも じっけんだいに なってしまう«・・・»
Message_00_07_12:
#_089EE3: db $D7, $85, $33 ; load scenes 85 and 33
#_089EE6: db $D2, $14, $1B ; test progress bit 14 for message 1B
#_089EE9: db $D6, $07, $53, $70, $28 ; place sprite 53 in slot 07 at XY:{70,28}
#_089EEE: db $2A, $2A, $4C, $26, $52, $9A ; かかりいん:
#_089EF4: db $F9 ; new line
#_089EF5: db $F2, $8F ; prewritten text 8F
#_089EF7: db $3E, $CF, $45, $37, $2B, $3D, $CF, $41 ; は⎵むてきの⎵へ
#_089EFF: db $26, $30, $51, $36, $2C, $4D ; いしをつくる
#_089F05: db $F9 ; new line
#_089F06: db $A2, $58, $2D, $52, $51, $CF, $30, $37 ; じっけんを⎵して
#_089F0E: db $26, $4D, $3D, $A9, $31 ; いるのです
#_089F13: db $F9 ; new line
#_089F14: db $50, $34, $30, $47, $CF, $A2, $58, $2D ; わたしも⎵じっけ
#_089F1C: db $52, $A6, $26, $3A, $CF, $39, $58, $37 ; んだいに⎵なって
#_089F24: db $30, $43, $27 ; しまう
#_089F27: db $F2, $0B ; prewritten text 0B
#_089F29: db $FC ; wait for key and new line
#_089F2A: db $FF ; end of message

;===================================================================================================

; «くるまいすのおとこ»:
Message_00_07_13:
#_089F2B: db $D7, $85, $33 ; load scenes 85 and 33
#_089F2E: db $D2, $14, $1B ; test progress bit 14 for message 1B
#_089F31: db $D5, $47 ; send 47 to APU
#_089F33: db $D6, $00, $2D, $70, $28 ; place sprite 2D in slot 00 at XY:{70,28}
#_089F38: db $F2, $83 ; prewritten text 83
#_089F3A: db $9A ; :
#_089F3B: db $F9 ; new line
#_089F3C: db $E9, $00, $14 ; go to message 14 maybe TODO
#_089F3F: db $D3, $15 ; go to message 15

;===================================================================================================

; ひどく やられたな
; だいじょうぶかい
Message_00_07_14:
#_089F41: db $3F, $AA, $2C, $CF, $48, $4B, $4E, $34 ; ひどく⎵やられた
#_089F49: db $39 ; な
#_089F4A: db $F9 ; new line
#_089F4B: db $A6, $26, $A2, $57, $27, $AD, $2A, $26 ; だいじょうぶかい
#_089F53: db $FC ; wait for key and new line
#_089F54: db $FA ; clear message box

;===================================================================================================

; きみは わたしが つくった «プログラム»を
; もっているな «やくにたって いるかね?»
Message_00_07_15:
#_089F55: db $FE, $25, $FE ; ext command 25: something FE TODO
#_089F58: db $FE, $23, $FE ; ext command 23: something FE TODO
#_089F5B: db $FE, $24, $FE ; ext command 24: something FE TODO
#_089F5E: db $D2, $13, $18 ; test progress bit 13 for message 18
#_089F61: db $2B, $44, $3E, $CF, $50, $34, $30, $9C ; きみは⎵わたしが
#_089F69: db $CF, $36, $2C, $58, $34, $CF ; ⎵つくった⎵
#_089F6F: db $F2, $08 ; prewritten text 08
#_089F71: db $51 ; を
#_089F72: db $F9 ; new line
#_089F73: db $47, $58, $37, $26, $4D, $39, $CF ; もっているな⎵
#_089F7A: db $F2, $85 ; prewritten text 85
#_089F7C: db $FC ; wait for key and new line

;===================================================================================================

; かつて わたしは しゅんかんいどうそうち«・・・»
; «ターミナルシステム»の かいはつを していた
; ところが じっけんちゅうに
; ぐうぜんアクマを よびだしてしまったのだ
; わたしは アクマを なんとか たおしたが
; おおケガを してしまった«・・・»
; その にがい けいけんから
; アクマを ナカマに
; することができる«プログラム»«・・・»
; «アクマしょうかん»«プログラム»を
; つくったのだ
; ターミナルが マカイへ つながったことを しった
; ゴトウというおとこが
; アクマを よびだして あやつろうとしている
; わたしは «アクマしょうかん»«プログラム»を
; おおぜいの ひとに おくった
; アクマを あやつれる ひとを ふやして
; アクマの むちつじょな はんらんを
; とめようとしたが つかいこなすのは
; むずかしいようだ
; わたしの はなしが わかったかね?
Message_00_07_16:
#_089F7D: db $FA ; clear message box
#_089F7E: db $2A, $36, $37, $CF, $50, $34, $30, $3E ; かつて⎵わたしは
#_089F86: db $CF, $30, $56, $52, $2A, $52, $26, $AA ; ⎵しゅんかんいど
#_089F8E: db $27, $33, $27, $35 ; うそうち
#_089F92: db $F2, $0B ; prewritten text 0B
#_089F94: db $F9 ; new line
#_089F95: db $F2, $90 ; prewritten text 90
#_089F97: db $3D, $CF, $2A, $26, $3E, $36, $51, $CF ; の⎵かいはつを⎵
#_089F9F: db $30, $37, $26, $34 ; していた
#_089FA3: db $F9 ; new line
#_089FA4: db $38, $2E, $4F, $9C, $CF, $A2, $58, $2D ; ところが⎵じっけ
#_089FAC: db $52, $35, $56, $27, $3A ; んちゅうに
#_089FB1: db $F9 ; new line
#_089FB2: db $9E, $27, $A4, $52, $5D, $64, $7B, $51 ; ぐうぜんアクマを
#_089FBA: db $CF, $4A, $AC, $A6, $30, $37, $30, $43 ; ⎵よびだしてしま
#_089FC2: db $58, $34, $3D, $A6 ; ったのだ
#_089FC6: db $FC ; wait for key and new line
#_089FC7: db $FA ; clear message box
#_089FC8: db $50, $34, $30, $3E, $CF, $5D, $64, $7B ; わたしは⎵アクマ
#_089FD0: db $51, $CF, $39, $52, $38, $2A, $CF, $34 ; を⎵なんとか⎵た
#_089FD8: db $29, $30, $34, $9C ; おしたが
#_089FDC: db $F9 ; new line
#_089FDD: db $29, $29, $65, $B5, $51, $CF, $30, $37 ; おおケガを⎵して
#_089FE5: db $30, $43, $58, $34 ; しまった
#_089FE9: db $F2, $0B ; prewritten text 0B
#_089FEB: db $F9 ; new line
#_089FEC: db $33, $3D, $CF, $3A, $9C, $26, $CF, $2D ; その⎵にがい⎵け
#_089FF4: db $26, $2D, $52, $2A, $4B ; いけんから
#_089FF9: db $F9 ; new line
#_089FFA: db $5D, $64, $7B, $51, $CF, $71, $62, $7B ; アクマを⎵ナカマ
#_08A002: db $3A ; に
#_08A003: db $F9 ; new line
#_08A004: db $31, $4D, $2E, $38, $9C, $A9, $2B, $4D ; することができる
#_08A00C: db $F2, $08 ; prewritten text 08
#_08A00E: db $F2, $0B ; prewritten text 0B
#_08A010: db $F9 ; new line
#_08A011: db $F2, $13 ; prewritten text 13
#_08A013: db $F2, $08 ; prewritten text 08
#_08A015: db $51 ; を
#_08A016: db $F9 ; new line
#_08A017: db $36, $2C, $58, $34, $3D, $A6 ; つくったのだ
#_08A01D: db $FC ; wait for key and new line
#_08A01E: db $FA ; clear message box
#_08A01F: db $6C, $5A, $7C, $71, $85, $9C, $CF, $7B ; ターミナルが⎵マ
#_08A027: db $62, $5E, $41, $CF, $36, $39, $9C, $58 ; カイへ⎵つながっ
#_08A02F: db $34, $2E, $38, $51, $CF, $30, $58, $34 ; たことを⎵しった
#_08A037: db $F9 ; new line
#_08A038: db $B9, $70, $5F, $38, $26, $27, $29, $38 ; ゴトウというおと
#_08A040: db $2E, $9C ; こが
#_08A042: db $F9 ; new line
#_08A043: db $5D, $64, $7B, $51, $CF, $4A, $AC, $A6 ; アクマを⎵よびだ
#_08A04B: db $30, $37, $CF, $25, $48, $36, $4F, $27 ; して⎵あやつろう
#_08A053: db $38, $30, $37, $26, $4D ; としている
#_08A058: db $F9 ; new line
#_08A059: db $50, $34, $30, $3E, $CF ; わたしは⎵
#_08A05E: db $F2, $13 ; prewritten text 13
#_08A060: db $F2, $08 ; prewritten text 08
#_08A062: db $51 ; を
#_08A063: db $F9 ; new line
#_08A064: db $29, $29, $A4, $26, $3D, $CF, $3F, $38 ; おおぜいの⎵ひと
#_08A06C: db $3A, $CF, $29, $2C, $58, $34 ; に⎵おくった
#_08A072: db $FC ; wait for key and new line
#_08A073: db $FA ; clear message box
#_08A074: db $5D, $64, $7B, $51, $CF, $25, $48, $36 ; アクマを⎵あやつ
#_08A07C: db $4E, $4D, $CF, $3F, $38, $51, $CF, $40 ; れる⎵ひとを⎵ふ
#_08A084: db $48, $30, $37 ; やして
#_08A087: db $F9 ; new line
#_08A088: db $5D, $64, $7B, $3D, $CF, $45, $35, $36 ; アクマの⎵むちつ
#_08A090: db $A2, $57, $39, $CF, $3E, $52, $4B, $52 ; じょな⎵はんらん
#_08A098: db $51 ; を
#_08A099: db $F9 ; new line
#_08A09A: db $38, $46, $4A, $27, $38, $30, $34, $9C ; とめようとしたが
#_08A0A2: db $CF, $36, $2A, $26, $2E, $39, $31, $3D ; ⎵つかいこなすの
#_08A0AA: db $3E ; は
#_08A0AB: db $F9 ; new line
#_08A0AC: db $45, $A3, $2A, $30, $26, $4A, $27, $A6 ; むずかしいようだ
#_08A0B4: db $FC ; wait for key and new line
#_08A0B5: db $FA ; clear message box
#_08A0B6: db $50, $34, $30, $3D, $CF, $3E, $39, $30 ; わたしの⎵はなし
#_08A0BE: db $9C, $CF, $50, $2A, $58, $34, $2A, $3C ; が⎵わかったかね
#_08A0C6: db $95 ; ?
#_08A0C7: db $F8, $17 ; YES/NO - go to message 17 if YES
#_08A0C9: db $D3, $16 ; go to message 16

;===================================================================================================

; それでは きみに
; この «プログラム»も あげよう
; であった アクマの データを
; ぶんせきし きおくして
; いつでも みることができる
; >[CHASE]は
; デビル アナライズ «プログラム»を
; «てにいれた»
Message_00_07_17:
#_08A0CB: db $D4, $03 ; set text box size to 3
#_08A0CD: db $33, $4E, $A9, $3E, $CF, $2B, $44, $3A ; それでは⎵きみに
#_08A0D5: db $F9 ; new line
#_08A0D6: db $2E, $3D, $CF ; この⎵
#_08A0D9: db $F2, $08 ; prewritten text 08
#_08A0DB: db $47, $CF, $25, $9F, $4A, $27 ; も⎵あげよう
#_08A0E1: db $F9 ; new line
#_08A0E2: db $A9, $25, $58, $34, $CF, $5D, $64, $7B ; であった⎵アクマ
#_08A0EA: db $3D, $CF, $C2, $5A, $6C, $51 ; の⎵データを
#_08A0F0: db $F9 ; new line
#_08A0F1: db $AD, $52, $32, $2B, $30, $CF, $2B, $29 ; ぶんせきし⎵きお
#_08A0F9: db $2C, $30, $37 ; くして
#_08A0FC: db $F9 ; new line
#_08A0FD: db $26, $36, $A9, $47, $CF, $44, $4D, $2E ; いつでも⎵みるこ
#_08A105: db $38, $9C, $A9, $2B, $4D ; とができる
#_08A10A: db $FC ; wait for key and new line
#_08A10B: db $D4, $03 ; set text box size to 3
#_08A10D: db $97 ; >
#_08A10E: db $F0 ; write player name
#_08A10F: db $3E ; は
#_08A110: db $F9 ; new line
#_08A111: db $C2, $C5, $85, $CF, $5D, $71, $83, $5E ; デビル⎵アナライ
#_08A119: db $BC, $CF ; ズ⎵
#_08A11B: db $F2, $08 ; prewritten text 08
#_08A11D: db $51 ; を
#_08A11E: db $F9 ; new line
#_08A11F: db $F2, $2D ; prewritten text 2D
#_08A121: db $FC ; wait for key and new line
#_08A122: db $D0, $01 ; set progress bit 01
#_08A124: db $D0, $13 ; set progress bit 13
#_08A126: db $FA ; clear message box

;===================================================================================================

; なにか こまったことが あったら
; ここへ きなさい
; ねんのため ここで きろくするかね?
Message_00_07_18:
#_08A127: db $39, $3A, $2A, $CF, $2E, $43, $58, $34 ; なにか⎵こまった
#_08A12F: db $2E, $38, $9C, $CF, $25, $58, $34, $4B ; ことが⎵あったら
#_08A137: db $F9 ; new line
#_08A138: db $2E, $2E, $41, $CF, $2B, $39, $2F, $26 ; ここへ⎵きなさい
#_08A140: db $FC ; wait for key and new line
#_08A141: db $FA ; clear message box
#_08A142: db $3C, $52, $3D, $34, $46, $CF, $2E, $2E ; ねんのため⎵ここ
#_08A14A: db $A9, $CF, $2B, $4F, $2C, $31, $4D, $2A ; で⎵きろくするか
#_08A152: db $3C, $95 ; ね?
#_08A154: db $F8, $19 ; YES/NO - go to message 19 if YES
#_08A156: db $D3, $1A ; go to message 1A

;===================================================================================================

; «セーブ かんりょう しました»
; «ゲームを つづけますか?»
Message_00_07_19:
#_08A158: db $FE, $42 ; ext command 42: go to file select
#_08A15A: db $FE, $22, $1A ; ext command 22: go to message 1A if $0A58 flags failure
#_08A15D: db $FA ; clear message box
#_08A15E: db $D6, $00, $2D, $70, $28 ; place sprite 2D in slot 00 at XY:{70,28}
#_08A163: db $F2, $5A ; prewritten text 5A
#_08A165: db $FA ; clear message box
#_08A166: db $F2, $5B ; prewritten text 5B
#_08A168: db $D5, $47 ; send 47 to APU
#_08A16A: db $F8, $1A ; YES/NO - go to message 1A if YES
#_08A16C: db $FE, $1D, $24, $03 ; ext command 1D: load classy message 0324

;===================================================================================================

; さあ 2Fの «いんちょう»しつへ いきたまえ
; ドアを あけておいた
; そこで もう1つの スイッチを きれば
; そとへ でられるはずだ
Message_00_07_1A:
#_08A170: db $D6, $00, $2D, $70, $28 ; place sprite 2D in slot 00 at XY:{70,28}
#_08A175: db $D4, $03 ; set text box size to 3
#_08A177: db $2F, $25, $CF, $03, $10, $3D, $CF ; さあ⎵2Fの⎵
#_08A17E: db $F2, $8F ; prewritten text 8F
#_08A180: db $30, $36, $41, $CF, $26, $2B, $34, $43 ; しつへ⎵いきたま
#_08A188: db $28 ; え
#_08A189: db $F9 ; new line
#_08A18A: db $C3, $5D, $51, $CF, $25, $2D, $37, $29 ; ドアを⎵あけてお
#_08A192: db $26, $34 ; いた
#_08A194: db $FC ; wait for key and new line
#_08A195: db $FA ; clear message box
#_08A196: db $33, $2E, $A9, $CF, $47, $27, $02, $36 ; そこで⎵もう1つ
#_08A19E: db $3D, $CF, $69, $5E, $92, $6D, $51, $CF ; の⎵スイッチを⎵
#_08A1A6: db $2B, $4E, $AB ; きれば
#_08A1A9: db $F9 ; new line
#_08A1AA: db $33, $38, $41, $CF, $A9, $4B, $4E, $4D ; そとへ⎵でられる
#_08A1B2: db $3E, $A3, $A6 ; はずだ
#_08A1B5: db $FC ; wait for key and new line
#_08A1B6: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
Message_00_07_1B:
#_08A1B7: db $97 ; >
#_08A1B8: db $F2, $2C ; prewritten text 2C
#_08A1BA: db $FC ; wait for key and new line
#_08A1BB: db $FF ; end of message

;===================================================================================================

; >«いんちょう»しつ
; «オートロック»が かかっていて
; «とびらは あかない»
Message_00_07_1C:
#_08A1BC: db $D6, $00, $6D, $60, $28 ; place sprite 6D in slot 00 at XY:{60,28}
#_08A1C1: db $FA ; clear message box
#_08A1C2: db $97 ; >
#_08A1C3: db $F2, $8F ; prewritten text 8F
#_08A1C5: db $30, $36 ; しつ
#_08A1C7: db $F9 ; new line
#_08A1C8: db $D2, $13, $1D ; test progress bit 13 for message 1D
#_08A1CB: db $F2, $8E ; prewritten text 8E
#_08A1CD: db $9C, $CF, $2A, $2A, $58, $37, $26, $37 ; が⎵かかっていて
#_08A1D5: db $F9 ; new line
#_08A1D6: db $F2, $4B ; prewritten text 4B
#_08A1D8: db $FC ; wait for key and new line
#_08A1D9: db $FF ; end of message

;===================================================================================================

; «オートロック»は はずれている
; «なかに はいりますか?»
Message_00_07_1D:
#_08A1DA: db $F2, $8E ; prewritten text 8E
#_08A1DC: db $3E, $CF, $3E, $A3, $4E, $37, $26, $4D ; は⎵はずれている
#_08A1E4: db $FC ; wait for key and new line
#_08A1E5: db $F2, $68 ; prewritten text 68
#_08A1E7: db $F8, $1E ; YES/NO - go to message 1E if YES
#_08A1E9: db $FF ; end of message

;===================================================================================================

Message_00_07_1E:
#_08A1EA: db $D6, $00, $76, $60, $28 ; place sprite 76 in slot 00 at XY:{60,28}
#_08A1EF: db $FE, $07, $03 ; ext command 07: draw buffered text then wait 2 frames
#_08A1F2: db $D6, $00, $00 ; delete sprite in slot 00
#_08A1F5: db $FE, $1A, $1C, $00, $01, $00, $02, $03 ; ext command 1A: 1C,00,01,00,02,03

;===================================================================================================

; «いんちょう»:
; «おまえたち»は «かいぞうしゅじゅつ»を
; すませたのか?
; そうか ならば «おまえたち»は
; まだ わたしの いうことをきかぬ
; じゃあくな にんげんなのだな
Message_00_07_1F:
#_08A1FD: db $D7, $0A ; load scene 0A
#_08A1FF: db $D2, $14, $24 ; test progress bit 14 for message 24
#_08A202: db $D5, $46 ; send 46 to APU
#_08A204: db $D6, $00, $38, $70, $28 ; place sprite 38 in slot 00 at XY:{70,28}
#_08A209: db $FA ; clear message box
#_08A20A: db $F2, $8F ; prewritten text 8F
#_08A20C: db $9A ; :
#_08A20D: db $F9 ; new line
#_08A20E: db $F2, $04 ; prewritten text 04
#_08A210: db $3E, $CF ; は⎵
#_08A212: db $F2, $14 ; prewritten text 14
#_08A214: db $51 ; を
#_08A215: db $F9 ; new line
#_08A216: db $31, $43, $32, $34, $3D, $2A, $95 ; すませたのか?
#_08A21D: db $F8, $20 ; YES/NO - go to message 20 if YES
#_08A21F: db $D4, $03 ; set text box size to 3
#_08A221: db $33, $27, $2A, $CF, $39, $4B, $AB, $CF ; そうか⎵ならば⎵
#_08A229: db $F2, $04 ; prewritten text 04
#_08A22B: db $3E ; は
#_08A22C: db $F9 ; new line
#_08A22D: db $43, $A6, $CF, $50, $34, $30, $3D, $CF ; まだ⎵わたしの⎵
#_08A235: db $26, $27, $2E, $38, $51, $2B, $2A, $3B ; いうことをきかぬ
#_08A23D: db $F9 ; new line
#_08A23E: db $A2, $55, $25, $2C, $39, $CF, $3A, $52 ; じゃあくな⎵にん
#_08A246: db $9F, $52, $39, $3D, $A6, $39 ; げんなのだな
#_08A24C: db $FC ; wait for key and new line
#_08A24D: db $D3, $21 ; go to message 21

;===================================================================================================

; フフフフ うそは へただな
; «おまえたち»の こうどうは
; すべて おみとおしだ
Message_00_07_20:
#_08A24F: db $D4, $03 ; set text box size to 3
#_08A251: db $78, $78, $78, $78, $CF, $27, $33, $3E ; フフフフ⎵うそは
#_08A259: db $CF, $41, $34, $A6, $39 ; ⎵へただな
#_08A25E: db $FC ; wait for key and new line
#_08A25F: db $F2, $04 ; prewritten text 04
#_08A261: db $3D, $CF, $2E, $27, $AA, $27, $3E ; の⎵こうどうは
#_08A268: db $F9 ; new line
#_08A269: db $31, $AE, $37, $CF, $29, $44, $38, $29 ; すべて⎵おみとお
#_08A271: db $30, $A6 ; しだ
#_08A273: db $FC ; wait for key and new line

;===================================================================================================

; «おまえたち»を でくにんぎょうに
; かいぞう してやる
Message_00_07_21:
#_08A274: db $FA ; clear message box
#_08A275: db $F2, $04 ; prewritten text 04
#_08A277: db $51, $CF, $A9, $2C, $3A, $52, $9D, $57 ; を⎵でくにんぎょ
#_08A27F: db $27, $3A ; うに
#_08A281: db $F9 ; new line
#_08A282: db $2A, $26, $A5, $27, $CF, $30, $37, $48 ; かいぞう⎵してや
#_08A28A: db $4D ; る
#_08A28B: db $FC ; wait for key and new line
#_08A28C: db $FE, $46, $09 ; ext command 46: 09 TODO
#_08A28F: db $FE, $07, $06 ; ext command 07: draw buffered text then wait 5 frames
#_08A292: db $D5, $39 ; send 39 to APU
#_08A294: db $D6, $00, $9D, $78, $40 ; place sprite 9D in slot 00 at XY:{78,40}
#_08A299: db $FE, $07, $13 ; ext command 07: draw buffered text then wait 18 frames
#_08A29C: db $DE, $01, $00, $00, $01 ; load 1x demon 0100
#_08A2A1: db $E4, $00 ; load demon $00
#_08A2A3: db $E5, $01, $23 ; [COMMAND E5:01,23]

;===================================================================================================

Message_00_07_22:
#_08A2A6: db $E5, $00, $23 ; [COMMAND E5:00,23]
#_08A2A9: db $D3, $22 ; go to message 22

;===================================================================================================

; >[LEADER]は
; «オートロック»の スイッチを きった
Message_00_07_23:
#_08A2AB: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08A2AD: db $D0, $14 ; set progress bit 14
#_08A2AF: db $97 ; >
#_08A2B0: db $F1 ; write leader's name for team
#_08A2B1: db $3E ; は
#_08A2B2: db $F9 ; new line
#_08A2B3: db $F2, $8E ; prewritten text 8E
#_08A2B5: db $3D, $CF, $69, $5E, $92, $6D, $51, $CF ; の⎵スイッチを⎵
#_08A2BD: db $2B, $58, $34 ; きった
#_08A2C0: db $FC ; wait for key and new line
#_08A2C1: db $D3, $25 ; go to message 25

;===================================================================================================

; >ここで «かいぞうしゅじゅつ»が
; おこなわれて いたようだ
Message_00_07_24:
#_08A2C3: db $D4, $03 ; set text box size to 3
#_08A2C5: db $97, $2E, $2E, $A9, $CF ; >ここで⎵
#_08A2CA: db $F2, $14 ; prewritten text 14
#_08A2CC: db $9C ; が
#_08A2CD: db $F9 ; new line
#_08A2CE: db $29, $2E, $39, $50, $4E, $37, $CF, $26 ; おこなわれて⎵い
#_08A2D6: db $34, $4A, $27, $A6 ; たようだ
#_08A2DA: db $FC ; wait for key and new line

;===================================================================================================

Message_00_07_25:
#_08A2DB: db $FE, $1A, $1C, $82, $01, $00, $02, $03 ; ext command 1A: 1C,82,01,00,02,03
#_08A2E3: db $FF ; end of message

;===================================================================================================

; >«オートロック»が かかって
; «とびらは あかない»
Message_00_07_26:
#_08A2E4: db $D6, $00, $6C, $60, $28 ; place sprite 6C in slot 00 at XY:{60,28}
#_08A2E9: db $D2, $14, $27 ; test progress bit 14 for message 27
#_08A2EC: db $97 ; >
#_08A2ED: db $F2, $8E ; prewritten text 8E
#_08A2EF: db $9C, $CF, $2A, $2A, $58, $37 ; が⎵かかって
#_08A2F5: db $F9 ; new line
#_08A2F6: db $F2, $4B ; prewritten text 4B
#_08A2F8: db $FC ; wait for key and new line
#_08A2F9: db $FF ; end of message

;===================================================================================================

; >«オートロック»は はずれている
; «びょういん»の «なかに はいりますか?»
Message_00_07_27:
#_08A2FA: db $97 ; >
#_08A2FB: db $F2, $8E ; prewritten text 8E
#_08A2FD: db $3E, $CF, $3E, $A3, $4E, $37, $26, $4D ; は⎵はずれている
#_08A305: db $FC ; wait for key and new line
#_08A306: db $D2, $0C, $28 ; test progress bit 0C for message 28
#_08A309: db $FA ; clear message box
#_08A30A: db $F2, $35 ; prewritten text 35
#_08A30C: db $3D, $CF ; の⎵
#_08A30E: db $F2, $68 ; prewritten text 68
#_08A310: db $F8, $29 ; YES/NO - go to message 29 if YES
#_08A312: db $D3, $2B ; go to message 2B

;===================================================================================================

; «びょういん»の そとへ でますか?
Message_00_07_28:
#_08A314: db $F2, $35 ; prewritten text 35
#_08A316: db $3D, $CF, $33, $38, $41, $CF, $A9, $43 ; の⎵そとへ⎵でま
#_08A31E: db $31, $2A, $95 ; すか?
#_08A321: db $F8, $29 ; YES/NO - go to message 29 if YES
#_08A323: db $D3, $2A ; go to message 2A

;===================================================================================================

Message_00_07_29:
#_08A325: db $D6, $00, $75, $60, $28 ; place sprite 75 in slot 00 at XY:{60,28}
#_08A32A: db $FE, $07, $03 ; ext command 07: draw buffered text then wait 2 frames
#_08A32D: db $D6, $00, $00 ; delete sprite in slot 00
#_08A330: db $D2, $0C, $2B ; test progress bit 0C for message 2B

;===================================================================================================

Message_00_07_2A:
#_08A333: db $FE, $1A, $1C, $04, $01, $00, $02, $03 ; ext command 1A: 1C,04,01,00,02,03
#_08A33B: db $D0, $0C ; set progress bit 0C
#_08A33D: db $FF ; end of message

;===================================================================================================

Message_00_07_2B:
#_08A33E: db $FE, $1A, $1C, $86, $01, $00, $02, $03 ; ext command 1A: 1C,86,01,00,02,03
#_08A346: db $D1, $0C ; clear progress bit 0C
#_08A348: db $FF ; end of message

;===================================================================================================

; >«イノガシラ こうえん»
; けいかん:
; ただいま そうさちゅう のため
; «たちいりきんし» です
Message_00_06_00:
#_08A349: db $FE, $2A ; ext command 2A: call routine 02E87C TODO
#_08A34B: db $D2, $05, $01 ; test progress bit 05 for message 01
#_08A34E: db $D6, $00, $60, $40, $28 ; place sprite 60 in slot 00 at XY:{40,28}
#_08A353: db $D6, $01, $62, $70, $28 ; place sprite 62 in slot 01 at XY:{70,28}
#_08A358: db $D6, $02, $60, $A0, $28 ; place sprite 60 in slot 02 at XY:{A0,28}
#_08A35D: db $D6, $03, $63, $38, $48 ; place sprite 63 in slot 03 at XY:{38,48}
#_08A362: db $D6, $04, $63, $88, $48 ; place sprite 63 in slot 04 at XY:{88,48}
#_08A367: db $97 ; >
#_08A368: db $F2, $1A ; prewritten text 1A
#_08A36A: db $FC ; wait for key and new line
#_08A36B: db $FA ; clear message box
#_08A36C: db $2D, $26, $2A, $52, $9A ; けいかん:
#_08A371: db $F9 ; new line
#_08A372: db $34, $A6, $26, $43, $CF, $33, $27, $2F ; ただいま⎵そうさ
#_08A37A: db $35, $56, $27, $CF, $3D, $34, $46 ; ちゅう⎵のため
#_08A381: db $F9 ; new line
#_08A382: db $F2, $0E ; prewritten text 0E
#_08A384: db $CF, $A9, $31 ; ⎵です
#_08A387: db $FC ; wait for key and new line
#_08A388: db $FF ; end of message

;===================================================================================================

; >«イノガシラ こうえん»
; ろうじん:
; おまえが [CHASE]か
; おおいなる ちからを
; つかいこなせる かもしれんな
; ひかりと やみ ほうと こんとん
; せかいの バランスが くずれようと しておる
; いずれに かたむこうと けっかは おなじじゃ
; おまえなら どうする?
; いずれにせよ もう ひきかえすことは できぬ
; とりあえず ちからを みせてもらおうか
; [JIMMY]:
; こんどは なにが あるんでしょう?
; [HIM]:
; マジかよ ひるまから ゆめ みてるなんて
Message_00_06_01:
#_08A389: db $D5, $47 ; send 47 to APU
#_08A38B: db $D6, $00, $59, $70, $38 ; place sprite 59 in slot 00 at XY:{70,38}
#_08A390: db $FA ; clear message box
#_08A391: db $97 ; >
#_08A392: db $F2, $1A ; prewritten text 1A
#_08A394: db $FC ; wait for key and new line
#_08A395: db $FA ; clear message box
#_08A396: db $4F, $27, $A2, $52, $9A ; ろうじん:
#_08A39B: db $F9 ; new line
#_08A39C: db $29, $43, $28, $9C, $CF ; おまえが⎵
#_08A3A1: db $F0 ; write player name
#_08A3A2: db $2A ; か
#_08A3A3: db $FC ; wait for key and new line
#_08A3A4: db $E9, $00, $03 ; go to message 03 maybe TODO
#_08A3A7: db $FA ; clear message box
#_08A3A8: db $29, $29, $26, $39, $4D, $CF, $35, $2A ; おおいなる⎵ちか
#_08A3B0: db $4B, $51 ; らを
#_08A3B2: db $F9 ; new line
#_08A3B3: db $36, $2A, $26, $2E, $39, $32, $4D, $CF ; つかいこなせる⎵
#_08A3BB: db $2A, $47, $30, $4E, $52, $39 ; かもしれんな
#_08A3C1: db $FC ; wait for key and new line
#_08A3C2: db $FA ; clear message box
#_08A3C3: db $3F, $2A, $4C, $38, $CF, $48, $44, $CF ; ひかりと⎵やみ⎵
#_08A3CB: db $42, $27, $38, $CF, $2E, $52, $38, $52 ; ほうと⎵こんとん
#_08A3D3: db $F9 ; new line
#_08A3D4: db $32, $2A, $26, $3D, $CF, $C4, $83, $8A ; せかいの⎵バラン
#_08A3DC: db $69, $9C, $CF, $2C, $A3, $4E, $4A, $27 ; スが⎵くずれよう
#_08A3E4: db $38, $CF, $30, $37, $29, $4D ; と⎵しておる
#_08A3EA: db $F9 ; new line
#_08A3EB: db $26, $A3, $4E, $3A, $CF, $2A, $34, $45 ; いずれに⎵かたむ
#_08A3F3: db $2E, $27, $38, $CF, $2D, $58, $2A, $3E ; こうと⎵けっかは
#_08A3FB: db $CF, $29, $39, $A2, $A2, $55 ; ⎵おなじじゃ
#_08A401: db $F9 ; new line
#_08A402: db $29, $43, $28, $39, $4B, $CF, $AA, $27 ; おまえなら⎵どう
#_08A40A: db $31, $4D, $95 ; する?
#_08A40D: db $FC ; wait for key and new line
#_08A40E: db $FA ; clear message box
#_08A40F: db $26, $A3, $4E, $3A, $32, $4A, $CF, $47 ; いずれにせよ⎵も
#_08A417: db $27, $CF, $3F, $2B, $2A, $28, $31, $2E ; う⎵ひきかえすこ
#_08A41F: db $38, $3E, $CF, $A9, $2B, $3B ; とは⎵できぬ
#_08A425: db $F9 ; new line
#_08A426: db $38, $4C, $25, $28, $A3, $CF, $35, $2A ; とりあえず⎵ちか
#_08A42E: db $4B, $51, $CF, $44, $32, $37, $47, $4B ; らを⎵みせてもら
#_08A436: db $29, $27, $2A ; おうか
#_08A439: db $FC ; wait for key and new line
#_08A43A: db $D6, $00, $00 ; delete sprite in slot 00
#_08A43D: db $D0, $FF ; set progress bit FF
#_08A43F: db $D0, $FE ; set progress bit FE
#_08A441: db $FE, $1C, $01 ; ext command 1C: $01 TODO
#_08A444: db $FE, $25, $FF ; ext command 25: something FF TODO
#_08A447: db $FE, $23, $FF ; ext command 23: something FF TODO
#_08A44A: db $FE, $24, $FF ; ext command 24: something FF TODO
#_08A44D: db $FE, $1A, $12, $02, $00, $00, $02, $04 ; ext command 1A: 12,02,00,00,02,04
#_08A455: db $D4, $03 ; set text box size to 3
#_08A457: db $FE, $37 ; ext command 37: reload dungeon view
#_08A459: db $FE, $1C, $00 ; ext command 1C: $00 TODO
#_08A45C: db $D6, $00, $1F, $70, $28 ; place sprite 1F in slot 00 at XY:{70,28}
#_08A461: db $FE, $45, $00, $01 ; ext command 45: something 00, 01 TODO
#_08A465: db $EE ; write lawful hero name
#_08A466: db $9A ; :
#_08A467: db $F9 ; new line
#_08A468: db $2E, $52, $AA, $3E, $CF, $39, $3A, $9C ; こんどは⎵なにが
#_08A470: db $CF, $25, $4D, $52, $A9, $30, $57, $27 ; ⎵あるんでしょう
#_08A478: db $95 ; ?
#_08A479: db $FC ; wait for key and new line
#_08A47A: db $FE, $26, $02 ; ext command 26: something 02 TODO
#_08A47D: db $FA ; clear message box
#_08A47E: db $D6, $00, $00 ; delete sprite in slot 00
#_08A481: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08A484: db $D6, $00, $1F, $70, $28 ; place sprite 1F in slot 00 at XY:{70,28}
#_08A489: db $FE, $45, $00, $01 ; ext command 45: something 00, 01 TODO
#_08A48D: db $EF ; write chaos hero name
#_08A48E: db $9A ; :
#_08A48F: db $F9 ; new line
#_08A490: db $7B, $BB, $2A, $4A, $CF, $3F, $4D, $43 ; マジかよ⎵ひるま
#_08A498: db $2A, $4B, $CF, $49, $46, $CF, $44, $37 ; から⎵ゆめ⎵みて
#_08A4A0: db $4D, $39, $52, $37 ; るなんて
#_08A4A4: db $FC ; wait for key and new line
#_08A4A5: db $FE, $26, $03 ; ext command 26: something 03 TODO
#_08A4A8: db $FF ; end of message

;===================================================================================================

; ろうじん:
; どうやら いまの おまえでは むりのようじゃ
; さだめなら やつと もういちど あいまみえようぞ
; こころして かかれ«・・・»
Message_00_06_02:
#_08A4A9: db $D1, $FF ; clear progress bit FF
#_08A4AB: db $D5, $47 ; send 47 to APU
#_08A4AD: db $FE, $2A ; ext command 2A: call routine 02E87C TODO
#_08A4AF: db $FE, $1C, $00 ; ext command 1C: $00 TODO
#_08A4B2: db $D6, $00, $59, $70, $38 ; place sprite 59 in slot 00 at XY:{70,38}
#_08A4B7: db $4F, $27, $A2, $52, $9A ; ろうじん:
#_08A4BC: db $F9 ; new line
#_08A4BD: db $AA, $27, $48, $4B, $CF, $26, $43, $3D ; どうやら⎵いまの
#_08A4C5: db $CF, $29, $43, $28, $A9, $3E, $CF, $45 ; ⎵おまえでは⎵む
#_08A4CD: db $4C, $3D, $4A, $27, $A2, $55 ; りのようじゃ
#_08A4D3: db $F9 ; new line
#_08A4D4: db $2F, $A6, $46, $39, $4B, $CF, $48, $36 ; さだめなら⎵やつ
#_08A4DC: db $38, $CF, $47, $27, $26, $35, $AA, $CF ; と⎵もういちど⎵
#_08A4E4: db $25, $26, $43, $44, $28, $4A, $27, $A5 ; あいまみえようぞ
#_08A4EC: db $F9 ; new line
#_08A4ED: db $2E, $2E, $4F, $30, $37, $CF, $2A, $2A ; こころして⎵かか
#_08A4F5: db $4E ; れ
#_08A4F6: db $F2, $0B ; prewritten text 0B
#_08A4F8: db $FC ; wait for key and new line
#_08A4F9: db $D0, $06 ; set progress bit 06
#_08A4FB: db $FF ; end of message

;===================================================================================================

; ろうじん:
; ひどい じょうたいだな
; からだを なおして くるがよい
Message_00_06_03:
#_08A4FC: db $FA ; clear message box
#_08A4FD: db $4F, $27, $A2, $52, $9A ; ろうじん:
#_08A502: db $F9 ; new line
#_08A503: db $3F, $AA, $26, $CF, $A2, $57, $27, $34 ; ひどい⎵じょうた
#_08A50B: db $26, $A6, $39 ; いだな
#_08A50E: db $F9 ; new line
#_08A50F: db $2A, $4B, $A6, $51, $CF, $39, $29, $30 ; からだを⎵なおし
#_08A517: db $37, $CF, $2C, $4D, $9C, $4A, $26 ; て⎵くるがよい
#_08A51E: db $FC ; wait for key and new line
#_08A51F: db $FF ; end of message

;===================================================================================================

; >えきの いりぐちは とざされ
; はりがみには こうかいてある
; ただいま れっしゃは すべて
; うんこうていし しております
Message_00_06_04:
#_08A520: db $D7, $0E ; load scene 0E
#_08A522: db $D2, $06, $05 ; test progress bit 06 for message 05
#_08A525: db $D6, $00, $20, $40, $28 ; place sprite 20 in slot 00 at XY:{40,28}
#_08A52A: db $D6, $01, $20, $A0, $28 ; place sprite 20 in slot 01 at XY:{A0,28}
#_08A52F: db $97, $28, $2B, $3D, $CF, $26, $4C, $9E ; >えきの⎵いりぐ
#_08A537: db $35, $3E, $CF, $38, $A1, $2F, $4E ; ちは⎵とざされ
#_08A53E: db $F9 ; new line
#_08A53F: db $3E, $4C, $9C, $44, $3A, $3E, $CF, $2E ; はりがみには⎵こ
#_08A547: db $27, $2A, $26, $37, $25, $4D ; うかいてある
#_08A54D: db $FC ; wait for key and new line
#_08A54E: db $FA ; clear message box
#_08A54F: db $34, $A6, $26, $43, $CF, $4E, $58, $30 ; ただいま⎵れっし
#_08A557: db $55, $3E, $CF, $31, $AE, $37 ; ゃは⎵すべて
#_08A55D: db $F9 ; new line
#_08A55E: db $27, $52, $2E, $27, $37, $26, $30, $CF ; うんこうていし⎵
#_08A566: db $30, $37, $29, $4C, $43, $31 ; しております
#_08A56C: db $FC ; wait for key and new line
#_08A56D: db $FF ; end of message

;===================================================================================================

; へいし:
; こうつうきかんは すべて
; «かいげんしれいぶ»の とうせいかにある
; «たちいりきんし»だ!
Message_00_06_05:
#_08A56E: db $FA ; clear message box
#_08A56F: db $D6, $00, $5B, $70, $28 ; place sprite 5B in slot 00 at XY:{70,28}
#_08A574: db $D6, $01, $5A, $40, $28 ; place sprite 5A in slot 01 at XY:{40,28}
#_08A579: db $D6, $02, $5A, $A0, $28 ; place sprite 5A in slot 02 at XY:{A0,28}
#_08A57E: db $D6, $03, $5F, $38, $48 ; place sprite 5F in slot 03 at XY:{38,48}
#_08A583: db $D6, $04, $5F, $88, $48 ; place sprite 5F in slot 04 at XY:{88,48}
#_08A588: db $41, $26, $30, $9A ; へいし:
#_08A58C: db $F9 ; new line
#_08A58D: db $2E, $27, $36, $27, $2B, $2A, $52, $3E ; こうつうきかんは
#_08A595: db $CF, $31, $AE, $37 ; ⎵すべて
#_08A599: db $F9 ; new line
#_08A59A: db $F2, $0F ; prewritten text 0F
#_08A59C: db $3D, $CF, $38, $27, $32, $26, $2A, $3A ; の⎵とうせいかに
#_08A5A4: db $25, $4D ; ある
#_08A5A6: db $F9 ; new line
#_08A5A7: db $F2, $0E ; prewritten text 0E
#_08A5A9: db $A6, $94 ; だ!
#_08A5AB: db $FC ; wait for key and new line
#_08A5AC: db $FF ; end of message

;===================================================================================================

; けいかん:
; はんにん そうさくのため
; ひじょうせんを はっています
; ご«きょうりょく» ねがいます
Message_00_06_06:
#_08A5AD: db $FE, $2A ; ext command 2A: call routine 02E87C TODO
#_08A5AF: db $D2, $06, $08 ; test progress bit 06 for message 08
#_08A5B2: db $D6, $03, $63, $38, $48 ; place sprite 63 in slot 03 at XY:{38,48}
#_08A5B7: db $D6, $04, $63, $88, $48 ; place sprite 63 in slot 04 at XY:{88,48}
#_08A5BC: db $D6, $00, $60, $40, $28 ; place sprite 60 in slot 00 at XY:{40,28}
#_08A5C1: db $D6, $01, $62, $70, $28 ; place sprite 62 in slot 01 at XY:{70,28}
#_08A5C6: db $D6, $02, $60, $A0, $28 ; place sprite 60 in slot 02 at XY:{A0,28}
#_08A5CB: db $D2, $05, $07 ; test progress bit 05 for message 07
#_08A5CE: db $2D, $26, $2A, $52, $9A ; けいかん:
#_08A5D3: db $F9 ; new line
#_08A5D4: db $3E, $52, $3A, $52, $CF, $33, $27, $2F ; はんにん⎵そうさ
#_08A5DC: db $2C, $3D, $34, $46 ; くのため
#_08A5E0: db $F9 ; new line
#_08A5E1: db $3F, $A2, $57, $27, $32, $52, $51, $CF ; ひじょうせんを⎵
#_08A5E9: db $3E, $58, $37, $26, $43, $31 ; はっています
#_08A5EF: db $FC ; wait for key and new line
#_08A5F0: db $FA ; clear message box
#_08A5F1: db $A0 ; ご
#_08A5F2: db $F2, $10 ; prewritten text 10
#_08A5F4: db $CF, $3C, $9C, $26, $43, $31 ; ⎵ねがいます
#_08A5FA: db $FC ; wait for key and new line
#_08A5FB: db $FF ; end of message

;===================================================================================================

; けいかん:
; なんのようだ?
; ここは つうこうきんしだ!
Message_00_06_07:
#_08A5FC: db $FA ; clear message box
#_08A5FD: db $2D, $26, $2A, $52, $9A ; けいかん:
#_08A602: db $F9 ; new line
#_08A603: db $39, $52, $3D, $4A, $27, $A6, $95 ; なんのようだ?
#_08A60A: db $F9 ; new line
#_08A60B: db $2E, $2E, $3E, $CF, $36, $27, $2E, $27 ; ここは⎵つうこう
#_08A613: db $2B, $52, $30, $A6, $94 ; きんしだ!
#_08A618: db $FC ; wait for key and new line
#_08A619: db $FF ; end of message

;===================================================================================================

; へいし:
; «かいげんれい»が はつどうされた!
; だれも とおすわけにはいかん!
Message_00_06_08:
#_08A61A: db $D6, $00, $5B, $70, $28 ; place sprite 5B in slot 00 at XY:{70,28}
#_08A61F: db $D6, $01, $5A, $40, $28 ; place sprite 5A in slot 01 at XY:{40,28}
#_08A624: db $D6, $02, $5A, $A0, $28 ; place sprite 5A in slot 02 at XY:{A0,28}
#_08A629: db $D6, $03, $5F, $38, $48 ; place sprite 5F in slot 03 at XY:{38,48}
#_08A62E: db $D6, $04, $5F, $88, $48 ; place sprite 5F in slot 04 at XY:{88,48}
#_08A633: db $41, $26, $30, $9A ; へいし:
#_08A637: db $F9 ; new line
#_08A638: db $F2, $30 ; prewritten text 30
#_08A63A: db $9C, $CF, $3E, $36, $AA, $27, $2F, $4E ; が⎵はつどうされ
#_08A642: db $34, $94 ; た!
#_08A644: db $FC ; wait for key and new line
#_08A645: db $FA ; clear message box
#_08A646: db $A6, $4E, $47, $CF, $38, $29, $31, $50 ; だれも⎵とおすわ
#_08A64E: db $2D, $3A, $3E, $26, $2A, $52, $94 ; けにはいかん!
#_08A655: db $FC ; wait for key and new line
#_08A656: db $FF ; end of message

;===================================================================================================

; けいかん:
; ちょっと まて
; おまえ [CHASE]だな
; たいほする! それっ とりおさえろ!
Message_00_06_09:
#_08A657: db $FE, $2A ; ext command 2A: call routine 02E87C TODO
#_08A659: db $D2, $14, $0A ; test progress bit 14 for message 0A
#_08A65C: db $D6, $00, $61, $70, $28 ; place sprite 61 in slot 00 at XY:{70,28}
#_08A661: db $D6, $01, $60, $40, $28 ; place sprite 60 in slot 01 at XY:{40,28}
#_08A666: db $D6, $02, $60, $A0, $28 ; place sprite 60 in slot 02 at XY:{A0,28}
#_08A66B: db $2D, $26, $2A, $52, $9A ; けいかん:
#_08A670: db $F9 ; new line
#_08A671: db $35, $57, $58, $38, $CF, $43, $37 ; ちょっと⎵まて
#_08A678: db $F9 ; new line
#_08A679: db $29, $43, $28, $CF ; おまえ⎵
#_08A67D: db $F0 ; write player name
#_08A67E: db $A6, $39 ; だな
#_08A680: db $FC ; wait for key and new line
#_08A681: db $FA ; clear message box
#_08A682: db $34, $26, $42, $31, $4D, $94, $CF, $33 ; たいほする!⎵そ
#_08A68A: db $4E, $58, $CF, $38, $4C, $29, $2F, $28 ; れっ⎵とりおさえ
#_08A692: db $4F, $94 ; ろ!
#_08A694: db $FC ; wait for key and new line
#_08A695: db $FA ; clear message box
#_08A696: db $FE, $1C, $01 ; ext command 1C: $01 TODO
#_08A699: db $D6, $C0, $00 ; delete sprite in slot C0
#_08A69C: db $D6, $C1, $00 ; delete sprite in slot C1
#_08A69F: db $D6, $C2, $00 ; delete sprite in slot C2
#_08A6A2: db $FE, $1A, $18, $05, $01, $00, $02, $03 ; ext command 1A: 18,05,01,00,02,03
#_08A6AA: db $FE, $37 ; ext command 37: reload dungeon view
#_08A6AC: db $FE, $1D, $D6, $02 ; ext command 1D: load classy message 02D6

;===================================================================================================

; おとこ:
; ここで きょうあく さつじんはんが
; たいほ されたんだ
Message_00_06_0A:
#_08A6B0: db $D6, $00, $68, $70, $28 ; place sprite 68 in slot 00 at XY:{70,28}
#_08A6B5: db $29, $38, $2E, $9A ; おとこ:
#_08A6B9: db $F9 ; new line
#_08A6BA: db $2E, $2E, $A9, $CF, $2B, $57, $27, $25 ; ここで⎵きょうあ
#_08A6C2: db $2C, $CF, $2F, $36, $A2, $52, $3E, $52 ; く⎵さつじんはん
#_08A6CA: db $9C ; が
#_08A6CB: db $F9 ; new line
#_08A6CC: db $34, $26, $42, $CF, $2F, $4E, $34, $52 ; たいほ⎵されたん
#_08A6D4: db $A6 ; だ
#_08A6D5: db $FC ; wait for key and new line
#_08A6D6: db $FF ; end of message

;===================================================================================================

; >エコービル
; こえ:
; [ITEM]を おつかいください«・・・»
; [LEADER]は [ITEM]を つかった
Message_00_06_0B:
#_08A6D7: db $D7, $0E ; load scene 0E
#_08A6D9: db $97, $60, $66, $5A, $C5, $85 ; >エコービル
#_08A6DF: db $FC ; wait for key and new line
#_08A6E0: db $E1, $F0 ; set $0A50 to item F0
#_08A6E2: db $FA ; clear message box
#_08A6E3: db $2E, $28, $9A ; こえ:
#_08A6E6: db $F9 ; new line
#_08A6E7: db $F3 ; write item name from $0A50
#_08A6E8: db $51, $CF, $29, $36, $2A, $26, $2C, $A6 ; を⎵おつかいくだ
#_08A6F0: db $2F, $26 ; さい
#_08A6F2: db $F2, $0B ; prewritten text 0B
#_08A6F4: db $FC ; wait for key and new line
#_08A6F5: db $DD, $F0, $0C ; go to message 0C if missing item F0
#_08A6F8: db $FA ; clear message box
#_08A6F9: db $F1 ; write leader's name for team
#_08A6FA: db $3E, $CF ; は⎵
#_08A6FC: db $F3 ; write item name from $0A50
#_08A6FD: db $51, $CF, $36, $2A, $58, $34 ; を⎵つかった
#_08A703: db $FC ; wait for key and new line
#_08A704: db $FE, $1A, $12, $02, $00, $00, $02, $04 ; ext command 1A: 12,02,00,00,02,04
#_08A70C: db $FF ; end of message

;===================================================================================================

; «とびらは とざされている»
Message_00_06_0C:
#_08A70D: db $FA ; clear message box
#_08A70E: db $F2, $69 ; prewritten text 69
#_08A710: db $FC ; wait for key and new line
#_08A711: db $FF ; end of message

;===================================================================================================

; ウェイトレス:
; «いらっしゃいませ»
Message_00_06_0D:
#_08A712: db $D7, $17 ; load scene 17
#_08A714: db $D6, $01, $41, $68, $28 ; place sprite 41 in slot 01 at XY:{68,28}
#_08A719: db $5F, $8D, $5E, $70, $86, $69, $9A ; ウェイトレス:
#_08A720: db $F9 ; new line
#_08A721: db $F2, $32 ; prewritten text 32
#_08A723: db $FC ; wait for key and new line
#_08A724: db $D0, $0C ; set progress bit 0C
#_08A726: db $FF ; end of message

;===================================================================================================

; ウェイトレス:
; «ありがとうございました»
Message_00_06_0E:
#_08A727: db $D7, $17 ; load scene 17
#_08A729: db $D6, $01, $41, $68, $28 ; place sprite 41 in slot 01 at XY:{68,28}
#_08A72E: db $5F, $8D, $5E, $70, $86, $69, $9A ; ウェイトレス:
#_08A735: db $F9 ; new line
#_08A736: db $F2, $31 ; prewritten text 31
#_08A738: db $FC ; wait for key and new line
#_08A739: db $D1, $0C ; clear progress bit 0C
#_08A73B: db $FF ; end of message

;===================================================================================================

; >«びょういん»
; «とびらは とざされている»
Message_00_06_0F:
#_08A73C: db $D7, $0E ; load scene 0E
#_08A73E: db $97 ; >
#_08A73F: db $F2, $35 ; prewritten text 35
#_08A741: db $FC ; wait for key and new line
#_08A742: db $D2, $14, $10 ; test progress bit 14 for message 10
#_08A745: db $F2, $69 ; prewritten text 69
#_08A747: db $FC ; wait for key and new line
#_08A748: db $FF ; end of message

;===================================================================================================

; «なかに はいりますか?»
Message_00_06_10:
#_08A749: db $F2, $68 ; prewritten text 68
#_08A74B: db $F8, $11 ; YES/NO - go to message 11 if YES
#_08A74D: db $FF ; end of message

;===================================================================================================

Message_00_06_11:
#_08A74E: db $FE, $1B, $1B, $06, $01, $00, $02, $03 ; ext command 1B: 1B,06,01,00,02,03
#_08A756: db $FF ; end of message

;===================================================================================================

; おとこ:
; おれに なにかようか!?
; ちかよるな!
Message_00_06_12:
#_08A757: db $D2, $09, $14 ; test progress bit 09 for message 14
#_08A75A: db $D6, $00, $43, $78, $28 ; place sprite 43 in slot 00 at XY:{78,28}
#_08A75F: db $29, $38, $2E, $9A ; おとこ:
#_08A763: db $F9 ; new line
#_08A764: db $29, $4E, $3A, $CF, $39, $3A, $2A, $4A ; おれに⎵なにかよ
#_08A76C: db $27, $2A, $94, $95 ; うか!?
#_08A770: db $F9 ; new line
#_08A771: db $35, $2A, $4A, $4D, $39, $94 ; ちかよるな!
#_08A777: db $D2, $07, $13 ; test progress bit 07 for message 13
#_08A77A: db $FC ; wait for key and new line
#_08A77B: db $FF ; end of message

;===================================================================================================

;  それいじょう ちかくに きたら
; おれの ナイフで«・・・»
; うっ うえっ うえええっ ぐえええっ
; [CLASS] [DEMON1]が でた!
; [DEMON1]は とびかかってきた!
; >[DEMON1]は にげていった
; [ITEM]が おちている
; [CHASE]は [ITEM]を
; «てにいれた»
Message_00_06_13:
#_08A77C: db $CF, $33, $4E, $26, $A2, $57, $27, $CF ; ⎵それいじょう⎵
#_08A784: db $35, $2A, $2C, $3A, $CF, $2B, $34, $4B ; ちかくに⎵きたら
#_08A78C: db $F9 ; new line
#_08A78D: db $29, $4E, $3D, $CF, $71, $5E, $78, $A9 ; おれの⎵ナイフで
#_08A795: db $F2, $0B ; prewritten text 0B
#_08A797: db $FC ; wait for key and new line
#_08A798: db $FA ; clear message box
#_08A799: db $27, $58, $CF, $27, $28, $58, $CF, $27 ; うっ⎵うえっ⎵う
#_08A7A1: db $28, $28, $28, $58, $CF, $9E, $28, $28 ; えええっ⎵ぐええ
#_08A7A9: db $28, $58 ; えっ
#_08A7AB: db $FC ; wait for key and new line
#_08A7AC: db $FE, $45, $00, $01 ; ext command 45: something 00, 01 TODO
#_08A7B0: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08A7B3: db $D6, $00, $00 ; delete sprite in slot 00
#_08A7B6: db $DE, $00, $00, $E4, $01 ; load 1x demon 00E4
#_08A7BB: db $D5, $39 ; send 39 to APU
#_08A7BD: db $E4, $00 ; load demon $00
#_08A7BF: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08A7C2: db $D5, $3C ; send 3C to APU
#_08A7C4: db $D4, $02 ; set text box size to 2
#_08A7C6: db $F6 ; write class name from $0506
#_08A7C7: db $CF ; ⎵
#_08A7C8: db $F5 ; write demon name from $050A
#_08A7C9: db $9C, $CF, $A9, $34, $94 ; が⎵でた!
#_08A7CE: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08A7D1: db $F9 ; new line
#_08A7D2: db $F5 ; write demon name from $050A
#_08A7D3: db $3E, $CF, $38, $AC, $2A, $2A, $58, $37 ; は⎵とびかかって
#_08A7DB: db $2B, $34, $94 ; きた!
#_08A7DE: db $FC ; wait for key and new line
#_08A7DF: db $D5, $11 ; send 11 to APU
#_08A7E1: db $FE, $1C, $03 ; ext command 1C: $03 TODO
#_08A7E4: db $D5, $2D ; send 2D to APU
#_08A7E6: db $FE, $0B, $00, $19 ; ext command 0B: remove 25% of chase hp
#_08A7EA: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08A7EC: db $FA ; clear message box
#_08A7ED: db $97 ; >
#_08A7EE: db $F5 ; write demon name from $050A
#_08A7EF: db $3E, $CF, $3A, $9F, $37, $26, $58, $34 ; は⎵にげていった
#_08A7F7: db $FC ; wait for key and new line
#_08A7F8: db $D5, $FD ; send FD to APU
#_08A7FA: db $E1, $00 ; set $0A50 to item 00
#_08A7FC: db $FA ; clear message box
#_08A7FD: db $F3 ; write item name from $0A50
#_08A7FE: db $9C, $CF, $29, $35, $37, $26, $4D ; が⎵おちている
#_08A805: db $FC ; wait for key and new line
#_08A806: db $FA ; clear message box
#_08A807: db $F0 ; write player name
#_08A808: db $3E, $CF ; は⎵
#_08A80A: db $F3 ; write item name from $0A50
#_08A80B: db $51 ; を
#_08A80C: db $F9 ; new line
#_08A80D: db $F2, $2D ; prewritten text 2D
#_08A80F: db $FC ; wait for key and new line
#_08A810: db $FE, $28 ; ext command 28: add item to inventory from $0A50
#_08A812: db $D0, $09 ; set progress bit 09
#_08A814: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
Message_00_06_14:
#_08A815: db $D2, $05, $15 ; test progress bit 05 for message 15
#_08A818: db $97 ; >
#_08A819: db $F2, $2C ; prewritten text 2C
#_08A81B: db $FC ; wait for key and new line
#_08A81C: db $FF ; end of message

;===================================================================================================

; おとこ:
; [CHASE] へんな じじいが
; おまえを さがしてたぜ
Message_00_06_15:
#_08A81D: db $D6, $00, $69, $70, $28 ; place sprite 69 in slot 00 at XY:{70,28}
#_08A822: db $29, $38, $2E, $9A ; おとこ:
#_08A826: db $F9 ; new line
#_08A827: db $D2, $06, $16 ; test progress bit 06 for message 16
#_08A82A: db $F0 ; write player name
#_08A82B: db $CF, $41, $52, $39, $CF, $A2, $A2, $26 ; ⎵へんな⎵じじい
#_08A833: db $9C ; が
#_08A834: db $F9 ; new line
#_08A835: db $29, $43, $28, $51, $CF, $2F, $9C, $30 ; おまえを⎵さがし
#_08A83D: db $37, $34, $A4 ; てたぜ
#_08A840: db $FC ; wait for key and new line
#_08A841: db $FF ; end of message

;===================================================================================================

; へんな じじいは
; «イノガシラ こうえん»に いたのか
Message_00_06_16:
#_08A842: db $41, $52, $39, $CF, $A2, $A2, $26, $3E ; へんな⎵じじいは
#_08A84A: db $F9 ; new line
#_08A84B: db $F2, $1A ; prewritten text 1A
#_08A84D: db $3A, $CF, $26, $34, $3D, $2A ; に⎵いたのか
#_08A853: db $FC ; wait for key and new line
#_08A854: db $FF ; end of message

;===================================================================================================

Message_00_06_17:
#_08A855: db $D5, $50 ; send 50 to APU
#_08A857: db $D7, $85, $18 ; load scenes 85 and 18
#_08A85A: db $D6, $00, $3D, $70, $28 ; place sprite 3D in slot 00 at XY:{70,28}
#_08A85F: db $D2, $07, $18 ; test progress bit 07 for message 18
#_08A862: db $D3, $19 ; go to message 19

;===================================================================================================

; マスター:
; いらっしゃい [CHASE]くん
; コーヒーは いつものやつだね
; おかね? いえに とどけてやるから
; そのときに いただくよ
; いいって おとくいさん だから
Message_00_06_18:
#_08A864: db $D2, $05, $19 ; test progress bit 05 for message 19
#_08A867: db $D2, $17, $19 ; test progress bit 17 for message 19
#_08A86A: db $7B, $69, $6C, $5A, $9A ; マスター:
#_08A86F: db $F9 ; new line
#_08A870: db $26, $4B, $58, $30, $55, $26, $CF ; いらっしゃい⎵
#_08A877: db $F0 ; write player name
#_08A878: db $2C, $52 ; くん
#_08A87A: db $F9 ; new line
#_08A87B: db $66, $5A, $77, $5A, $3E, $CF, $26, $36 ; コーヒーは⎵いつ
#_08A883: db $47, $3D, $48, $36, $A6, $3C ; ものやつだね
#_08A889: db $FC ; wait for key and new line
#_08A88A: db $FA ; clear message box
#_08A88B: db $29, $2A, $3C, $95, $CF, $26, $28, $3A ; おかね?⎵いえに
#_08A893: db $CF, $38, $AA, $2D, $37, $48, $4D, $2A ; ⎵とどけてやるか
#_08A89B: db $4B ; ら
#_08A89C: db $F9 ; new line
#_08A89D: db $33, $3D, $38, $2B, $3A, $CF, $26, $34 ; そのときに⎵いた
#_08A8A5: db $A6, $2C, $4A ; だくよ
#_08A8A8: db $F9 ; new line
#_08A8A9: db $26, $26, $58, $37, $CF, $29, $38, $2C ; いいって⎵おとく
#_08A8B1: db $26, $2F, $52, $CF, $A6, $2A, $4B ; いさん⎵だから
#_08A8B8: db $FC ; wait for key and new line
#_08A8B9: db $D0, $17 ; set progress bit 17
#_08A8BB: db $FF ; end of message

;===================================================================================================

Message_00_06_19:
#_08A8BC: db $FE, $1D, $38, $80 ; ext command 1D: load classy message 8038

;===================================================================================================

; «しょうじょ»:
; [CHASE]くん
; こうえんで ころされたの
; どうきゅうせい らしいの
; わたし こわいわ
Message_00_06_1A:
#_08A8C0: db $D6, $01, $57, $48, $38 ; place sprite 57 in slot 01 at XY:{48,38}
#_08A8C5: db $D6, $02, $57, $98, $38 ; place sprite 57 in slot 02 at XY:{98,38}
#_08A8CA: db $D6, $00, $48, $78, $28 ; place sprite 48 in slot 00 at XY:{78,28}
#_08A8CF: db $F2, $00 ; prewritten text 00
#_08A8D1: db $9A ; :
#_08A8D2: db $F9 ; new line
#_08A8D3: db $D2, $05, $1B ; test progress bit 05 for message 1B
#_08A8D6: db $F0 ; write player name
#_08A8D7: db $2C, $52 ; くん
#_08A8D9: db $F9 ; new line
#_08A8DA: db $2E, $27, $28, $52, $A9, $CF, $2E, $4F ; こうえんで⎵ころ
#_08A8E2: db $2F, $4E, $34, $3D ; されたの
#_08A8E6: db $F9 ; new line
#_08A8E7: db $AA, $27, $2B, $56, $27, $32, $26, $CF ; どうきゅうせい⎵
#_08A8EF: db $4B, $30, $26, $3D ; らしいの
#_08A8F3: db $F9 ; new line
#_08A8F4: db $50, $34, $30, $CF, $2E, $50, $26, $50 ; わたし⎵こわいわ
#_08A8FC: db $FC ; wait for key and new line
#_08A8FD: db $FF ; end of message

;===================================================================================================

; オザワって ひとが [MOMO]の こと
; さがしてたわ
Message_00_06_1B:
#_08A8FE: db $61, $BA, $88, $58, $37, $CF, $3F, $38 ; オザワって⎵ひと
#_08A906: db $9C, $CF ; が⎵
#_08A908: db $ED ; write female protag name
#_08A909: db $3D, $CF, $2E, $38 ; の⎵こと
#_08A90D: db $F9 ; new line
#_08A90E: db $2F, $9C, $30, $37, $34, $50 ; さがしてたわ
#_08A914: db $FC ; wait for key and new line
#_08A915: db $FF ; end of message

;===================================================================================================

; おんな:
; えきの ナントウに «びょういん»が あるでしょ
; そこの «いんちょう»が
; さいきん おかしいって うわさよ
Message_00_06_1C:
#_08A916: db $D6, $01, $57, $48, $38 ; place sprite 57 in slot 01 at XY:{48,38}
#_08A91B: db $D6, $02, $57, $98, $38 ; place sprite 57 in slot 02 at XY:{98,38}
#_08A920: db $D6, $00, $44, $78, $28 ; place sprite 44 in slot 00 at XY:{78,28}
#_08A925: db $29, $52, $39, $9A ; おんな:
#_08A929: db $F9 ; new line
#_08A92A: db $D2, $06, $1E ; test progress bit 06 for message 1E
#_08A92D: db $D2, $05, $1D ; test progress bit 05 for message 1D
#_08A930: db $28, $2B, $3D, $CF, $71, $8A, $70, $5F ; えきの⎵ナントウ
#_08A938: db $3A, $CF ; に⎵
#_08A93A: db $F2, $35 ; prewritten text 35
#_08A93C: db $9C, $CF, $25, $4D, $A9, $30, $57 ; が⎵あるでしょ
#_08A943: db $F9 ; new line
#_08A944: db $33, $2E, $3D, $CF ; そこの⎵
#_08A948: db $F2, $8F ; prewritten text 8F
#_08A94A: db $9C ; が
#_08A94B: db $F9 ; new line
#_08A94C: db $2F, $26, $2B, $52, $CF, $29, $2A, $30 ; さいきん⎵おかし
#_08A954: db $26, $58, $37, $CF, $27, $50, $2F, $4A ; いって⎵うわさよ
#_08A95C: db $FC ; wait for key and new line
#_08A95D: db $FF ; end of message

;===================================================================================================

; «シンジュク»の ほうで なにかあったらしくて
; でんしゃは みんな とまってるのよ
; どこにも いけないわ
Message_00_06_1D:
#_08A95E: db $F2, $18 ; prewritten text 18
#_08A960: db $3D, $CF, $42, $27, $A9, $CF, $39, $3A ; の⎵ほうで⎵なに
#_08A968: db $2A, $25, $58, $34, $4B, $30, $2C, $37 ; かあったらしくて
#_08A970: db $F9 ; new line
#_08A971: db $A9, $52, $30, $55, $3E, $CF, $44, $52 ; でんしゃは⎵みん
#_08A979: db $39, $CF, $38, $43, $58, $37, $4D, $3D ; な⎵とまってるの
#_08A981: db $4A ; よ
#_08A982: db $FC ; wait for key and new line
#_08A983: db $FA ; clear message box
#_08A984: db $AA, $2E, $3A, $47, $CF, $26, $2D, $39 ; どこにも⎵いけな
#_08A98C: db $26, $50 ; いわ
#_08A98E: db $FC ; wait for key and new line
#_08A98F: db $FF ; end of message

;===================================================================================================

; けいかんに つかまったひとが
; びょういんに つれてかれるのを みたわ
; いったい どういうことかしら
Message_00_06_1E:
#_08A990: db $2D, $26, $2A, $52, $3A, $CF, $36, $2A ; けいかんに⎵つか
#_08A998: db $43, $58, $34, $3F, $38, $9C ; まったひとが
#_08A99E: db $F9 ; new line
#_08A99F: db $AC, $57, $27, $26, $52, $3A, $CF, $36 ; びょういんに⎵つ
#_08A9A7: db $4E, $37, $2A, $4E, $4D, $3D, $51, $CF ; れてかれるのを⎵
#_08A9AF: db $44, $34, $50 ; みたわ
#_08A9B2: db $FC ; wait for key and new line
#_08A9B3: db $FA ; clear message box
#_08A9B4: db $26, $58, $34, $26, $CF, $AA, $27, $26 ; いったい⎵どうい
#_08A9BC: db $27, $2E, $38, $2A, $30, $4B ; うことかしら
#_08A9C2: db $FC ; wait for key and new line
#_08A9C3: db $FF ; end of message

;===================================================================================================

; おとこ:
; DRUGストアの うらで
; ナイフもったおとこが あばれてるんだ
Message_00_06_1F:
#_08A9C4: db $D6, $01, $57, $48, $38 ; place sprite 57 in slot 01 at XY:{48,38}
#_08A9C9: db $D6, $02, $57, $98, $38 ; place sprite 57 in slot 02 at XY:{98,38}
#_08A9CE: db $D2, $0F, $22 ; test progress bit 0F for message 22
#_08A9D1: db $D6, $00, $4A, $78, $28 ; place sprite 4A in slot 00 at XY:{78,28}
#_08A9D6: db $29, $38, $2E, $9A ; おとこ:
#_08A9DA: db $F9 ; new line
#_08A9DB: db $D2, $05, $21 ; test progress bit 05 for message 21
#_08A9DE: db $D2, $09, $20 ; test progress bit 09 for message 20
#_08A9E1: db $0E, $1C, $1F, $11, $69, $70, $5D, $3D ; DRUGストアの
#_08A9E9: db $CF, $27, $4B, $A9 ; ⎵うらで
#_08A9ED: db $F9 ; new line
#_08A9EE: db $71, $5E, $78, $47, $58, $34, $29, $38 ; ナイフもったおと
#_08A9F6: db $2E, $9C, $CF, $25, $AB, $4E, $37, $4D ; こが⎵あばれてる
#_08A9FE: db $52, $A6 ; んだ
#_08AA00: db $FC ; wait for key and new line
#_08AA01: db $FF ; end of message

;===================================================================================================

; だいじょうぶか?
; うちにかえって やすんだ ほうがいい
Message_00_06_20:
#_08AA02: db $A6, $26, $A2, $57, $27, $AD, $2A, $95 ; だいじょうぶか?
#_08AA0A: db $F9 ; new line
#_08AA0B: db $27, $35, $3A, $2A, $28, $58, $37, $CF ; うちにかえって⎵
#_08AA13: db $48, $31, $52, $A6, $CF, $42, $27, $9C ; やすんだ⎵ほうが
#_08AA1B: db $26, $26 ; いい
#_08AA1D: db $FC ; wait for key and new line
#_08AA1E: db $FF ; end of message

;===================================================================================================

; サバイバルショップの となりが
; ふりょうの たまりばに なっているんだ
Message_00_06_21:
#_08AA1F: db $67, $C4, $5E, $C4, $85, $68, $91, $92 ; サバイバルショッ
#_08AA27: db $CB, $3D, $CF, $38, $39, $4C, $9C ; プの⎵となりが
#_08AA2E: db $F9 ; new line
#_08AA2F: db $40, $4C, $57, $27, $3D, $CF, $34, $43 ; ふりょうの⎵たま
#_08AA37: db $4C, $AB, $3A, $CF, $39, $58, $37, $26 ; りばに⎵なってい
#_08AA3F: db $4D, $52, $A6 ; るんだ
#_08AA42: db $FC ; wait for key and new line
#_08AA43: db $FF ; end of message

;===================================================================================================

; おとこ:
; ふりょうの たまりばに
; わかいのが つれこまれてったぜ
; ありゃ ボコボコに されちまうな
Message_00_06_22:
#_08AA44: db $D6, $00, $67, $70, $28 ; place sprite 67 in slot 00 at XY:{70,28}
#_08AA49: db $29, $38, $2E, $9A ; おとこ:
#_08AA4D: db $F9 ; new line
#_08AA4E: db $D2, $15, $23 ; test progress bit 15 for message 23
#_08AA51: db $40, $4C, $57, $27, $3D, $CF, $34, $43 ; ふりょうの⎵たま
#_08AA59: db $4C, $AB, $3A ; りばに
#_08AA5C: db $F9 ; new line
#_08AA5D: db $50, $2A, $26, $3D, $9C, $CF, $36, $4E ; わかいのが⎵つれ
#_08AA65: db $2E, $43, $4E, $37, $58, $34, $A4 ; こまれてったぜ
#_08AA6C: db $F9 ; new line
#_08AA6D: db $25, $4C, $55, $CF, $C8, $66, $C8, $66 ; ありゃ⎵ボコボコ
#_08AA75: db $3A, $CF, $2F, $4E, $35, $43, $27, $39 ; に⎵されちまうな
#_08AA7D: db $FC ; wait for key and new line
#_08AA7E: db $FF ; end of message

;===================================================================================================

; キチジョウジの そとには でられないし
; でんしゃは とまってるし
; なにが おきてるんだ?
Message_00_06_23:
#_08AA7F: db $63, $6D, $BB, $91, $5F, $BB, $3D, $CF ; キチジョウジの⎵
#_08AA87: db $33, $38, $3A, $3E, $CF, $A9, $4B, $4E ; そとには⎵でられ
#_08AA8F: db $39, $26, $30 ; ないし
#_08AA92: db $F9 ; new line
#_08AA93: db $A9, $52, $30, $55, $3E, $CF, $38, $43 ; でんしゃは⎵とま
#_08AA9B: db $58, $37, $4D, $30 ; ってるし
#_08AA9F: db $F9 ; new line
#_08AAA0: db $39, $3A, $9C, $CF, $29, $2B, $37, $4D ; なにが⎵おきてる
#_08AAA8: db $52, $A6, $95 ; んだ?
#_08AAAB: db $FC ; wait for key and new line
#_08AAAC: db $FF ; end of message

;===================================================================================================

; おんな:
; えきの ミナミの «イノガシラ こうえん»で
; さつじんじけんが おきたのしってる?
; ひどかったらしいわよ
Message_00_06_24:
#_08AAAD: db $D6, $01, $57, $48, $38 ; place sprite 57 in slot 01 at XY:{48,38}
#_08AAB2: db $D6, $02, $57, $98, $38 ; place sprite 57 in slot 02 at XY:{98,38}
#_08AAB7: db $D6, $00, $47, $78, $28 ; place sprite 47 in slot 00 at XY:{78,28}
#_08AABC: db $29, $52, $39, $9A ; おんな:
#_08AAC0: db $F9 ; new line
#_08AAC1: db $D2, $0F, $26 ; test progress bit 0F for message 26
#_08AAC4: db $D2, $06, $25 ; test progress bit 06 for message 25
#_08AAC7: db $28, $2B, $3D, $CF, $7C, $71, $7C, $3D ; えきの⎵ミナミの
#_08AACF: db $CF ; ⎵
#_08AAD0: db $F2, $1A ; prewritten text 1A
#_08AAD2: db $A9 ; で
#_08AAD3: db $F9 ; new line
#_08AAD4: db $2F, $36, $A2, $52, $A2, $2D, $52, $9C ; さつじんじけんが
#_08AADC: db $CF, $29, $2B, $34, $3D, $30, $58, $37 ; ⎵おきたのしって
#_08AAE4: db $4D, $95 ; る?
#_08AAE6: db $F9 ; new line
#_08AAE7: db $3F, $AA, $2A, $58, $34, $4B, $30, $26 ; ひどかったらしい
#_08AAEF: db $50, $4A ; わよ
#_08AAF1: db $FC ; wait for key and new line
#_08AAF2: db $FF ; end of message

;===================================================================================================

; やっと こうえんの ふうさが とけたわ
Message_00_06_25:
#_08AAF3: db $48, $58, $38, $CF, $2E, $27, $28, $52 ; やっと⎵こうえん
#_08AAFB: db $3D, $CF, $40, $27, $2F, $9C, $CF, $38 ; の⎵ふうさが⎵と
#_08AB03: db $2D, $34, $50 ; けたわ
#_08AB06: db $FC ; wait for key and new line
#_08AB07: db $FF ; end of message

;===================================================================================================

; こうえんの もりのなかに
; へんな たてものが たってたわ
Message_00_06_26:
#_08AB08: db $2E, $27, $28, $52, $3D, $CF, $47, $4C ; こうえんの⎵もり
#_08AB10: db $3D, $39, $2A, $3A ; のなかに
#_08AB14: db $F9 ; new line
#_08AB15: db $41, $52, $39, $CF, $34, $37, $47, $3D ; へんな⎵たてもの
#_08AB1D: db $9C, $CF, $34, $58, $37, $34, $50 ; が⎵たってたわ
#_08AB24: db $FC ; wait for key and new line
#_08AB25: db $FF ; end of message

;===================================================================================================

; ゆりこ:
; また あったわね [CHASE]
; こんなとこで あえるなんて ゆめみたいね
; «ウフフフフ»
Message_00_06_27:
#_08AB26: db $D6, $01, $57, $48, $38 ; place sprite 57 in slot 01 at XY:{48,38}
#_08AB2B: db $D6, $02, $57, $98, $38 ; place sprite 57 in slot 02 at XY:{98,38}
#_08AB30: db $D2, $05, $29 ; test progress bit 05 for message 29
#_08AB33: db $D2, $21, $28 ; test progress bit 21 for message 28
#_08AB36: db $D6, $00, $2C, $70, $28 ; place sprite 2C in slot 00 at XY:{70,28}
#_08AB3B: db $49, $4C, $2E, $9A ; ゆりこ:
#_08AB3F: db $F9 ; new line
#_08AB40: db $43, $34, $CF, $25, $58, $34, $50, $3C ; また⎵あったわね
#_08AB48: db $CF ; ⎵
#_08AB49: db $F0 ; write player name
#_08AB4A: db $F9 ; new line
#_08AB4B: db $2E, $52, $39, $38, $2E, $A9, $CF, $25 ; こんなとこで⎵あ
#_08AB53: db $28, $4D, $39, $52, $37, $CF, $49, $46 ; えるなんて⎵ゆめ
#_08AB5B: db $44, $34, $26, $3C ; みたいね
#_08AB5F: db $F9 ; new line
#_08AB60: db $F2, $1D ; prewritten text 1D
#_08AB62: db $FC ; wait for key and new line
#_08AB63: db $D0, $21 ; set progress bit 21
#_08AB65: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
Message_00_06_28:
#_08AB66: db $D2, $05, $29 ; test progress bit 05 for message 29
#_08AB69: db $97 ; >
#_08AB6A: db $F2, $2C ; prewritten text 2C
#_08AB6C: db $FC ; wait for key and new line
#_08AB6D: db $FF ; end of message

;===================================================================================================

; おとこ:
; えきの ミナミぐちの エコービルは
; なんで つかわれて ないんだろう
; あんな いいばしょ なのに
Message_00_06_29:
#_08AB6E: db $D6, $00, $69, $70, $28 ; place sprite 69 in slot 00 at XY:{70,28}
#_08AB73: db $29, $38, $2E, $9A ; おとこ:
#_08AB77: db $F9 ; new line
#_08AB78: db $28, $2B, $3D, $CF, $7C, $71, $7C, $9E ; えきの⎵ミナミぐ
#_08AB80: db $35, $3D, $CF, $60, $66, $5A, $C5, $85 ; ちの⎵エコービル
#_08AB88: db $3E ; は
#_08AB89: db $F9 ; new line
#_08AB8A: db $39, $52, $A9, $CF, $36, $2A, $50, $4E ; なんで⎵つかわれ
#_08AB92: db $37, $CF, $39, $26, $52, $A6, $4F, $27 ; て⎵ないんだろう
#_08AB9A: db $F9 ; new line
#_08AB9B: db $25, $52, $39, $CF, $26, $26, $AB, $30 ; あんな⎵いいばし
#_08ABA3: db $57, $CF, $39, $3D, $3A ; ょ⎵なのに
#_08ABA8: db $FC ; wait for key and new line
#_08ABA9: db $FF ; end of message

;===================================================================================================

; おとこ:
; ちくしょう こっとうやの おやじめ
; オレには うってくれねえんだ
; しってるか? ほんとうは あそこで
; なにを うってるか
Message_00_06_2A:
#_08ABAA: db $D6, $00, $29, $70, $28 ; place sprite 29 in slot 00 at XY:{70,28}
#_08ABAF: db $29, $38, $2E, $9A ; おとこ:
#_08ABB3: db $F9 ; new line
#_08ABB4: db $35, $2C, $30, $57, $27, $CF, $2E, $58 ; ちくしょう⎵こっ
#_08ABBC: db $38, $27, $48, $3D, $CF, $29, $48, $A2 ; とうやの⎵おやじ
#_08ABC4: db $46 ; め
#_08ABC5: db $F9 ; new line
#_08ABC6: db $61, $86, $3A, $3E, $CF, $27, $58, $37 ; オレには⎵うって
#_08ABCE: db $2C, $4E, $3C, $28, $52, $A6 ; くれねえんだ
#_08ABD4: db $FC ; wait for key and new line
#_08ABD5: db $FA ; clear message box
#_08ABD6: db $30, $58, $37, $4D, $2A, $95, $CF, $42 ; しってるか?⎵ほ
#_08ABDE: db $52, $38, $27, $3E, $CF, $25, $33, $2E ; んとうは⎵あそこ
#_08ABE6: db $A9 ; で
#_08ABE7: db $F9 ; new line
#_08ABE8: db $39, $3A, $51, $CF, $27, $58, $37, $4D ; なにを⎵うってる
#_08ABF0: db $2A ; か
#_08ABF1: db $FC ; wait for key and new line
#_08ABF2: db $FF ; end of message

;===================================================================================================

; おとこ:
; DDSーNETで
; «アクマしょうかん»«プログラム»を «てにいれた»よ
; でも きみわるくて すぐ けしちゃったよ
; さいきん いつのまにか
; ファイルが とどいてるんだよな
; いえの «コンピュータ»しらべてみたかい?
Message_00_06_2B:
#_08ABF3: db $D6, $00, $6A, $70, $28 ; place sprite 6A in slot 00 at XY:{70,28}
#_08ABF8: db $29, $38, $2E, $9A ; おとこ:
#_08ABFC: db $F9 ; new line
#_08ABFD: db $0E, $0E, $1D, $5A, $18, $0F, $1E, $A9 ; DDSーNETで
#_08AC05: db $F9 ; new line
#_08AC06: db $F2, $13 ; prewritten text 13
#_08AC08: db $F2, $08 ; prewritten text 08
#_08AC0A: db $51, $CF ; を⎵
#_08AC0C: db $F2, $2D ; prewritten text 2D
#_08AC0E: db $4A ; よ
#_08AC0F: db $FC ; wait for key and new line
#_08AC10: db $FA ; clear message box
#_08AC11: db $A9, $47, $CF, $2B, $44, $50, $4D, $2C ; でも⎵きみわるく
#_08AC19: db $37, $CF, $31, $9E, $CF, $2D, $30, $35 ; て⎵すぐ⎵けしち
#_08AC21: db $55, $58, $34, $4A ; ゃったよ
#_08AC25: db $F9 ; new line
#_08AC26: db $2F, $26, $2B, $52, $CF, $26, $36, $3D ; さいきん⎵いつの
#_08AC2E: db $43, $3A, $2A ; まにか
#_08AC31: db $F9 ; new line
#_08AC32: db $78, $8B, $5E, $85, $9C, $CF, $38, $AA ; ファイルが⎵とど
#_08AC3A: db $26, $37, $4D, $52, $A6, $4A, $39 ; いてるんだよな
#_08AC41: db $F9 ; new line
#_08AC42: db $26, $28, $3D, $CF ; いえの⎵
#_08AC46: db $F2, $09 ; prewritten text 09
#_08AC48: db $30, $4B, $AE, $37, $44, $34, $2A, $26 ; しらべてみたかい
#_08AC50: db $95 ; ?
#_08AC51: db $FC ; wait for key and new line
#_08AC52: db $FF ; end of message

;===================================================================================================

; «ははのこえ:»
; «[CHASE] いつまで ねてるの?»
; «やすみだからって ねぼうは ダメよ»
; «はやく おきてらっしゃい»
; >«コンピュータ»が
; つうしんファイルを うけとったようだ
; DDSーNET
; «DATE:199Xー10ーX»X
; «NAME:STEVEN»
; このNETに せつぞくしている
; すべてのひと へ
; げんざい «われわれ» ニンゲンに
; しんこくな ききが せまっている
; でんせつの アクマたちが
; やみから めざめたのだ
; すぐにも アクマが おそってくるだろう
; アクマと たたかうために
; アクマの ちからを りようすることだ
; この «プログラム»が あれば できるだろう
; ゆうきあるものが
; うけとって くれることを いのる«・・・»
; アクマと たたかい ひとびとを すくうために
; «>ダウンロードします»
; «アクマしょうかん»«プログラム»を «てにいれた»
Message_00_08_00:
#_08AC53: db $D1, $FE ; clear progress bit FE
#_08AC55: db $D0, $04 ; set progress bit 04
#_08AC57: db $D7, $07 ; load scene 07
#_08AC59: db $FE, $25, $FF ; ext command 25: something FF TODO
#_08AC5C: db $FE, $23, $FF ; ext command 23: something FF TODO
#_08AC5F: db $FE, $24, $FF ; ext command 24: something FF TODO
#_08AC62: db $FE, $1C, $00 ; ext command 1C: $00 TODO
#_08AC65: db $D2, $18, $03 ; test progress bit 18 for message 03
#_08AC68: db $F2, $82 ; prewritten text 82
#_08AC6A: db $D2, $00, $03 ; test progress bit 00 for message 03
#_08AC6D: db $FA ; clear message box
#_08AC6E: db $97 ; >
#_08AC6F: db $F2, $09 ; prewritten text 09
#_08AC71: db $9C ; が
#_08AC72: db $F9 ; new line
#_08AC73: db $36, $27, $30, $52, $78, $8B, $5E, $85 ; つうしんファイル
#_08AC7B: db $51, $CF, $27, $2D, $38, $58, $34, $4A ; を⎵うけとったよ
#_08AC83: db $27, $A6 ; うだ
#_08AC85: db $FC ; wait for key and new line
#_08AC86: db $FA ; clear message box
#_08AC87: db $0E, $0E, $1D, $5A, $18, $0F, $1E ; DDSーNET
#_08AC8E: db $F9 ; new line
#_08AC8F: db $D2, $02, $01 ; test progress bit 02 for message 01
#_08AC92: db $F2, $57 ; prewritten text 57
#_08AC94: db $22 ; X
#_08AC95: db $F9 ; new line
#_08AC96: db $F2, $58 ; prewritten text 58
#_08AC98: db $F9 ; new line
#_08AC99: db $2E, $3D, $18, $0F, $1E, $3A, $CF, $32 ; このNETに⎵せ
#_08ACA1: db $36, $A5, $2C, $30, $37, $26, $4D ; つぞくしている
#_08ACA8: db $F9 ; new line
#_08ACA9: db $31, $AE, $37, $3D, $3F, $38, $CF, $41 ; すべてのひと⎵へ
#_08ACB1: db $FC ; wait for key and new line
#_08ACB2: db $FA ; clear message box
#_08ACB3: db $9F, $52, $A1, $26, $CF ; げんざい⎵
#_08ACB8: db $F2, $02 ; prewritten text 02
#_08ACBA: db $CF, $72, $8A, $B8, $8A, $3A ; ⎵ニンゲンに
#_08ACC0: db $F9 ; new line
#_08ACC1: db $30, $52, $2E, $2C, $39, $CF, $2B, $2B ; しんこくな⎵きき
#_08ACC9: db $9C, $CF, $32, $43, $58, $37, $26, $4D ; が⎵せまっている
#_08ACD1: db $F9 ; new line
#_08ACD2: db $A9, $52, $32, $36, $3D, $CF, $5D, $64 ; でんせつの⎵アク
#_08ACDA: db $7B, $34, $35, $9C ; マたちが
#_08ACDE: db $F9 ; new line
#_08ACDF: db $48, $44, $2A, $4B, $CF, $46, $A1, $46 ; やみから⎵めざめ
#_08ACE7: db $34, $3D, $A6 ; たのだ
#_08ACEA: db $F9 ; new line
#_08ACEB: db $31, $9E, $3A, $47, $CF, $5D, $64, $7B ; すぐにも⎵アクマ
#_08ACF3: db $9C, $CF, $29, $33, $58, $37, $2C, $4D ; が⎵おそってくる
#_08ACFB: db $A6, $4F, $27 ; だろう
#_08ACFE: db $FC ; wait for key and new line
#_08ACFF: db $FA ; clear message box
#_08AD00: db $5D, $64, $7B, $38, $CF, $34, $34, $2A ; アクマと⎵たたか
#_08AD08: db $27, $34, $46, $3A ; うために
#_08AD0C: db $F9 ; new line
#_08AD0D: db $5D, $64, $7B, $3D, $CF, $35, $2A, $4B ; アクマの⎵ちから
#_08AD15: db $51, $CF, $4C, $4A, $27, $31, $4D, $2E ; を⎵りようするこ
#_08AD1D: db $38, $A6 ; とだ
#_08AD1F: db $F9 ; new line
#_08AD20: db $2E, $3D, $CF ; この⎵
#_08AD23: db $F2, $08 ; prewritten text 08
#_08AD25: db $9C, $CF, $25, $4E, $AB, $CF, $A9, $2B ; が⎵あれば⎵でき
#_08AD2D: db $4D, $A6, $4F, $27 ; るだろう
#_08AD31: db $FC ; wait for key and new line
#_08AD32: db $FA ; clear message box
#_08AD33: db $49, $27, $2B, $25, $4D, $47, $3D, $9C ; ゆうきあるものが
#_08AD3B: db $F9 ; new line
#_08AD3C: db $27, $2D, $38, $58, $37, $CF, $2C, $4E ; うけとって⎵くれ
#_08AD44: db $4D, $2E, $38, $51, $CF, $26, $3D, $4D ; ることを⎵いのる
#_08AD4C: db $F2, $0B ; prewritten text 0B
#_08AD4E: db $F9 ; new line
#_08AD4F: db $5D, $64, $7B, $38, $CF, $34, $34, $2A ; アクマと⎵たたか
#_08AD57: db $26, $CF, $3F, $38, $AC, $38, $51, $CF ; い⎵ひとびとを⎵
#_08AD5F: db $31, $2C, $27, $34, $46, $3A ; すくうために
#_08AD65: db $FC ; wait for key and new line
#_08AD66: db $D4, $03 ; set text box size to 3
#_08AD68: db $F2, $25 ; prewritten text 25
#_08AD6A: db $F9 ; new line
#_08AD6B: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08AD6E: db $F2, $13 ; prewritten text 13
#_08AD70: db $F2, $08 ; prewritten text 08
#_08AD72: db $51, $CF ; を⎵
#_08AD74: db $F2, $2D ; prewritten text 2D
#_08AD76: db $FC ; wait for key and new line
#_08AD77: db $D0, $02 ; set progress bit 02
#_08AD79: db $D3, $02 ; go to message 02

;===================================================================================================

; «DATE:199Xー10ーX»Y
; «NAME:STEVEN»
; «オートマッピング»«プログラム»が
; かんせいしたので おくろう
; «>ダウンロードします»
; «オートマッピング»«プログラム»を «てにいれた»
Message_00_08_01:
#_08AD7B: db $F2, $57 ; prewritten text 57
#_08AD7D: db $23 ; Y
#_08AD7E: db $F9 ; new line
#_08AD7F: db $F2, $58 ; prewritten text 58
#_08AD81: db $F9 ; new line
#_08AD82: db $F2, $59 ; prewritten text 59
#_08AD84: db $F2, $08 ; prewritten text 08
#_08AD86: db $9C ; が
#_08AD87: db $F9 ; new line
#_08AD88: db $2A, $52, $32, $26, $30, $34, $3D, $A9 ; かんせいしたので
#_08AD90: db $CF, $29, $2C, $4F, $27 ; ⎵おくろう
#_08AD95: db $FC ; wait for key and new line
#_08AD96: db $D4, $03 ; set text box size to 3
#_08AD98: db $F2, $25 ; prewritten text 25
#_08AD9A: db $F9 ; new line
#_08AD9B: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08AD9E: db $F2, $59 ; prewritten text 59
#_08ADA0: db $F2, $08 ; prewritten text 08
#_08ADA2: db $51, $CF ; を⎵
#_08ADA4: db $F2, $2D ; prewritten text 2D
#_08ADA6: db $FC ; wait for key and new line
#_08ADA7: db $D0, $00 ; set progress bit 00

;===================================================================================================

; >つうしんが きれた
; ははのこえ:
; [CHASE] いつまで ねてるの!
Message_00_08_02:
#_08ADA9: db $D4, $03 ; set text box size to 3
#_08ADAB: db $97, $36, $27, $30, $52, $9C, $CF, $2B ; >つうしんが⎵き
#_08ADB3: db $4E, $34 ; れた
#_08ADB5: db $FC ; wait for key and new line
#_08ADB6: db $FA ; clear message box
#_08ADB7: db $3E, $3E, $3D, $2E, $28, $9A ; ははのこえ:
#_08ADBD: db $F9 ; new line
#_08ADBE: db $F0 ; write player name
#_08ADBF: db $CF, $26, $36, $43, $A9, $CF, $3C, $37 ; ⎵いつまで⎵ねて
#_08ADC7: db $4D, $3D, $94 ; るの!
#_08ADCA: db $FC ; wait for key and new line

;===================================================================================================

Message_00_08_03:
#_08ADCB: db $D5, $53 ; send 53 to APU
#_08ADCD: db $D1, $03 ; clear progress bit 03

;===================================================================================================

; «>なにを しますか?»
Message_00_08_04:
#_08ADCF: db $FA ; clear message box
#_08ADD0: db $F2, $2E ; prewritten text 2E
#_08ADD2: db $D8, $03 ; option list with 4 options
#_08ADD4: db $0A, $07 ; option 1 [0A]: go to message 07
#_08ADD6: db $05, $05 ; option 2 [05]: go to message 05
#_08ADD8: db $0D, $0B ; option 3 [0D]: go to message 0B
#_08ADDA: db $0B, $12 ; option 4 [0B]: go to message 12
#_08ADDC: db $D3, $12 ; go to message 12

;===================================================================================================

; «セーブ かんりょう しました»
; «ゲームを つづけますか?»
Message_00_08_05:
#_08ADDE: db $FE, $42 ; ext command 42: go to file select
#_08ADE0: db $FE, $22, $03 ; ext command 22: go to message 03 if $0A58 flags failure
#_08ADE3: db $F2, $5A ; prewritten text 5A
#_08ADE5: db $FA ; clear message box
#_08ADE6: db $F2, $5B ; prewritten text 5B
#_08ADE8: db $F8, $03 ; YES/NO - go to message 03 if YES

;===================================================================================================

Message_00_08_06:
#_08ADEA: db $D5, $FD ; send FD to APU
#_08ADEC: db $FE, $1D, $24, $03 ; ext command 1D: load classy message 0324

;===================================================================================================

; >«コンピュータ»つうしんを おこないます
; DDSーNET
; アクセスします«・・・»
; «DATE:199Xー10ーX»X
; «NAME:STEVEN»
; «アクマしょうかん»«プログラム»を
; うけとったひと へ
; つぎの «プログラム»は まだ できてない
; もうすこし まってくれ
; «アクマしょうかん»«プログラム»・«マニュアル»を
; おくるので つかいかたを おぼえておいてくれ
; «>ダウンロードします»
; «アクマしょうかん»«プログラム»・«マニュアル»:
; この«プログラム»は
;  ・アクマと かいわして ナカマに すること
;  ・ナカマにした アクマを よびだすこと
;  が できます
; つかいかた
; 1 アクマと そうぐうしたら
;  ーTALKーを えらんでください
; 2 つぎに かいわの たいどを えらびます
;  ・ゆうこうてき
;  ・いあつてき
;  の いずれかです
; アクマにたいする はんのうは
; 2つの コマンドで しめされ«・・・»
Message_00_08_07:
#_08ADF0: db $D4, $03 ; set text box size to 3
#_08ADF2: db $97 ; >
#_08ADF3: db $F2, $09 ; prewritten text 09
#_08ADF5: db $36, $27, $30, $52, $51, $CF, $29, $2E ; つうしんを⎵おこ
#_08ADFD: db $39, $26, $43, $31 ; ないます
#_08AE01: db $FC ; wait for key and new line
#_08AE02: db $FA ; clear message box
#_08AE03: db $0E, $0E, $1D, $5A, $18, $0F, $1E ; DDSーNET
#_08AE0A: db $FE, $07, $30 ; ext command 07: draw buffered text then wait 47 frames
#_08AE0D: db $F9 ; new line
#_08AE0E: db $5D, $64, $6A, $69, $30, $43, $31 ; アクセスします
#_08AE15: db $F2, $0B ; prewritten text 0B
#_08AE17: db $FC ; wait for key and new line
#_08AE18: db $D2, $06, $09 ; test progress bit 06 for message 09
#_08AE1B: db $D2, $00, $08 ; test progress bit 00 for message 08
#_08AE1E: db $F2, $57 ; prewritten text 57
#_08AE20: db $22 ; X
#_08AE21: db $F9 ; new line
#_08AE22: db $F2, $58 ; prewritten text 58
#_08AE24: db $F9 ; new line
#_08AE25: db $F2, $13 ; prewritten text 13
#_08AE27: db $F2, $08 ; prewritten text 08
#_08AE29: db $51 ; を
#_08AE2A: db $F9 ; new line
#_08AE2B: db $27, $2D, $38, $58, $34, $3F, $38, $CF ; うけとったひと⎵
#_08AE33: db $41 ; へ
#_08AE34: db $FC ; wait for key and new line
#_08AE35: db $FA ; clear message box
#_08AE36: db $36, $9D, $3D, $CF ; つぎの⎵
#_08AE3A: db $F2, $08 ; prewritten text 08
#_08AE3C: db $3E, $CF, $43, $A6, $CF, $A9, $2B, $37 ; は⎵まだ⎵できて
#_08AE44: db $39, $26 ; ない
#_08AE46: db $F9 ; new line
#_08AE47: db $47, $27, $31, $2E, $30, $CF, $43, $58 ; もうすこし⎵まっ
#_08AE4F: db $37, $2C, $4E ; てくれ
#_08AE52: db $F9 ; new line
#_08AE53: db $F2, $13 ; prewritten text 13
#_08AE55: db $F2, $08 ; prewritten text 08
#_08AE57: db $93 ; ・
#_08AE58: db $F2, $86 ; prewritten text 86
#_08AE5A: db $51 ; を
#_08AE5B: db $F9 ; new line
#_08AE5C: db $29, $2C, $4D, $3D, $A9, $CF, $36, $2A ; おくるので⎵つか
#_08AE64: db $26, $2A, $34, $51, $CF, $29, $AF, $28 ; いかたを⎵おぼえ
#_08AE6C: db $37, $29, $26, $37, $2C, $4E ; ておいてくれ
#_08AE72: db $FC ; wait for key and new line
#_08AE73: db $FA ; clear message box
#_08AE74: db $F2, $25 ; prewritten text 25
#_08AE76: db $F9 ; new line
#_08AE77: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08AE7A: db $F2, $13 ; prewritten text 13
#_08AE7C: db $F2, $08 ; prewritten text 08
#_08AE7E: db $93 ; ・
#_08AE7F: db $F2, $86 ; prewritten text 86
#_08AE81: db $9A ; :
#_08AE82: db $F9 ; new line
#_08AE83: db $2E, $3D ; この
#_08AE85: db $F2, $08 ; prewritten text 08
#_08AE87: db $3E ; は
#_08AE88: db $F9 ; new line
#_08AE89: db $CF, $93, $5D, $64, $7B, $38, $CF, $2A ; ⎵・アクマと⎵か
#_08AE91: db $26, $50, $30, $37, $CF, $71, $62, $7B ; いわして⎵ナカマ
#_08AE99: db $3A, $CF, $31, $4D, $2E, $38 ; に⎵すること
#_08AE9F: db $F9 ; new line
#_08AEA0: db $CF, $93, $71, $62, $7B, $3A, $30, $34 ; ⎵・ナカマにした
#_08AEA8: db $CF, $5D, $64, $7B, $51, $CF, $4A, $AC ; ⎵アクマを⎵よび
#_08AEB0: db $A6, $31, $2E, $38 ; だすこと
#_08AEB4: db $F9 ; new line
#_08AEB5: db $CF, $9C, $CF, $A9, $2B, $43, $31 ; ⎵が⎵できます
#_08AEBC: db $FC ; wait for key and new line
#_08AEBD: db $FA ; clear message box
#_08AEBE: db $36, $2A, $26, $2A, $34 ; つかいかた
#_08AEC3: db $F9 ; new line
#_08AEC4: db $02, $CF, $5D, $64, $7B, $38, $CF, $33 ; 1⎵アクマと⎵そ
#_08AECC: db $27, $9E, $27, $30, $34, $4B ; うぐうしたら
#_08AED2: db $F9 ; new line
#_08AED3: db $CF, $5A, $1E, $0B, $16, $15, $5A, $51 ; ⎵ーTALKーを
#_08AEDB: db $CF, $28, $4B, $52, $A9, $2C, $A6, $2F ; ⎵えらんでくださ
#_08AEE3: db $26 ; い
#_08AEE4: db $F9 ; new line
#_08AEE5: db $03, $CF, $36, $9D, $3A, $CF, $2A, $26 ; 2⎵つぎに⎵かい
#_08AEED: db $50, $3D, $CF, $34, $26, $AA, $51, $CF ; わの⎵たいどを⎵
#_08AEF5: db $28, $4B, $AC, $43, $31 ; えらびます
#_08AEFA: db $F9 ; new line
#_08AEFB: db $CF, $93, $49, $27, $2E, $27, $37, $2B ; ⎵・ゆうこうてき
#_08AF03: db $F9 ; new line
#_08AF04: db $CF, $93, $26, $25, $36, $37, $2B ; ⎵・いあつてき
#_08AF0B: db $F9 ; new line
#_08AF0C: db $CF, $3D, $CF, $26, $A3, $4E, $2A, $A9 ; ⎵の⎵いずれかで
#_08AF14: db $31 ; す
#_08AF15: db $FC ; wait for key and new line
#_08AF16: db $FA ; clear message box
#_08AF17: db $5D, $64, $7B, $3A, $34, $26, $31, $4D ; アクマにたいする
#_08AF1F: db $CF, $3E, $52, $3D, $27, $3E ; ⎵はんのうは
#_08AF25: db $F9 ; new line
#_08AF26: db $03, $36, $3D, $CF, $66, $7B, $8A, $C3 ; 2つの⎵コマンド
#_08AF2E: db $A9, $CF, $30, $46, $2F, $4E ; で⎵しめされ
#_08AF34: db $F2, $0B ; prewritten text 0B
#_08AF36: db $FC ; wait for key and new line
#_08AF37: db $D3, $0A ; go to message 0A

;===================================================================================================

; «DATE:199Xー10ーX»Y
; «NAME:STEVEN»
; «オートマッピング»«プログラム»を
; うけとったひと へ
; «オートマッピング»・«マニュアル»を
; おくる うけとってくれ
; «>ダウンロードします»
; «オートマッピング»・«マニュアル»:
; この«プログラム»は
; じぶんの あるいた ばしょを きおくして
; がめんに ひょうじします
; がめんの マークのいみは いかの とおりです
;  ・キイロ げんざいいち
;  ・アカ  でいりぐち
;  ・U   のぼりかいだん
;  ・D   くだりかいだん
;  ・E   エレベーター
; なお あるいていないばしょは ひょうじ«・・・»
Message_00_08_08:
#_08AF39: db $F2, $57 ; prewritten text 57
#_08AF3B: db $23 ; Y
#_08AF3C: db $F9 ; new line
#_08AF3D: db $F2, $58 ; prewritten text 58
#_08AF3F: db $F9 ; new line
#_08AF40: db $F2, $59 ; prewritten text 59
#_08AF42: db $F2, $08 ; prewritten text 08
#_08AF44: db $51 ; を
#_08AF45: db $F9 ; new line
#_08AF46: db $27, $2D, $38, $58, $34, $3F, $38, $CF ; うけとったひと⎵
#_08AF4E: db $41 ; へ
#_08AF4F: db $FC ; wait for key and new line
#_08AF50: db $FA ; clear message box
#_08AF51: db $F2, $59 ; prewritten text 59
#_08AF53: db $93 ; ・
#_08AF54: db $F2, $86 ; prewritten text 86
#_08AF56: db $51 ; を
#_08AF57: db $F9 ; new line
#_08AF58: db $29, $2C, $4D, $CF, $27, $2D, $38, $58 ; おくる⎵うけとっ
#_08AF60: db $37, $2C, $4E ; てくれ
#_08AF63: db $FC ; wait for key and new line
#_08AF64: db $FA ; clear message box
#_08AF65: db $F2, $25 ; prewritten text 25
#_08AF67: db $F9 ; new line
#_08AF68: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08AF6B: db $F2, $59 ; prewritten text 59
#_08AF6D: db $93 ; ・
#_08AF6E: db $F2, $86 ; prewritten text 86
#_08AF70: db $9A ; :
#_08AF71: db $F9 ; new line
#_08AF72: db $2E, $3D ; この
#_08AF74: db $F2, $08 ; prewritten text 08
#_08AF76: db $3E ; は
#_08AF77: db $F9 ; new line
#_08AF78: db $A2, $AD, $52, $3D, $CF, $25, $4D, $26 ; じぶんの⎵あるい
#_08AF80: db $34, $CF, $AB, $30, $57, $51, $CF, $2B ; た⎵ばしょを⎵き
#_08AF88: db $29, $2C, $30, $37 ; おくして
#_08AF8C: db $F9 ; new line
#_08AF8D: db $9C, $46, $52, $3A, $CF, $3F, $57, $27 ; がめんに⎵ひょう
#_08AF95: db $A2, $30, $43, $31 ; じします
#_08AF99: db $FC ; wait for key and new line
#_08AF9A: db $FA ; clear message box
#_08AF9B: db $9C, $46, $52, $3D, $CF, $7B, $5A, $64 ; がめんの⎵マーク
#_08AFA3: db $3D, $26, $44, $3E, $CF, $26, $2A, $3D ; のいみは⎵いかの
#_08AFAB: db $CF, $38, $29, $4C, $A9, $31 ; ⎵とおりです
#_08AFB1: db $F9 ; new line
#_08AFB2: db $CF, $93, $63, $5E, $87, $CF, $9F, $52 ; ⎵・キイロ⎵げん
#_08AFBA: db $A1, $26, $26, $35 ; ざいいち
#_08AFBE: db $F9 ; new line
#_08AFBF: db $CF, $93, $5D, $62, $CF, $CF, $A9, $26 ; ⎵・アカ⎵⎵でい
#_08AFC7: db $4C, $9E, $35 ; りぐち
#_08AFCA: db $F9 ; new line
#_08AFCB: db $CF, $93, $1F, $CF, $CF, $CF, $3D, $AF ; ⎵・U⎵⎵⎵のぼ
#_08AFD3: db $4C, $2A, $26, $A6, $52 ; りかいだん
#_08AFD8: db $F9 ; new line
#_08AFD9: db $CF, $93, $0E, $CF, $CF, $CF, $2C, $A6 ; ⎵・D⎵⎵⎵くだ
#_08AFE1: db $4C, $2A, $26, $A6, $52 ; りかいだん
#_08AFE6: db $F9 ; new line
#_08AFE7: db $CF, $93, $0F, $CF, $CF, $CF, $60, $86 ; ⎵・E⎵⎵⎵エレ
#_08AFEF: db $C7, $5A, $6C, $5A ; ベーター
#_08AFF3: db $F9 ; new line
#_08AFF4: db $39, $29, $CF, $25, $4D, $26, $37, $26 ; なお⎵あるいてい
#_08AFFC: db $39, $26, $AB, $30, $57, $3E, $CF, $3F ; ないばしょは⎵ひ
#_08B004: db $57, $27, $A2 ; ょうじ
#_08B007: db $F2, $0B ; prewritten text 0B
#_08B009: db $FC ; wait for key and new line
#_08B00A: db $D3, $0A ; go to message 0A

;===================================================================================================

; «DATE:199Xー10ーX»Z
; «NAME:STEVEN»
; «アクマしょうかん»«プログラム»を
; うけとったひと へ
; «アクマしょうかん»«プログラム»に ついて
; いくつか ちゅういすることが ある
;  ・まんげつの とき アクマは こうふんしていて
;  かいわは できない
;  ・つぎに ナカマに なりうる しゅぞくでも
;  «プログラム»しようしゃとの ぞくせいが
;  ちがうと ナカマに ならない
;  ・どうじに しょうかんしておける
;  アクマは 3たい まで
; いじょうの てんに きをつけてくれ
; まだ おくる «プログラム»は あるが
; これいじょう つうしんは できない
; ちょくせつ あえれば わたせるのだが«・・・»
; わたしの みにも きけんが«・・・»
Message_00_08_09:
#_08B00C: db $F2, $57 ; prewritten text 57
#_08B00E: db $24 ; Z
#_08B00F: db $F9 ; new line
#_08B010: db $F2, $58 ; prewritten text 58
#_08B012: db $F9 ; new line
#_08B013: db $F2, $13 ; prewritten text 13
#_08B015: db $F2, $08 ; prewritten text 08
#_08B017: db $51 ; を
#_08B018: db $F9 ; new line
#_08B019: db $27, $2D, $38, $58, $34, $3F, $38, $CF ; うけとったひと⎵
#_08B021: db $41 ; へ
#_08B022: db $FC ; wait for key and new line
#_08B023: db $FA ; clear message box
#_08B024: db $F2, $13 ; prewritten text 13
#_08B026: db $F2, $08 ; prewritten text 08
#_08B028: db $3A, $CF, $36, $26, $37 ; に⎵ついて
#_08B02D: db $F9 ; new line
#_08B02E: db $26, $2C, $36, $2A, $CF, $35, $56, $27 ; いくつか⎵ちゅう
#_08B036: db $26, $31, $4D, $2E, $38, $9C, $CF, $25 ; いすることが⎵あ
#_08B03E: db $4D ; る
#_08B03F: db $F9 ; new line
#_08B040: db $CF, $93, $43, $52, $9F, $36, $3D, $CF ; ⎵・まんげつの⎵
#_08B048: db $38, $2B, $CF, $5D, $64, $7B, $3E, $CF ; とき⎵アクマは⎵
#_08B050: db $2E, $27, $40, $52, $30, $37, $26, $37 ; こうふんしていて
#_08B058: db $F9 ; new line
#_08B059: db $CF, $2A, $26, $50, $3E, $CF, $A9, $2B ; ⎵かいわは⎵でき
#_08B061: db $39, $26 ; ない
#_08B063: db $F9 ; new line
#_08B064: db $CF, $93, $36, $9D, $3A, $CF, $71, $62 ; ⎵・つぎに⎵ナカ
#_08B06C: db $7B, $3A, $CF, $39, $4C, $27, $4D, $CF ; マに⎵なりうる⎵
#_08B074: db $30, $56, $A5, $2C, $A9, $47 ; しゅぞくでも
#_08B07A: db $F9 ; new line
#_08B07B: db $CF ; ⎵
#_08B07C: db $F2, $08 ; prewritten text 08
#_08B07E: db $30, $4A, $27, $30, $55, $38, $3D, $CF ; しようしゃとの⎵
#_08B086: db $A5, $2C, $32, $26, $9C ; ぞくせいが
#_08B08B: db $F9 ; new line
#_08B08C: db $CF, $35, $9C, $27, $38, $CF, $71, $62 ; ⎵ちがうと⎵ナカ
#_08B094: db $7B, $3A, $CF, $39, $4B, $39, $26 ; マに⎵ならない
#_08B09B: db $FC ; wait for key and new line
#_08B09C: db $FA ; clear message box
#_08B09D: db $CF, $93, $AA, $27, $A2, $3A, $CF, $30 ; ⎵・どうじに⎵し
#_08B0A5: db $57, $27, $2A, $52, $30, $37, $29, $2D ; ょうかんしておけ
#_08B0AD: db $4D ; る
#_08B0AE: db $F9 ; new line
#_08B0AF: db $CF, $5D, $64, $7B, $3E, $CF, $04, $34 ; ⎵アクマは⎵3た
#_08B0B7: db $26, $CF, $43, $A9 ; い⎵まで
#_08B0BB: db $F9 ; new line
#_08B0BC: db $26, $A2, $57, $27, $3D, $CF, $37, $52 ; いじょうの⎵てん
#_08B0C4: db $3A, $CF, $2B, $51, $36, $2D, $37, $2C ; に⎵きをつけてく
#_08B0CC: db $4E ; れ
#_08B0CD: db $FC ; wait for key and new line
#_08B0CE: db $FA ; clear message box
#_08B0CF: db $43, $A6, $CF, $29, $2C, $4D, $CF ; まだ⎵おくる⎵
#_08B0D6: db $F2, $08 ; prewritten text 08
#_08B0D8: db $3E, $CF, $25, $4D, $9C ; は⎵あるが
#_08B0DD: db $F9 ; new line
#_08B0DE: db $2E, $4E, $26, $A2, $57, $27, $CF, $36 ; これいじょう⎵つ
#_08B0E6: db $27, $30, $52, $3E, $CF, $A9, $2B, $39 ; うしんは⎵できな
#_08B0EE: db $26 ; い
#_08B0EF: db $F9 ; new line
#_08B0F0: db $35, $57, $2C, $32, $36, $CF, $25, $28 ; ちょくせつ⎵あえ
#_08B0F8: db $4E, $AB, $CF, $50, $34, $32, $4D, $3D ; れば⎵わたせるの
#_08B100: db $A6, $9C ; だが
#_08B102: db $F2, $0B ; prewritten text 0B
#_08B104: db $F9 ; new line
#_08B105: db $50, $34, $30, $3D, $CF, $44, $3A, $47 ; わたしの⎵みにも
#_08B10D: db $CF, $2B, $2D, $52, $9C ; ⎵きけんが
#_08B112: db $F2, $0B ; prewritten text 0B
#_08B114: db $FC ; wait for key and new line

;===================================================================================================

; >つうしんが きれた
Message_00_08_0A:
#_08B115: db $D4, $03 ; set text box size to 3
#_08B117: db $97, $36, $27, $30, $52, $9C, $CF, $2B ; >つうしんが⎵き
#_08B11F: db $4E, $34 ; れた
#_08B121: db $FC ; wait for key and new line
#_08B122: db $D3, $04 ; go to message 04

;===================================================================================================

Message_00_08_0B:
#_08B124: db $D4, $03 ; set text box size to 3
#_08B126: db $D2, $04, $0C ; test progress bit 04 for message 0C
#_08B129: db $D3, $0D ; go to message 0D

;===================================================================================================

; まだ ねむるには はやいじかんだ
Message_00_08_0C:
#_08B12B: db $43, $A6, $CF, $3C, $45, $4D, $3A, $3E ; まだ⎵ねむるには
#_08B133: db $CF, $3E, $48, $26, $A2, $2A, $52, $A6 ; ⎵はやいじかんだ
#_08B13B: db $FC ; wait for key and new line
#_08B13C: db $D3, $04 ; go to message 04

;===================================================================================================

; ははのこえ:
; おやすみ [CHASE]
Message_00_08_0D:
#_08B13E: db $D2, $18, $0E ; test progress bit 18 for message 0E
#_08B141: db $D2, $06, $0E ; test progress bit 06 for message 0E
#_08B144: db $3E, $3E, $3D, $2E, $28, $9A ; ははのこえ:
#_08B14A: db $F9 ; new line
#_08B14B: db $29, $48, $31, $44, $CF ; おやすみ⎵
#_08B150: db $F0 ; write player name
#_08B151: db $FC ; wait for key and new line

;===================================================================================================

; >[CHASE]は ねむった«・・・»
Message_00_08_0E:
#_08B152: db $FA ; clear message box
#_08B153: db $D5, $FD ; send FD to APU
#_08B155: db $97 ; >
#_08B156: db $F0 ; write player name
#_08B157: db $3E, $CF, $3C, $45, $58, $34 ; は⎵ねむった
#_08B15D: db $F2, $0B ; prewritten text 0B
#_08B15F: db $FC ; wait for key and new line
#_08B160: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08B163: db $FE, $1C, $01 ; ext command 1C: $01 TODO
#_08B166: db $FE, $25, $FF ; ext command 25: something FF TODO
#_08B169: db $FE, $23, $FF ; ext command 23: something FF TODO
#_08B16C: db $FE, $24, $FF ; ext command 24: something FF TODO
#_08B16F: db $FA ; clear message box
#_08B170: db $D0, $04 ; set progress bit 04
#_08B172: db $D2, $09, $0F ; test progress bit 09 for message 0F
#_08B175: db $D3, $10 ; go to message 10

;===================================================================================================

Message_00_08_0F:
#_08B177: db $D2, $05, $10 ; test progress bit 05 for message 10
#_08B17A: db $FE, $1A, $0F, $C0, $0A, $00, $00, $00 ; ext command 1A: 0F,C0,0A,00,00,00
#_08B182: db $D0, $FE ; set progress bit FE
#_08B184: db $FE, $1D, $5D, $80 ; ext command 1D: load classy message 805D

;===================================================================================================

Message_00_08_10:
#_08B188: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08B18B: db $FE, $1C, $00 ; ext command 1C: $00 TODO
#_08B18E: db $D3, $03 ; go to message 03

;===================================================================================================

Message_00_08_11:
#_08B190: db $D6, $00, $00 ; delete sprite in slot 00
#_08B193: db $D7, $07 ; load scene 07
#_08B195: db $D3, $03 ; go to message 03

;===================================================================================================

; はは:
Message_00_08_12:
#_08B197: db $D7, $05 ; load scene 05
#_08B199: db $D2, $18, $2C ; test progress bit 18 for message 2C
#_08B19C: db $D2, $15, $23 ; test progress bit 15 for message 23
#_08B19F: db $D2, $06, $1B ; test progress bit 06 for message 1B
#_08B1A2: db $D6, $00, $4D, $78, $28 ; place sprite 4D in slot 00 at XY:{78,28}
#_08B1A7: db $D4, $03 ; set text box size to 3
#_08B1A9: db $3E, $3E, $9A ; はは:
#_08B1AC: db $F9 ; new line
#_08B1AD: db $D2, $07, $13 ; test progress bit 07 for message 13
#_08B1B0: db $D3, $16 ; go to message 16

;===================================================================================================

Message_00_08_13:
#_08B1B2: db $D2, $03, $21 ; test progress bit 03 for message 21
#_08B1B5: db $D2, $04, $14 ; test progress bit 04 for message 14
#_08B1B8: db $D3, $15 ; go to message 15

;===================================================================================================

; おはよう [CHASE]
Message_00_08_14:
#_08B1BA: db $D2, $06, $1B ; test progress bit 06 for message 1B
#_08B1BD: db $29, $3E, $4A, $27, $CF ; おはよう⎵
#_08B1C2: db $F0 ; write player name
#_08B1C3: db $FC ; wait for key and new line
#_08B1C4: db $D2, $05, $19 ; test progress bit 05 for message 19

;===================================================================================================

Message_00_08_15:
#_08B1C7: db $D2, $03, $18 ; test progress bit 03 for message 18
#_08B1CA: db $D2, $07, $17 ; test progress bit 07 for message 17

;===================================================================================================

; ゆうべは よくねむってたみたいね
; パトカーの おとが あんなに すごかったのに
; きづかないで ねてるんだから
Message_00_08_16:
#_08B1CD: db $49, $27, $AE, $3E, $CF, $4A, $2C, $3C ; ゆうべは⎵よくね
#_08B1D5: db $45, $58, $37, $34, $44, $34, $26, $3C ; むってたみたいね
#_08B1DD: db $FC ; wait for key and new line
#_08B1DE: db $FA ; clear message box
#_08B1DF: db $C9, $70, $62, $5A, $3D, $CF, $29, $38 ; パトカーの⎵おと
#_08B1E7: db $9C, $CF, $25, $52, $39, $3A, $CF, $31 ; が⎵あんなに⎵す
#_08B1EF: db $A0, $2A, $58, $34, $3D, $3A ; ごかったのに
#_08B1F5: db $F9 ; new line
#_08B1F6: db $2B, $A8, $2A, $39, $26, $A9, $CF, $3C ; きづかないで⎵ね
#_08B1FE: db $37, $4D, $52, $A6, $2A, $4B ; てるんだから
#_08B204: db $FC ; wait for key and new line
#_08B205: db $FA ; clear message box

;===================================================================================================

; きっと おおきなじけんね«・・・»あれは
; あっ そうそう こんげつの おこづかいよ
; >[CHASE]は ¥10000 を
; «てにいれた»
; はは:
; むだづかいは ダメよ
; アーケードの CAFEで コーヒー かってきて
; おかねは たてかえて おいてね
Message_00_08_17:
#_08B206: db $2B, $58, $38, $CF, $29, $29, $2B, $39 ; きっと⎵おおきな
#_08B20E: db $A2, $2D, $52, $3C ; じけんね
#_08B212: db $F2, $0B ; prewritten text 0B
#_08B214: db $25, $4E, $3E ; あれは
#_08B217: db $FC ; wait for key and new line
#_08B218: db $D2, $07, $1C ; test progress bit 07 for message 1C
#_08B21B: db $FA ; clear message box
#_08B21C: db $25, $58, $CF, $33, $27, $33, $27, $CF ; あっ⎵そうそう⎵
#_08B224: db $2E, $52, $9F, $36, $3D, $CF, $29, $2E ; こんげつの⎵おこ
#_08B22C: db $A8, $2A, $26, $4A ; づかいよ
#_08B230: db $FC ; wait for key and new line
#_08B231: db $FA ; clear message box
#_08B232: db $DA, $10, $27, $00 ; give 10000 money
#_08B236: db $97 ; >
#_08B237: db $F0 ; write player name
#_08B238: db $3E, $CF, $5B, $02, $01, $01, $01, $01 ; は⎵¥10000
#_08B240: db $CF, $51 ; ⎵を
#_08B242: db $F9 ; new line
#_08B243: db $F2, $2D ; prewritten text 2D
#_08B245: db $FC ; wait for key and new line
#_08B246: db $FA ; clear message box
#_08B247: db $3E, $3E, $9A ; はは:
#_08B24A: db $F9 ; new line
#_08B24B: db $45, $A6, $A8, $2A, $26, $3E, $CF, $BF ; むだづかいは⎵ダ
#_08B253: db $7E, $4A ; メよ
#_08B255: db $FC ; wait for key and new line
#_08B256: db $FA ; clear message box
#_08B257: db $5D, $5A, $65, $5A, $C3, $3D, $CF, $0D ; アーケードの⎵C
#_08B25F: db $0B, $10, $0F, $A9, $CF, $66, $5A, $77 ; AFEで⎵コーヒ
#_08B267: db $5A, $CF, $2A, $58, $37, $2B, $37 ; ー⎵かってきて
#_08B26E: db $F9 ; new line
#_08B26F: db $29, $2A, $3C, $3E, $CF, $34, $37, $2A ; おかねは⎵たてか
#_08B277: db $28, $37, $CF, $29, $26, $37, $3C ; えて⎵おいてね
#_08B27E: db $FC ; wait for key and new line
#_08B27F: db $D0, $07 ; set progress bit 07
#_08B281: db $D3, $1C ; go to message 1C

;===================================================================================================

; ねえ [CHASE] きいた?
; «イノガシラ こうえん»で おんなのこが
; ころされたんだって
; ぶっそうに なったわね
; あんしんして であるけないわ«・・・»
; そうそう たまには パスカルの
; せわを してあげてね
Message_00_08_18:
#_08B283: db $3C, $28, $CF ; ねえ⎵
#_08B286: db $F0 ; write player name
#_08B287: db $CF, $2B, $26, $34, $95 ; ⎵きいた?
#_08B28C: db $FC ; wait for key and new line
#_08B28D: db $FA ; clear message box
#_08B28E: db $F2, $1A ; prewritten text 1A
#_08B290: db $A9, $CF, $29, $52, $39, $3D, $2E, $9C ; で⎵おんなのこが
#_08B298: db $F9 ; new line
#_08B299: db $2E, $4F, $2F, $4E, $34, $52, $A6, $58 ; ころされたんだっ
#_08B2A1: db $37 ; て
#_08B2A2: db $FC ; wait for key and new line
#_08B2A3: db $FA ; clear message box
#_08B2A4: db $AD, $58, $33, $27, $3A, $CF, $39, $58 ; ぶっそうに⎵なっ
#_08B2AC: db $34, $50, $3C ; たわね
#_08B2AF: db $F9 ; new line
#_08B2B0: db $25, $52, $30, $52, $30, $37, $CF, $A9 ; あんしんして⎵で
#_08B2B8: db $25, $4D, $2D, $39, $26, $50 ; あるけないわ
#_08B2BE: db $F2, $0B ; prewritten text 0B
#_08B2C0: db $FC ; wait for key and new line
#_08B2C1: db $FA ; clear message box
#_08B2C2: db $33, $27, $33, $27, $CF, $34, $43, $3A ; そうそう⎵たまに
#_08B2CA: db $3E, $CF, $C9, $69, $62, $85, $3D ; は⎵パスカルの
#_08B2D1: db $F9 ; new line
#_08B2D2: db $32, $50, $51, $CF, $30, $37, $25, $9F ; せわを⎵してあげ
#_08B2DA: db $37, $3C ; てね
#_08B2DC: db $FC ; wait for key and new line
#_08B2DD: db $D3, $1C ; go to message 1C

;===================================================================================================

; ゆうべは どうしたの?
; うなされて だれかを よんでたわよ
; たしか おんなのこの なまえ«・・・»
; となりの [MOMO]さん
; だったような«・・・»
; なに あかくなってるの? ウソよ
Message_00_08_19:
#_08B2DF: db $D2, $08, $1A ; test progress bit 08 for message 1A
#_08B2E2: db $49, $27, $AE, $3E, $CF, $AA, $27, $30 ; ゆうべは⎵どうし
#_08B2EA: db $34, $3D, $95 ; たの?
#_08B2ED: db $F9 ; new line
#_08B2EE: db $27, $39, $2F, $4E, $37, $CF, $A6, $4E ; うなされて⎵だれ
#_08B2F6: db $2A, $51, $CF, $4A, $52, $A9, $34, $50 ; かを⎵よんでたわ
#_08B2FE: db $4A ; よ
#_08B2FF: db $FC ; wait for key and new line
#_08B300: db $FA ; clear message box
#_08B301: db $34, $30, $2A, $CF, $29, $52, $39, $3D ; たしか⎵おんなの
#_08B309: db $2E, $3D, $CF, $39, $43, $28 ; この⎵なまえ
#_08B30F: db $F2, $0B ; prewritten text 0B
#_08B311: db $F9 ; new line
#_08B312: db $38, $39, $4C, $3D, $CF ; となりの⎵
#_08B317: db $ED ; write female protag name
#_08B318: db $2F, $52 ; さん
#_08B31A: db $F9 ; new line
#_08B31B: db $A6, $58, $34, $4A, $27, $39 ; だったような
#_08B321: db $F2, $0B ; prewritten text 0B
#_08B323: db $F9 ; new line
#_08B324: db $39, $3A, $CF, $25, $2A, $2C, $39, $58 ; なに⎵あかくなっ
#_08B32C: db $37, $4D, $3D, $95 ; てるの?
#_08B330: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08B333: db $CF, $5F, $6B, $4A ; ⎵ウソよ
#_08B337: db $FC ; wait for key and new line
#_08B338: db $D0, $08 ; set progress bit 08
#_08B33A: db $D3, $1C ; go to message 1C

;===================================================================================================

; となりの せんせいも むすめさんが としごろで
; しんぱいが おおいわよね
; [CHASE]が おとこで よかったわ
Message_00_08_1A:
#_08B33C: db $38, $39, $4C, $3D, $CF, $32, $52, $32 ; となりの⎵せんせ
#_08B344: db $26, $47, $CF, $45, $31, $46, $2F, $52 ; いも⎵むすめさん
#_08B34C: db $9C, $CF, $38, $30, $A0, $4F, $A9 ; が⎵としごろで
#_08B353: db $F9 ; new line
#_08B354: db $30, $52, $B0, $26, $9C, $CF, $29, $29 ; しんぱいが⎵おお
#_08B35C: db $26, $50, $4A, $3C ; いわよね
#_08B360: db $FC ; wait for key and new line
#_08B361: db $FA ; clear message box
#_08B362: db $F0 ; write player name
#_08B363: db $9C, $CF, $29, $38, $2E, $A9, $CF, $4A ; が⎵おとこで⎵よ
#_08B36B: db $2A, $58, $34, $50 ; かったわ
#_08B36F: db $FC ; wait for key and new line
#_08B370: db $D3, $1C ; go to message 1C

;===================================================================================================

; >ははおやは でかけているようだ
Message_00_08_1B:
#_08B372: db $97, $3E, $3E, $29, $48, $3E, $CF, $A9 ; >ははおやは⎵で
#_08B37A: db $2A, $2D, $37, $26, $4D, $4A, $27, $A6 ; かけているようだ
#_08B382: db $FC ; wait for key and new line

;===================================================================================================

; «>なにを しますか?»
Message_00_08_1C:
#_08B383: db $FA ; clear message box
#_08B384: db $F2, $2E ; prewritten text 2E
#_08B386: db $D8, $01 ; option list with 2 options
#_08B388: db $0C, $11 ; option 1 [0C]: go to message 11
#_08B38A: db $0E, $1D ; option 2 [0E]: go to message 1D

;===================================================================================================

Message_00_08_1D:
#_08B38C: db $D2, $18, $1F ; test progress bit 18 for message 1F
#_08B38F: db $D2, $06, $1F ; test progress bit 06 for message 1F

;===================================================================================================

; はは:
; きを つけてね [CHASE]
; あまり おそくならないようにね
Message_00_08_1E:
#_08B392: db $D4, $03 ; set text box size to 3
#_08B394: db $3E, $3E, $9A ; はは:
#_08B397: db $F9 ; new line
#_08B398: db $2B, $51, $CF, $36, $2D, $37, $3C, $CF ; きを⎵つけてね⎵
#_08B3A0: db $F0 ; write player name
#_08B3A1: db $F9 ; new line
#_08B3A2: db $25, $43, $4C, $CF, $29, $33, $2C, $39 ; あまり⎵おそくな
#_08B3AA: db $4B, $39, $26, $4A, $27, $3A, $3C ; らないようにね
#_08B3B1: db $FC ; wait for key and new line
#_08B3B2: db $D1, $04 ; clear progress bit 04

;===================================================================================================

Message_00_08_1F:
#_08B3B4: db $D2, $30, $20 ; test progress bit 30 for message 20
#_08B3B7: db $FE, $1A, $00, $81, $1A, $00, $00, $00 ; ext command 1A: 00,81,1A,00,00,00

;===================================================================================================

Message_00_08_20:
#_08B3BF: db $FF ; end of message

;===================================================================================================

; おかえり [CHASE] どこいってたの?
; あまり おそく ならないでね
; しんぱいだから
; でも おとこのこは げんきなほうが いいか
Message_00_08_21:
#_08B3C0: db $FE, $15, $00, $22 ; ext command 15: goto message 22 if someone has general affliction
#_08B3C4: db $FE, $15, $01, $22 ; ext command 15: goto message 22 if someone is cursed
#_08B3C8: db $FE, $15, $02, $22 ; ext command 15: goto message 22 if someone is dead
#_08B3CC: db $29, $2A, $28, $4C, $CF ; おかえり⎵
#_08B3D1: db $F0 ; write player name
#_08B3D2: db $CF, $AA, $2E, $26, $58, $37, $34, $3D ; ⎵どこいってたの
#_08B3DA: db $95 ; ?
#_08B3DB: db $FC ; wait for key and new line
#_08B3DC: db $FA ; clear message box
#_08B3DD: db $25, $43, $4C, $CF, $29, $33, $2C, $CF ; あまり⎵おそく⎵
#_08B3E5: db $39, $4B, $39, $26, $A9, $3C ; ならないでね
#_08B3EB: db $F9 ; new line
#_08B3EC: db $30, $52, $B0, $26, $A6, $2A, $4B ; しんぱいだから
#_08B3F3: db $F9 ; new line
#_08B3F4: db $A9, $47, $CF, $29, $38, $2E, $3D, $2E ; でも⎵おとこのこ
#_08B3FC: db $3E, $CF, $9F, $52, $2B, $39, $42, $27 ; は⎵げんきなほう
#_08B404: db $9C, $CF, $26, $26, $2A ; が⎵いいか
#_08B409: db $FC ; wait for key and new line
#_08B40A: db $D3, $15 ; go to message 15

;===================================================================================================

; まあ たいへん! どうしたの?
; すぐ おとなりで みてもらいなさい
Message_00_08_22:
#_08B40C: db $43, $25, $CF, $34, $26, $41, $52, $94 ; まあ⎵たいへん!
#_08B414: db $CF, $AA, $27, $30, $34, $3D, $95 ; ⎵どうしたの?
#_08B41B: db $F9 ; new line
#_08B41C: db $31, $9E, $CF, $29, $38, $39, $4C, $A9 ; すぐ⎵おとなりで
#_08B424: db $CF, $44, $37, $47, $4B, $26, $39, $2F ; ⎵みてもらいなさ
#_08B42C: db $26 ; い
#_08B42D: db $FC ; wait for key and new line
#_08B42E: db $D3, $1F ; go to message 1F

;===================================================================================================

; はは:
; おかえりなさい [CHASE]
; わたしは いつも あなたのこと
; しんぱいしてるのよ
; きょうも よくぶじに かえってきたわね
; うれしいわ さあ こっちへ いらっしゃい«・・・»
; どうしたの? はやく こちらへ いらっしゃい
; わたしは いつも あなたのこと
; あいしているのよ さあ! はやく!
; [JIMMY]:
; なんだか へんですね
; [HIM]:
; みょうな においだな
; アクマ:
; チッ«・・・»カンがいいな
; «・・・»おまえの ははおやは いただいた
; なあに かなしむことはない
; すぐに あわせてやるよ おれの はらのなかでな!
; そのまえに せいぜい たのしませてくれよ
Message_00_08_23:
#_08B430: db $E9, $0C, $1B ; go to message 1B maybe TODO
#_08B433: db $D5, $46 ; send 46 to APU
#_08B435: db $D6, $00, $4D, $78, $28 ; place sprite 4D in slot 00 at XY:{78,28}
#_08B43A: db $3E, $3E, $9A ; はは:
#_08B43D: db $F9 ; new line
#_08B43E: db $29, $2A, $28, $4C, $39, $2F, $26, $CF ; おかえりなさい⎵
#_08B446: db $F0 ; write player name
#_08B447: db $F9 ; new line
#_08B448: db $50, $34, $30, $3E, $CF, $26, $36, $47 ; わたしは⎵いつも
#_08B450: db $CF, $25, $39, $34, $3D, $2E, $38 ; ⎵あなたのこと
#_08B457: db $F9 ; new line
#_08B458: db $30, $52, $B0, $26, $30, $37, $4D, $3D ; しんぱいしてるの
#_08B460: db $4A ; よ
#_08B461: db $F9 ; new line
#_08B462: db $2B, $57, $27, $47, $CF, $4A, $2C, $AD ; きょうも⎵よくぶ
#_08B46A: db $A2, $3A, $CF, $2A, $28, $58, $37, $2B ; じに⎵かえってき
#_08B472: db $34, $50, $3C ; たわね
#_08B475: db $F9 ; new line
#_08B476: db $27, $4E, $30, $26, $50, $CF, $2F, $25 ; うれしいわ⎵さあ
#_08B47E: db $CF, $2E, $58, $35, $41, $CF, $26, $4B ; ⎵こっちへ⎵いら
#_08B486: db $58, $30, $55, $26 ; っしゃい
#_08B48A: db $F2, $0B ; prewritten text 0B
#_08B48C: db $FC ; wait for key and new line
#_08B48D: db $FA ; clear message box
#_08B48E: db $AA, $27, $30, $34, $3D, $95, $CF, $3E ; どうしたの?⎵は
#_08B496: db $48, $2C, $CF, $2E, $35, $4B, $41, $CF ; やく⎵こちらへ⎵
#_08B49E: db $26, $4B, $58, $30, $55, $26 ; いらっしゃい
#_08B4A4: db $F9 ; new line
#_08B4A5: db $50, $34, $30, $3E, $CF, $26, $36, $47 ; わたしは⎵いつも
#_08B4AD: db $CF, $25, $39, $34, $3D, $2E, $38 ; ⎵あなたのこと
#_08B4B4: db $F9 ; new line
#_08B4B5: db $25, $26, $30, $37, $26, $4D, $3D, $4A ; あいしているのよ
#_08B4BD: db $CF, $2F, $25, $94, $CF, $3E, $48, $2C ; ⎵さあ!⎵はやく
#_08B4C5: db $94 ; !
#_08B4C6: db $FE, $07, $24 ; ext command 07: draw buffered text then wait 35 frames
#_08B4C9: db $FC ; wait for key and new line
#_08B4CA: db $D4, $03 ; set text box size to 3
#_08B4CC: db $EE ; write lawful hero name
#_08B4CD: db $9A ; :
#_08B4CE: db $F9 ; new line
#_08B4CF: db $39, $52, $A6, $2A, $CF, $41, $52, $A9 ; なんだか⎵へんで
#_08B4D7: db $31, $3C ; すね
#_08B4D9: db $FC ; wait for key and new line
#_08B4DA: db $FA ; clear message box
#_08B4DB: db $EF ; write chaos hero name
#_08B4DC: db $9A ; :
#_08B4DD: db $F9 ; new line
#_08B4DE: db $44, $57, $27, $39, $CF, $3A, $29, $26 ; みょうな⎵におい
#_08B4E6: db $A6, $39 ; だな
#_08B4E8: db $FC ; wait for key and new line
#_08B4E9: db $FA ; clear message box
#_08B4EA: db $5D, $64, $7B, $9A ; アクマ:
#_08B4EE: db $F9 ; new line
#_08B4EF: db $6D, $92 ; チッ
#_08B4F1: db $F2, $0B ; prewritten text 0B
#_08B4F3: db $62, $8A, $9C, $26, $26, $39 ; カンがいいな
#_08B4F9: db $FE, $07, $24 ; ext command 07: draw buffered text then wait 35 frames
#_08B4FC: db $F9 ; new line
#_08B4FD: db $F2, $0B ; prewritten text 0B
#_08B4FF: db $29, $43, $28, $3D, $CF, $3E, $3E, $29 ; おまえの⎵ははお
#_08B507: db $48, $3E, $CF, $26, $34, $A6, $26, $34 ; やは⎵いただいた
#_08B50F: db $F9 ; new line
#_08B510: db $39, $25, $3A, $CF, $2A, $39, $30, $45 ; なあに⎵かなしむ
#_08B518: db $2E, $38, $3E, $39, $26 ; ことはない
#_08B51D: db $FC ; wait for key and new line
#_08B51E: db $FA ; clear message box
#_08B51F: db $31, $9E, $3A, $CF, $25, $50, $32, $37 ; すぐに⎵あわせて
#_08B527: db $48, $4D, $4A, $CF, $29, $4E, $3D, $CF ; やるよ⎵おれの⎵
#_08B52F: db $3E, $4B, $3D, $39, $2A, $A9, $39, $94 ; はらのなかでな!
#_08B537: db $F9 ; new line
#_08B538: db $33, $3D, $43, $28, $3A, $CF, $32, $26 ; そのまえに⎵せい
#_08B540: db $A4, $26, $CF, $34, $3D, $30, $43, $32 ; ぜい⎵たのしませ
#_08B548: db $37, $2C, $4E, $4A ; てくれよ
#_08B54C: db $FC ; wait for key and new line
#_08B54D: db $DE, $01, $00, $01, $01 ; load 1x demon 0101
#_08B552: db $FE, $46, $09 ; ext command 46: 09 TODO
#_08B555: db $FE, $07, $06 ; ext command 07: draw buffered text then wait 5 frames
#_08B558: db $D5, $39 ; send 39 to APU
#_08B55A: db $D6, $00, $9D, $78, $48 ; place sprite 9D in slot 00 at XY:{78,48}
#_08B55F: db $FE, $07, $13 ; ext command 07: draw buffered text then wait 18 frames
#_08B562: db $E4, $00 ; load demon $00
#_08B564: db $E5, $02, $25 ; [COMMAND E5:02,25]

;===================================================================================================

Message_00_08_24:
#_08B567: db $E5, $00, $25 ; [COMMAND E5:00,25]
#_08B56A: db $D3, $24 ; go to message 24

;===================================================================================================

; >[LEADER]は [ITEM]を
; «てにいれた»
; [JIMMY]:
; こんなときに なにをいっても なぐさめには
; ならないと おもうけど«・・・»
; «・・・»きを おとさないで«・・・»
; [HIM]:
; きやすめは よせ [JIMMY]
; ははおやが ころされたんだぞ
; そっとしといて やれよ
Message_00_08_25:
#_08B56C: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08B56E: db $D0, $18 ; set progress bit 18
#_08B570: db $E1, $F0 ; set $0A50 to item F0
#_08B572: db $97 ; >
#_08B573: db $F1 ; write leader's name for team
#_08B574: db $3E, $CF ; は⎵
#_08B576: db $F3 ; write item name from $0A50
#_08B577: db $51 ; を
#_08B578: db $F9 ; new line
#_08B579: db $FE, $3C, $2B ; ext command 3C: go to message 2B if no space for item
#_08B57C: db $F2, $2D ; prewritten text 2D
#_08B57E: db $FC ; wait for key and new line
#_08B57F: db $FE, $28 ; ext command 28: add item to inventory from $0A50
#_08B581: db $E9, $0C, $26 ; go to message 26 maybe TODO
#_08B584: db $FA ; clear message box
#_08B585: db $EE ; write lawful hero name
#_08B586: db $9A ; :
#_08B587: db $F9 ; new line
#_08B588: db $2E, $52, $39, $38, $2B, $3A, $CF, $39 ; こんなときに⎵な
#_08B590: db $3A, $51, $26, $58, $37, $47, $CF, $39 ; にをいっても⎵な
#_08B598: db $9E, $2F, $46, $3A, $3E ; ぐさめには
#_08B59D: db $F9 ; new line
#_08B59E: db $39, $4B, $39, $26, $38, $CF, $29, $47 ; ならないと⎵おも
#_08B5A6: db $27, $2D, $AA ; うけど
#_08B5A9: db $F2, $0B ; prewritten text 0B
#_08B5AB: db $F9 ; new line
#_08B5AC: db $F2, $0B ; prewritten text 0B
#_08B5AE: db $2B, $51, $CF, $29, $38, $2F, $39, $26 ; きを⎵おとさない
#_08B5B6: db $A9 ; で
#_08B5B7: db $F2, $0B ; prewritten text 0B
#_08B5B9: db $FC ; wait for key and new line
#_08B5BA: db $FA ; clear message box
#_08B5BB: db $EF ; write chaos hero name
#_08B5BC: db $9A ; :
#_08B5BD: db $F9 ; new line
#_08B5BE: db $2B, $48, $31, $46, $3E, $CF, $4A, $32 ; きやすめは⎵よせ
#_08B5C6: db $CF ; ⎵
#_08B5C7: db $EE ; write lawful hero name
#_08B5C8: db $F9 ; new line
#_08B5C9: db $3E, $3E, $29, $48, $9C, $CF, $2E, $4F ; ははおやが⎵ころ
#_08B5D1: db $2F, $4E, $34, $52, $A6, $A5 ; されたんだぞ
#_08B5D7: db $F9 ; new line
#_08B5D8: db $33, $58, $38, $30, $38, $26, $37, $CF ; そっとしといて⎵
#_08B5E0: db $48, $4E, $4A ; やれよ
#_08B5E3: db $FC ; wait for key and new line

;===================================================================================================

; «イヌの パスカル»:
; «バウ!ワウ!»«バウ!ワウ!»«バウ!ワウ!»
; >«イヌの パスカル»が とびこんできた
Message_00_08_26:
#_08B5E4: db $D4, $03 ; set text box size to 3
#_08B5E6: db $FE, $07, $7F ; ext command 07: draw buffered text then wait 126 frames
#_08B5E9: db $DE, $01, $00, $34, $01 ; load 1x demon 0134
#_08B5EE: db $E4, $00 ; load demon $00
#_08B5F0: db $F2, $0A ; prewritten text 0A
#_08B5F2: db $9A ; :
#_08B5F3: db $F9 ; new line
#_08B5F4: db $F2, $0C ; prewritten text 0C
#_08B5F6: db $F2, $0C ; prewritten text 0C
#_08B5F8: db $F2, $0C ; prewritten text 0C
#_08B5FA: db $FC ; wait for key and new line
#_08B5FB: db $FA ; clear message box
#_08B5FC: db $97 ; >
#_08B5FD: db $F2, $0A ; prewritten text 0A
#_08B5FF: db $9C, $CF, $38, $AC, $2E, $52, $A9, $2B ; が⎵とびこんでき
#_08B607: db $34 ; た
#_08B608: db $F9 ; new line
#_08B609: db $D3, $28 ; go to message 28

;===================================================================================================

; >«イヌの パスカル»は
Message_00_08_27:
#_08B60B: db $FA ; clear message box
#_08B60C: db $97 ; >
#_08B60D: db $F2, $0A ; prewritten text 0A
#_08B60F: db $3E ; は
#_08B610: db $F9 ; new line

;===================================================================================================

; まるで つれていけと せがんで いるようだ
; つれていきますか?
; «イヌの パスカル»:
; クォーン クォーン
Message_00_08_28:
#_08B611: db $43, $4D, $A9, $CF, $36, $4E, $37, $26 ; まるで⎵つれてい
#_08B619: db $2D, $38, $CF, $32, $9C, $52, $A9, $CF ; けと⎵せがんで⎵
#_08B621: db $26, $4D, $4A, $27, $A6 ; いるようだ
#_08B626: db $FC ; wait for key and new line
#_08B627: db $FA ; clear message box
#_08B628: db $36, $4E, $37, $26, $2B, $43, $31, $2A ; つれていきますか
#_08B630: db $95 ; ?
#_08B631: db $F8, $29 ; YES/NO - go to message 29 if YES
#_08B633: db $D4, $03 ; set text box size to 3
#_08B635: db $F2, $0A ; prewritten text 0A
#_08B637: db $9A ; :
#_08B638: db $F9 ; new line
#_08B639: db $64, $8E, $5A, $8A, $CF, $64, $8E, $5A ; クォーン⎵クォー
#_08B641: db $8A ; ン
#_08B642: db $FC ; wait for key and new line
#_08B643: db $D3, $27 ; go to message 27

;===================================================================================================

; «イヌの パスカル»:
; «バウ!ワウ!»«バウ!ワウ!»
; >«イヌの パスカル»は ついてきた
Message_00_08_29:
#_08B645: db $D4, $03 ; set text box size to 3
#_08B647: db $F2, $0A ; prewritten text 0A
#_08B649: db $9A ; :
#_08B64A: db $F9 ; new line
#_08B64B: db $F2, $0C ; prewritten text 0C
#_08B64D: db $F2, $0C ; prewritten text 0C
#_08B64F: db $FC ; wait for key and new line
#_08B650: db $D6, $00, $00 ; delete sprite in slot 00
#_08B653: db $FA ; clear message box
#_08B654: db $97 ; >
#_08B655: db $F2, $0A ; prewritten text 0A
#_08B657: db $3E, $CF, $36, $26, $37, $2B, $34 ; は⎵ついてきた
#_08B65E: db $FC ; wait for key and new line
#_08B65F: db $D0, $19 ; set progress bit 19
#_08B661: db $E7, $00 ; call routine 01E5CD with value 00 TODO

;===================================================================================================

Message_00_08_2A:
#_08B663: db $D3, $1C ; go to message 1C

;===================================================================================================

; みつけたが もちものが いっぱいで
; てに いれられなかった
Message_00_08_2B:
#_08B665: db $44, $36, $2D, $34, $9C, $CF, $47, $35 ; みつけたが⎵もち
#_08B66D: db $47, $3D, $9C, $CF, $26, $58, $B0, $26 ; ものが⎵いっぱい
#_08B675: db $A9 ; で
#_08B676: db $F9 ; new line
#_08B677: db $37, $3A, $CF, $26, $4E, $4B, $4E, $39 ; てに⎵いれられな
#_08B67F: db $2A, $58, $34 ; かった
#_08B682: db $FC ; wait for key and new line

;===================================================================================================

; >«だれもいない»
Message_00_08_2C:
#_08B683: db $97 ; >
#_08B684: db $F2, $2C ; prewritten text 2C
#_08B686: db $FC ; wait for key and new line
#_08B687: db $D3, $1C ; go to message 1C

;===================================================================================================

; >«イヌの パスカル»が いる
; はなしかけますか?
; «イヌの パスカル»:
; クォーン
Message_00_08_2D:
#_08B689: db $D5, $54 ; send 54 to APU
#_08B68B: db $D2, $19, $2F ; test progress bit 19 for message 2F
#_08B68E: db $DE, $01, $00, $34, $01 ; load 1x demon 0134
#_08B693: db $E4, $00 ; load demon $00
#_08B695: db $97 ; >
#_08B696: db $F2, $0A ; prewritten text 0A
#_08B698: db $9C, $CF, $26, $4D ; が⎵いる
#_08B69C: db $FC ; wait for key and new line
#_08B69D: db $FA ; clear message box
#_08B69E: db $3E, $39, $30, $2A, $2D, $43, $31, $2A ; はなしかけますか
#_08B6A6: db $95 ; ?
#_08B6A7: db $F8, $2E ; YES/NO - go to message 2E if YES
#_08B6A9: db $D4, $03 ; set text box size to 3
#_08B6AB: db $F2, $0A ; prewritten text 0A
#_08B6AD: db $9A ; :
#_08B6AE: db $F9 ; new line
#_08B6AF: db $64, $8E, $5A, $8A ; クォーン
#_08B6B3: db $FC ; wait for key and new line
#_08B6B4: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08B6B6: db $FF ; end of message

;===================================================================================================

; «イヌの パスカル»:
; «バウ!ワウ!»«バウ!ワウ!»
Message_00_08_2E:
#_08B6B7: db $D4, $03 ; set text box size to 3
#_08B6B9: db $F2, $0A ; prewritten text 0A
#_08B6BB: db $9A ; :
#_08B6BC: db $F9 ; new line
#_08B6BD: db $F2, $0C ; prewritten text 0C
#_08B6BF: db $F2, $0C ; prewritten text 0C
#_08B6C1: db $FC ; wait for key and new line
#_08B6C2: db $D6, $00, $00 ; delete sprite in slot 00
#_08B6C5: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
Message_00_08_2F:
#_08B6C6: db $FA ; clear message box
#_08B6C7: db $97 ; >
#_08B6C8: db $F2, $2C ; prewritten text 2C
#_08B6CA: db $FC ; wait for key and new line
#_08B6CB: db $FF ; end of message

;===================================================================================================

Message_00_08_30:
#_08B6CC: db $D0, $03 ; set progress bit 03
#_08B6CE: db $D1, $04 ; clear progress bit 04
#_08B6D0: db $FF ; end of message

;===================================================================================================

; となりのいしゃ:
; おお [CHASE]くんか
Message_00_08_31:
#_08B6D1: db $D7, $06 ; load scene 06
#_08B6D3: db $D5, $54 ; send 54 to APU
#_08B6D5: db $D6, $00, $40, $70, $28 ; place sprite 40 in slot 00 at XY:{70,28}
#_08B6DA: db $38, $39, $4C, $3D, $26, $30, $55, $9A ; となりのいしゃ:
#_08B6E2: db $F9 ; new line
#_08B6E3: db $FE, $15, $00, $3B ; ext command 15: goto message 3B if someone has general affliction
#_08B6E7: db $FE, $15, $01, $3B ; ext command 15: goto message 3B if someone is cursed
#_08B6EB: db $FE, $15, $02, $3B ; ext command 15: goto message 3B if someone is dead
#_08B6EF: db $29, $29, $CF ; おお⎵
#_08B6F2: db $F0 ; write player name
#_08B6F3: db $2C, $52, $2A ; くんか
#_08B6F6: db $F9 ; new line

;===================================================================================================

; げんきに やっとるかね
; うちの むすめは でかけとるよ
Message_00_08_32:
#_08B6F7: db $D2, $16, $35 ; test progress bit 16 for message 35
#_08B6FA: db $D2, $06, $34 ; test progress bit 06 for message 34
#_08B6FD: db $D2, $05, $33 ; test progress bit 05 for message 33
#_08B700: db $9F, $52, $2B, $3A, $CF, $48, $58, $38 ; げんきに⎵やっと
#_08B708: db $4D, $2A, $3C ; るかね
#_08B70B: db $FC ; wait for key and new line
#_08B70C: db $FA ; clear message box
#_08B70D: db $27, $35, $3D, $CF, $45, $31, $46, $3E ; うちの⎵むすめは
#_08B715: db $CF, $A9, $2A, $2D, $38, $4D, $4A ; ⎵でかけとるよ
#_08B71C: db $FC ; wait for key and new line
#_08B71D: db $FF ; end of message

;===================================================================================================

; うちの むすめなら へやにいるよ
; おーい [MOMO]!
; [CHASE]くんが きとるぞ
; [MOMO]のこえ:
; はーい! きこえてるわよ
Message_00_08_33:
#_08B71E: db $27, $35, $3D, $CF, $45, $31, $46, $39 ; うちの⎵むすめな
#_08B726: db $4B, $CF, $41, $48, $3A, $26, $4D, $4A ; ら⎵へやにいるよ
#_08B72E: db $F9 ; new line
#_08B72F: db $29, $5A, $26, $CF ; おーい⎵
#_08B733: db $ED ; write female protag name
#_08B734: db $94 ; !
#_08B735: db $F9 ; new line
#_08B736: db $F0 ; write player name
#_08B737: db $2C, $52, $9C, $CF, $2B, $38, $4D, $A5 ; くんが⎵きとるぞ
#_08B73F: db $FC ; wait for key and new line
#_08B740: db $D4, $03 ; set text box size to 3
#_08B742: db $ED ; write female protag name
#_08B743: db $3D, $2E, $28, $9A ; のこえ:
#_08B747: db $F9 ; new line
#_08B748: db $3E, $5A, $26, $94, $CF, $2B, $2E, $28 ; はーい!⎵きこえ
#_08B750: db $37, $4D, $50, $4A ; てるわよ
#_08B754: db $FC ; wait for key and new line
#_08B755: db $FF ; end of message

;===================================================================================================

; [MOMO]が でかけたまま
; かえってこないんだ
; どこか こころあたりが あったら
; さがしてくれんかね
; たのむよ [CHASE]くん
; [MOMO]は «シンジュク»へ いくと いって
; でていったんだが・・・
Message_00_08_34:
#_08B756: db $ED ; write female protag name
#_08B757: db $9C, $CF, $A9, $2A, $2D, $34, $43, $43 ; が⎵でかけたまま
#_08B75F: db $F9 ; new line
#_08B760: db $2A, $28, $58, $37, $2E, $39, $26, $52 ; かえってこないん
#_08B768: db $A6 ; だ
#_08B769: db $FC ; wait for key and new line
#_08B76A: db $FA ; clear message box
#_08B76B: db $AA, $2E, $2A, $CF, $2E, $2E, $4F, $25 ; どこか⎵こころあ
#_08B773: db $34, $4C, $9C, $CF, $25, $58, $34, $4B ; たりが⎵あったら
#_08B77B: db $F9 ; new line
#_08B77C: db $2F, $9C, $30, $37, $2C, $4E, $52, $2A ; さがしてくれんか
#_08B784: db $3C ; ね
#_08B785: db $F9 ; new line
#_08B786: db $34, $3D, $45, $4A, $CF ; たのむよ⎵
#_08B78B: db $F0 ; write player name
#_08B78C: db $2C, $52 ; くん
#_08B78E: db $FC ; wait for key and new line
#_08B78F: db $FA ; clear message box
#_08B790: db $ED ; write female protag name
#_08B791: db $3E, $CF ; は⎵
#_08B793: db $F2, $18 ; prewritten text 18
#_08B795: db $41, $CF, $26, $2C, $38, $CF, $26, $58 ; へ⎵いくと⎵いっ
#_08B79D: db $37 ; て
#_08B79E: db $F9 ; new line
#_08B79F: db $A9, $37, $26, $58, $34, $52, $A6, $9C ; でていったんだが
#_08B7A7: db $93, $93, $93 ; ・・・
#_08B7AA: db $FC ; wait for key and new line
#_08B7AB: db $D0, $16 ; set progress bit 16
#_08B7AD: db $FF ; end of message

;===================================================================================================

; [MOMO]の てがかりは なにかあったかね
; けいさつは そうさくねがいを うけつけてくれんし
; さがそうと おもっても どうろは ふうさだ
; あのこに もしもの ことが あったら
; ああ どうすればいいんだ«・・・»
Message_00_08_35:
#_08B7AE: db $ED ; write female protag name
#_08B7AF: db $3D, $CF, $37, $9C, $2A, $4C, $3E, $CF ; の⎵てがかりは⎵
#_08B7B7: db $39, $3A, $2A, $25, $58, $34, $2A, $3C ; なにかあったかね
#_08B7BF: db $FC ; wait for key and new line
#_08B7C0: db $FA ; clear message box
#_08B7C1: db $2D, $26, $2F, $36, $3E, $CF, $33, $27 ; けいさつは⎵そう
#_08B7C9: db $2F, $2C, $3C, $9C, $26, $51, $CF, $27 ; さくねがいを⎵う
#_08B7D1: db $2D, $36, $2D, $37, $2C, $4E, $52, $30 ; けつけてくれんし
#_08B7D9: db $F9 ; new line
#_08B7DA: db $2F, $9C, $33, $27, $38, $CF, $29, $47 ; さがそうと⎵おも
#_08B7E2: db $58, $37, $47, $CF, $AA, $27, $4F, $3E ; っても⎵どうろは
#_08B7EA: db $CF, $40, $27, $2F, $A6 ; ⎵ふうさだ
#_08B7EF: db $FC ; wait for key and new line
#_08B7F0: db $FA ; clear message box
#_08B7F1: db $25, $3D, $2E, $3A, $CF, $47, $30, $47 ; あのこに⎵もしも
#_08B7F9: db $3D, $CF, $2E, $38, $9C, $CF, $25, $58 ; の⎵ことが⎵あっ
#_08B801: db $34, $4B ; たら
#_08B803: db $F9 ; new line
#_08B804: db $25, $25, $CF, $AA, $27, $31, $4E, $AB ; ああ⎵どうすれば
#_08B80C: db $26, $26, $52, $A6 ; いいんだ
#_08B810: db $F2, $0B ; prewritten text 0B
#_08B812: db $FC ; wait for key and new line
#_08B813: db $FF ; end of message

;===================================================================================================

Message_00_08_36:
#_08B814: db $D2, $06, $37 ; test progress bit 06 for message 37
#_08B817: db $D2, $05, $38 ; test progress bit 05 for message 38

;===================================================================================================

; >«だれもいない»
Message_00_08_37:
#_08B81A: db $97 ; >
#_08B81B: db $F2, $2C ; prewritten text 2C
#_08B81D: db $FC ; wait for key and new line
#_08B81E: db $FF ; end of message

;===================================================================================================

; [MOMO]:
Message_00_08_38:
#_08B81F: db $D6, $00, $4B, $78, $28 ; place sprite 4B in slot 00 at XY:{78,28}
#_08B824: db $ED ; write female protag name
#_08B825: db $9A ; :
#_08B826: db $F9 ; new line

;===================================================================================================

; あら [CHASE] どうしたの?
; えっ ゆめ? あたし ゆめなんか みてないわよ
; きょうは デートだったのに
; けいさつのせいで どこにもいけないわ
; あいて? だれと つきあおうと
; あたしの かってでしょ
Message_00_08_39:
#_08B827: db $25, $4B, $CF ; あら⎵
#_08B82A: db $F0 ; write player name
#_08B82B: db $CF, $AA, $27, $30, $34, $3D, $95 ; ⎵どうしたの?
#_08B832: db $F9 ; new line
#_08B833: db $28, $58, $CF, $49, $46, $95, $CF, $25 ; えっ⎵ゆめ?⎵あ
#_08B83B: db $34, $30, $CF, $49, $46, $39, $52, $2A ; たし⎵ゆめなんか
#_08B843: db $CF, $44, $37, $39, $26, $50, $4A ; ⎵みてないわよ
#_08B84A: db $FC ; wait for key and new line
#_08B84B: db $D2, $30, $3A ; test progress bit 30 for message 3A
#_08B84E: db $FA ; clear message box
#_08B84F: db $2B, $57, $27, $3E, $CF, $C2, $5A, $70 ; きょうは⎵デート
#_08B857: db $A6, $58, $34, $3D, $3A ; だったのに
#_08B85C: db $F9 ; new line
#_08B85D: db $2D, $26, $2F, $36, $3D, $32, $26, $A9 ; けいさつのせいで
#_08B865: db $CF, $AA, $2E, $3A, $47, $26, $2D, $39 ; ⎵どこにもいけな
#_08B86D: db $26, $50 ; いわ
#_08B86F: db $FC ; wait for key and new line
#_08B870: db $FA ; clear message box
#_08B871: db $25, $26, $37, $95, $CF, $A6, $4E, $38 ; あいて?⎵だれと
#_08B879: db $CF, $36, $2B, $25, $29, $27, $38 ; ⎵つきあおうと
#_08B880: db $F9 ; new line
#_08B881: db $25, $34, $30, $3D, $CF, $2A, $58, $37 ; あたしの⎵かって
#_08B889: db $A9, $30, $57 ; でしょ
#_08B88C: db $FC ; wait for key and new line
#_08B88D: db $D0, $0E ; set progress bit 0E

;===================================================================================================

Message_00_08_3A:
#_08B88F: db $FF ; end of message

;===================================================================================================

; これはひどい すぐに てあてをしよう
; >[LEADER]は げんきに なった
Message_00_08_3B:
#_08B890: db $2E, $4E, $3E, $3F, $AA, $26, $CF, $31 ; これはひどい⎵す
#_08B898: db $9E, $3A, $CF, $37, $25, $37, $51, $30 ; ぐに⎵てあてをし
#_08B8A0: db $4A, $27 ; よう
#_08B8A2: db $FC ; wait for key and new line
#_08B8A3: db $FE, $25, $FF ; ext command 25: something FF TODO
#_08B8A6: db $FE, $23, $FF ; ext command 23: something FF TODO
#_08B8A9: db $FE, $24, $FF ; ext command 24: something FF TODO
#_08B8AC: db $FA ; clear message box
#_08B8AD: db $97 ; >
#_08B8AE: db $F1 ; write leader's name for team
#_08B8AF: db $3E, $CF, $9F, $52, $2B, $3A, $CF, $39 ; は⎵げんきに⎵な
#_08B8B7: db $58, $34 ; った
#_08B8B9: db $FC ; wait for key and new line
#_08B8BA: db $FA ; clear message box
#_08B8BB: db $D3, $32 ; go to message 32

;===================================================================================================

; おとこ:
; ゴトウひきいる «クーデター»ぶたいと
; トールマンたいしが しゅつどうさせた
; «アメリカ»ぐん
; «シンジュク»には どちらも おおぜいいるが
; いまのところ ちょくせつ しょうとつする
; けはいは ないようだ
Message_00_09_00:
#_08B8BD: db $D2, $2F, $59 ; test progress bit 2F for message 59
#_08B8C0: db $D7, $05 ; load scene 05
#_08B8C2: db $D6, $00, $67, $70, $28 ; place sprite 67 in slot 00 at XY:{70,28}
#_08B8C7: db $29, $38, $2E, $9A ; おとこ:
#_08B8CB: db $F9 ; new line
#_08B8CC: db $B9, $70, $5F, $3F, $2B, $26, $4D, $CF ; ゴトウひきいる⎵
#_08B8D4: db $F2, $17 ; prewritten text 17
#_08B8D6: db $AD, $34, $26, $38 ; ぶたいと
#_08B8DA: db $F9 ; new line
#_08B8DB: db $70, $5A, $85, $7B, $8A, $34, $26, $30 ; トールマンたいし
#_08B8E3: db $9C, $CF, $30, $56, $36, $AA, $27, $2F ; が⎵しゅつどうさ
#_08B8EB: db $32, $34 ; せた
#_08B8ED: db $F9 ; new line
#_08B8EE: db $F2, $1B ; prewritten text 1B
#_08B8F0: db $9E, $52 ; ぐん
#_08B8F2: db $FC ; wait for key and new line
#_08B8F3: db $FA ; clear message box
#_08B8F4: db $F2, $18 ; prewritten text 18
#_08B8F6: db $3A, $3E, $CF, $AA, $35, $4B, $47, $CF ; には⎵どちらも⎵
#_08B8FE: db $29, $29, $A4, $26, $26, $4D, $9C ; おおぜいいるが
#_08B905: db $F9 ; new line
#_08B906: db $26, $43, $3D, $38, $2E, $4F, $CF, $35 ; いまのところ⎵ち
#_08B90E: db $57, $2C, $32, $36, $CF, $30, $57, $27 ; ょくせつ⎵しょう
#_08B916: db $38, $36, $31, $4D ; とつする
#_08B91A: db $F9 ; new line
#_08B91B: db $2D, $3E, $26, $3E, $CF, $39, $26, $4A ; けはいは⎵ないよ
#_08B923: db $27, $A6 ; うだ
#_08B925: db $FC ; wait for key and new line
#_08B926: db $FF ; end of message

;===================================================================================================

Message_00_09_01:
#_08B927: db $D7, $05 ; load scene 05
#_08B929: db $D5, $46 ; send 46 to APU

;===================================================================================================

; おとこ:
; な なんの ようかな?
Message_00_09_02:
#_08B92B: db $D2, $25, $09 ; test progress bit 25 for message 09
#_08B92E: db $D2, $0A, $09 ; test progress bit 0A for message 09
#_08B931: db $D2, $28, $03 ; test progress bit 28 for message 03
#_08B934: db $D6, $00, $27, $70, $28 ; place sprite 27 in slot 00 at XY:{70,28}
#_08B939: db $29, $38, $2E, $9A ; おとこ:
#_08B93D: db $F9 ; new line
#_08B93E: db $39, $CF, $39, $52, $3D, $CF, $4A, $27 ; な⎵なんの⎵よう
#_08B946: db $2A, $39, $95 ; かな?
#_08B949: db $FC ; wait for key and new line
#_08B94A: db $FF ; end of message

;===================================================================================================

; >ひとりの おとこが いる
; [HIM]:
; オザワ! いつかの かりを かえしてやるぜ
; オザワ:
; キチジョウジの こぞうじゃねえか
; まだ アクマたいじごっこを してるのか?
Message_00_09_03:
#_08B94B: db $D6, $00, $26, $70, $28 ; place sprite 26 in slot 00 at XY:{70,28}
#_08B950: db $97, $3F, $38, $4C, $3D, $CF, $29, $38 ; >ひとりの⎵おと
#_08B958: db $2E, $9C, $CF, $26, $4D ; こが⎵いる
#_08B95D: db $FC ; wait for key and new line
#_08B95E: db $E9, $03, $04 ; go to message 04 maybe TODO
#_08B961: db $FA ; clear message box
#_08B962: db $EF ; write chaos hero name
#_08B963: db $9A ; :
#_08B964: db $F9 ; new line
#_08B965: db $61, $BA, $88, $94, $CF, $26, $36, $2A ; オザワ!⎵いつか
#_08B96D: db $3D, $CF, $2A, $4C, $51, $CF, $2A, $28 ; の⎵かりを⎵かえ
#_08B975: db $30, $37, $48, $4D, $A4 ; してやるぜ
#_08B97A: db $FC ; wait for key and new line
#_08B97B: db $FA ; clear message box
#_08B97C: db $61, $BA, $88, $9A ; オザワ:
#_08B980: db $F9 ; new line
#_08B981: db $63, $6D, $BB, $91, $5F, $BB, $3D, $CF ; キチジョウジの⎵
#_08B989: db $2E, $A5, $27, $A2, $55, $3C, $28, $2A ; こぞうじゃねえか
#_08B991: db $F9 ; new line
#_08B992: db $43, $A6, $CF, $5D, $64, $7B, $34, $26 ; まだ⎵アクマたい
#_08B99A: db $A2, $A0, $58, $2E, $51, $CF, $30, $37 ; じごっこを⎵して
#_08B9A2: db $4D, $3D, $2A, $95 ; るのか?
#_08B9A6: db $FC ; wait for key and new line

;===================================================================================================

; [JIMMY]:
; なぜ あなたたちは [MOMO]を
; つかまえようと するんです?
; ぼくの [MOMO]は どこにいるんですか?
Message_00_09_04:
#_08B9A7: db $E9, $02, $05 ; go to message 05 maybe TODO
#_08B9AA: db $FA ; clear message box
#_08B9AB: db $EE ; write lawful hero name
#_08B9AC: db $9A ; :
#_08B9AD: db $F9 ; new line
#_08B9AE: db $39, $A4, $CF, $25, $39, $34, $34, $35 ; なぜ⎵あなたたち
#_08B9B6: db $3E, $CF ; は⎵
#_08B9B8: db $ED ; write female protag name
#_08B9B9: db $51 ; を
#_08B9BA: db $F9 ; new line
#_08B9BB: db $36, $2A, $43, $28, $4A, $27, $38, $CF ; つかまえようと⎵
#_08B9C3: db $31, $4D, $52, $A9, $31, $95 ; するんです?
#_08B9C9: db $F9 ; new line
#_08B9CA: db $AF, $2C, $3D, $CF ; ぼくの⎵
#_08B9CE: db $ED ; write female protag name
#_08B9CF: db $3E, $CF, $AA, $2E, $3A, $26, $4D, $52 ; は⎵どこにいるん
#_08B9D7: db $A9, $31, $2A, $95 ; ですか?
#_08B9DB: db $FC ; wait for key and new line

;===================================================================================================

; オザワ:
; おれには ゴトウも [MOMO]も
; かんけいない
; ゴトウの けんりょく だけが みりょくなのさ
; いずれは おれが ゴトウに とってかわる
; おれは もうアクマを よべるように なったんだ
; てめえに つきあってるひまは ねえ
; こいつと あそんでな!
Message_00_09_05:
#_08B9DC: db $FA ; clear message box
#_08B9DD: db $61, $BA, $88, $9A ; オザワ:
#_08B9E1: db $F9 ; new line
#_08B9E2: db $29, $4E, $3A, $3E, $CF, $B9, $70, $5F ; おれには⎵ゴトウ
#_08B9EA: db $47, $CF ; も⎵
#_08B9EC: db $ED ; write female protag name
#_08B9ED: db $47 ; も
#_08B9EE: db $F9 ; new line
#_08B9EF: db $2A, $52, $2D, $26, $39, $26 ; かんけいない
#_08B9F5: db $F9 ; new line
#_08B9F6: db $B9, $70, $5F, $3D, $CF, $2D, $52, $4C ; ゴトウの⎵けんり
#_08B9FE: db $57, $2C, $CF, $A6, $2D, $9C, $CF, $44 ; ょく⎵だけが⎵み
#_08BA06: db $4C, $57, $2C, $39, $3D, $2F ; りょくなのさ
#_08BA0C: db $FC ; wait for key and new line
#_08BA0D: db $FA ; clear message box
#_08BA0E: db $26, $A3, $4E, $3E, $CF, $29, $4E, $9C ; いずれは⎵おれが
#_08BA16: db $CF, $B9, $70, $5F, $3A, $CF, $38, $58 ; ⎵ゴトウに⎵とっ
#_08BA1E: db $37, $2A, $50, $4D ; てかわる
#_08BA22: db $F9 ; new line
#_08BA23: db $29, $4E, $3E, $CF, $47, $27, $5D, $64 ; おれは⎵もうアク
#_08BA2B: db $7B, $51, $CF, $4A, $AE, $4D, $4A, $27 ; マを⎵よべるよう
#_08BA33: db $3A, $CF, $39, $58, $34, $52, $A6 ; に⎵なったんだ
#_08BA3A: db $FC ; wait for key and new line
#_08BA3B: db $FA ; clear message box
#_08BA3C: db $37, $46, $28, $3A, $CF, $36, $2B, $25 ; てめえに⎵つきあ
#_08BA44: db $58, $37, $4D, $3F, $43, $3E, $CF, $3C ; ってるひまは⎵ね
#_08BA4C: db $28 ; え
#_08BA4D: db $F9 ; new line
#_08BA4E: db $2E, $26, $36, $38, $CF, $25, $33, $52 ; こいつと⎵あそん
#_08BA56: db $A9, $39, $94 ; でな!
#_08BA59: db $FC ; wait for key and new line
#_08BA5A: db $D6, $00, $00 ; delete sprite in slot 00
#_08BA5D: db $DE, $00, $00, $E0, $01 ; load 1x demon 00E0
#_08BA62: db $D5, $39 ; send 39 to APU
#_08BA64: db $E4, $00 ; load demon $00
#_08BA66: db $E5, $01, $07 ; [COMMAND E5:01,07]

;===================================================================================================

Message_00_09_06:
#_08BA69: db $E5, $00, $07 ; [COMMAND E5:00,07]
#_08BA6C: db $D3, $06 ; go to message 06

;===================================================================================================

; >オザワの すがたは きえた«・・・»
; [HIM]:
; くそっ! どこに にげたんだ!
Message_00_09_07:
#_08BA6E: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08BA70: db $FA ; clear message box
#_08BA71: db $97, $61, $BA, $88, $3D, $CF, $31, $9C ; >オザワの⎵すが
#_08BA79: db $34, $3E, $CF, $2B, $28, $34 ; たは⎵きえた
#_08BA7F: db $F2, $0B ; prewritten text 0B
#_08BA81: db $FC ; wait for key and new line
#_08BA82: db $E9, $03, $08 ; go to message 08 maybe TODO
#_08BA85: db $D4, $03 ; set text box size to 3
#_08BA87: db $EF ; write chaos hero name
#_08BA88: db $9A ; :
#_08BA89: db $F9 ; new line
#_08BA8A: db $2C, $33, $58, $94, $CF, $AA, $2E, $3A ; くそっ!⎵どこに
#_08BA92: db $CF, $3A, $9F, $34, $52, $A6, $94 ; ⎵にげたんだ!
#_08BA99: db $FC ; wait for key and new line

;===================================================================================================

Message_00_09_08:
#_08BA9A: db $D0, $25 ; set progress bit 25
#_08BA9C: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
Message_00_09_09:
#_08BA9D: db $97 ; >
#_08BA9E: db $F2, $2C ; prewritten text 2C
#_08BAA0: db $FC ; wait for key and new line
#_08BAA1: db $FF ; end of message

;===================================================================================================

; へいし:
Message_00_09_0A:
#_08BAA2: db $D6, $00, $5A, $70, $28 ; place sprite 5A in slot 00 at XY:{70,28}
#_08BAA7: db $41, $26, $30, $9A ; へいし:
#_08BAAB: db $F9 ; new line
#_08BAAC: db $D2, $27, $0B ; test progress bit 27 for message 0B
#_08BAAF: db $D2, $26, $0C ; test progress bit 26 for message 0C

;===================================================================================================

; ここは «たちいりきんし»だ
Message_00_09_0B:
#_08BAB2: db $2E, $2E, $3E, $CF ; ここは⎵
#_08BAB6: db $F2, $0E ; prewritten text 0E
#_08BAB8: db $A6 ; だ
#_08BAB9: db $FC ; wait for key and new line
#_08BABA: db $FF ; end of message

;===================================================================================================

; まもなく こうかいしょけいが はじまるぞ
Message_00_09_0C:
#_08BABB: db $E9, $0C, $0B ; go to message 0B maybe TODO
#_08BABE: db $43, $47, $39, $2C, $CF, $2E, $27, $2A ; まもなく⎵こうか
#_08BAC6: db $26, $30, $57, $2D, $26, $9C, $CF, $3E ; いしょけいが⎵は
#_08BACE: db $A2, $43, $4D, $A5 ; じまるぞ
#_08BAD2: db $FC ; wait for key and new line
#_08BAD3: db $D6, $00, $00 ; delete sprite in slot 00
#_08BAD6: db $FE, $1B, $26, $89, $08, $00, $00, $00 ; ext command 1B: 26,89,08,00,00,00
#_08BADE: db $FF ; end of message

;===================================================================================================

; >ひろばには «クーデター»ぶたいの へいしたちや
; アクマたち そして ぐんしゅうが
; あつまっている
; [JIMMY]:
; [MOMO]さんだ!
; はやく たすけましょう!
; [HIM]:
; やめろ! おちつけ! ひろばに
; でていって どうなる!
; ゆりこ:
; いだいなるゴトウさまの じゃまをした
; «レジスタンス»・グループの«リーダー»
; [MOMO]を ついに とらえた!
; この おんなが おこなわせた かずかずの
; ぼうがいこうさくを ゴトウさまは かんだいにも
; おゆるしに なられた
; だが ゴトウさまに さからった つみは
; きえない!
; この おんな [MOMO]は«・・・»
; しけいだ!
; まて«・・・»そこに ねずみが かくれてるわ!
; おとなしく でてらっしゃい
; とくとうせきに あんないしてあげるわ
; これで [MOMO]とも おわかれよ
; [CHASE]
; はじめから あたしを えらんでいれば
; こんな かなしいめに あわなかったのに«・・・»
; さあ やっておしまい!
Message_00_09_0D:
#_08BADF: db $D5, $46 ; send 46 to APU
#_08BAE1: db $D7, $21 ; load scene 21
#_08BAE3: db $97, $3F, $4F, $AB, $3A, $3E, $CF ; >ひろばには⎵
#_08BAEA: db $F2, $17 ; prewritten text 17
#_08BAEC: db $AD, $34, $26, $3D, $CF, $41, $26, $30 ; ぶたいの⎵へいし
#_08BAF4: db $34, $35, $48 ; たちや
#_08BAF7: db $F9 ; new line
#_08BAF8: db $5D, $64, $7B, $34, $35, $CF, $33, $30 ; アクマたち⎵そし
#_08BB00: db $37, $CF, $9E, $52, $30, $56, $27, $9C ; て⎵ぐんしゅうが
#_08BB08: db $F9 ; new line
#_08BB09: db $25, $36, $43, $58, $37, $26, $4D ; あつまっている
#_08BB10: db $FC ; wait for key and new line
#_08BB11: db $FA ; clear message box
#_08BB12: db $EE ; write lawful hero name
#_08BB13: db $9A ; :
#_08BB14: db $F9 ; new line
#_08BB15: db $ED ; write female protag name
#_08BB16: db $2F, $52, $A6, $94 ; さんだ!
#_08BB1A: db $F9 ; new line
#_08BB1B: db $3E, $48, $2C, $CF, $34, $31, $2D, $43 ; はやく⎵たすけま
#_08BB23: db $30, $57, $27, $94 ; しょう!
#_08BB27: db $FC ; wait for key and new line
#_08BB28: db $FA ; clear message box
#_08BB29: db $EF ; write chaos hero name
#_08BB2A: db $9A ; :
#_08BB2B: db $F9 ; new line
#_08BB2C: db $48, $46, $4F, $94, $CF, $29, $35, $36 ; やめろ!⎵おちつ
#_08BB34: db $2D, $94, $CF, $3F, $4F, $AB, $3A ; け!⎵ひろばに
#_08BB3B: db $F9 ; new line
#_08BB3C: db $A9, $37, $26, $58, $37, $CF, $AA, $27 ; でていって⎵どう
#_08BB44: db $39, $4D, $94 ; なる!
#_08BB47: db $FC ; wait for key and new line
#_08BB48: db $FA ; clear message box
#_08BB49: db $49, $4C, $2E, $9A ; ゆりこ:
#_08BB4D: db $F9 ; new line
#_08BB4E: db $26, $A6, $26, $39, $4D, $B9, $70, $5F ; いだいなるゴトウ
#_08BB56: db $2F, $43, $3D, $CF, $A2, $55, $43, $51 ; さまの⎵じゃまを
#_08BB5E: db $30, $34 ; した
#_08BB60: db $F9 ; new line
#_08BB61: db $F2, $15 ; prewritten text 15
#_08BB63: db $93, $B7, $85, $5A, $CB, $3D ; ・グループの
#_08BB69: db $F2, $16 ; prewritten text 16
#_08BB6B: db $FC ; wait for key and new line
#_08BB6C: db $FA ; clear message box
#_08BB6D: db $ED ; write female protag name
#_08BB6E: db $51, $CF, $36, $26, $3A, $CF, $38, $4B ; を⎵ついに⎵とら
#_08BB76: db $28, $34, $94 ; えた!
#_08BB79: db $FC ; wait for key and new line
#_08BB7A: db $FA ; clear message box
#_08BB7B: db $2E, $3D, $CF, $29, $52, $39, $9C, $CF ; この⎵おんなが⎵
#_08BB83: db $29, $2E, $39, $50, $32, $34, $CF, $2A ; おこなわせた⎵か
#_08BB8B: db $A3, $2A, $A3, $3D ; ずかずの
#_08BB8F: db $F9 ; new line
#_08BB90: db $AF, $27, $9C, $26, $2E, $27, $2F, $2C ; ぼうがいこうさく
#_08BB98: db $51, $CF, $B9, $70, $5F, $2F, $43, $3E ; を⎵ゴトウさまは
#_08BBA0: db $CF, $2A, $52, $A6, $26, $3A, $47 ; ⎵かんだいにも
#_08BBA7: db $F9 ; new line
#_08BBA8: db $29, $49, $4D, $30, $3A, $CF, $39, $4B ; おゆるしに⎵なら
#_08BBB0: db $4E, $34 ; れた
#_08BBB2: db $FC ; wait for key and new line
#_08BBB3: db $FA ; clear message box
#_08BBB4: db $A6, $9C, $CF, $B9, $70, $5F, $2F, $43 ; だが⎵ゴトウさま
#_08BBBC: db $3A, $CF, $2F, $2A, $4B, $58, $34, $CF ; に⎵さからった⎵
#_08BBC4: db $36, $44, $3E ; つみは
#_08BBC7: db $F9 ; new line
#_08BBC8: db $2B, $28, $39, $26, $94 ; きえない!
#_08BBCD: db $FC ; wait for key and new line
#_08BBCE: db $FA ; clear message box
#_08BBCF: db $2E, $3D, $CF, $29, $52, $39, $CF ; この⎵おんな⎵
#_08BBD6: db $ED ; write female protag name
#_08BBD7: db $3E ; は
#_08BBD8: db $F2, $0B ; prewritten text 0B
#_08BBDA: db $F9 ; new line
#_08BBDB: db $30, $2D, $26, $A6, $94 ; しけいだ!
#_08BBE0: db $FC ; wait for key and new line
#_08BBE1: db $FA ; clear message box
#_08BBE2: db $43, $37 ; まて
#_08BBE4: db $F2, $0B ; prewritten text 0B
#_08BBE6: db $33, $2E, $3A, $CF, $3C, $A3, $44, $9C ; そこに⎵ねずみが
#_08BBEE: db $CF, $2A, $2C, $4E, $37, $4D, $50, $94 ; ⎵かくれてるわ!
#_08BBF6: db $F9 ; new line
#_08BBF7: db $29, $38, $39, $30, $2C, $CF, $A9, $37 ; おとなしく⎵でて
#_08BBFF: db $4B, $58, $30, $55, $26 ; らっしゃい
#_08BC04: db $F9 ; new line
#_08BC05: db $38, $2C, $38, $27, $32, $2B, $3A, $CF ; とくとうせきに⎵
#_08BC0D: db $25, $52, $39, $26, $30, $37, $25, $9F ; あんないしてあげ
#_08BC15: db $4D, $50 ; るわ
#_08BC17: db $FC ; wait for key and new line
#_08BC18: db $D7, $22 ; load scene 22
#_08BC1A: db $D6, $02, $2C, $70, $28 ; place sprite 2C in slot 02 at XY:{70,28}
#_08BC1F: db $FA ; clear message box
#_08BC20: db $2E, $4E, $A9, $CF ; これで⎵
#_08BC24: db $ED ; write female protag name
#_08BC25: db $38, $47, $CF, $29, $50, $2A, $4E, $4A ; とも⎵おわかれよ
#_08BC2D: db $F9 ; new line
#_08BC2E: db $F0 ; write player name
#_08BC2F: db $FC ; wait for key and new line
#_08BC30: db $FA ; clear message box
#_08BC31: db $3E, $A2, $46, $2A, $4B, $CF, $25, $34 ; はじめから⎵あた
#_08BC39: db $30, $51, $CF, $28, $4B, $52, $A9, $26 ; しを⎵えらんでい
#_08BC41: db $4E, $AB ; れば
#_08BC43: db $F9 ; new line
#_08BC44: db $2E, $52, $39, $CF, $2A, $39, $30, $26 ; こんな⎵かなしい
#_08BC4C: db $46, $3A, $CF, $25, $50, $39, $2A, $58 ; めに⎵あわなかっ
#_08BC54: db $34, $3D, $3A ; たのに
#_08BC57: db $F2, $0B ; prewritten text 0B
#_08BC59: db $FC ; wait for key and new line
#_08BC5A: db $FA ; clear message box
#_08BC5B: db $2F, $25, $CF, $48, $58, $37, $29, $30 ; さあ⎵やっておし
#_08BC63: db $43, $26, $94 ; まい!
#_08BC66: db $FC ; wait for key and new line
#_08BC67: db $D6, $02, $00 ; delete sprite in slot 02
#_08BC6A: db $FE, $07, $78 ; ext command 07: draw buffered text then wait 119 frames
#_08BC6D: db $FA ; clear message box
#_08BC6E: db $DE, $00, $00, $EF, $08 ; load 8x demon 00EF
#_08BC73: db $D5, $39 ; send 39 to APU
#_08BC75: db $E4, $00 ; load demon $00
#_08BC77: db $E5, $01, $0F ; [COMMAND E5:01,0F]

;===================================================================================================

Message_00_09_0E:
#_08BC7A: db $E5, $00, $0F ; [COMMAND E5:00,0F]
#_08BC7D: db $D3, $0E ; go to message 0E

;===================================================================================================

Message_00_09_0F:
#_08BC7F: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08BC81: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08BC84: db $D5, $39 ; send 39 to APU
#_08BC86: db $DE, $00, $00, $ED, $08 ; load 8x demon 00ED
#_08BC8B: db $E4, $00 ; load demon $00
#_08BC8D: db $E5, $01, $11 ; [COMMAND E5:01,11]

;===================================================================================================

Message_00_09_10:
#_08BC90: db $E5, $00, $11 ; [COMMAND E5:00,11]
#_08BC93: db $D3, $10 ; go to message 10

;===================================================================================================

Message_00_09_11:
#_08BC95: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08BC97: db $DE, $00, $00, $ED, $04 ; load 4x demon 00ED
#_08BC9C: db $EB, $00, $00, $E9, $04 ; load 4x demon 00E9
#_08BCA1: db $D5, $39 ; send 39 to APU
#_08BCA3: db $E4, $00 ; load demon $00
#_08BCA5: db $E4, $01 ; load demon $01
#_08BCA7: db $E5, $81, $13 ; [COMMAND E5:81,13]

;===================================================================================================

Message_00_09_12:
#_08BCAA: db $E5, $80, $13 ; [COMMAND E5:80,13]
#_08BCAD: db $D3, $12 ; go to message 12

;===================================================================================================

Message_00_09_13:
#_08BCAF: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08BCB1: db $E7, $01 ; call routine 01E5CD with value 02 TODO
#_08BCB3: db $DE, $00, $00, $E9, $04 ; load 4x demon 00E9
#_08BCB8: db $EB, $00, $00, $E2, $02 ; load 2x demon 00E2
#_08BCBD: db $D5, $39 ; send 39 to APU
#_08BCBF: db $E4, $00 ; load demon $00
#_08BCC1: db $E4, $01 ; load demon $01
#_08BCC3: db $E5, $81, $15 ; [COMMAND E5:81,15]

;===================================================================================================

Message_00_09_14:
#_08BCC6: db $E5, $80, $15 ; [COMMAND E5:80,15]
#_08BCC9: db $D3, $14 ; go to message 14

;===================================================================================================

; ゆりこ:
; ここは わたしの まけね«・・・»
Message_00_09_15:
#_08BCCB: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08BCCD: db $E7, $01 ; call routine 01E5CD with value 02 TODO
#_08BCCF: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08BCD2: db $D6, $02, $2C, $70, $28 ; place sprite 2C in slot 02 at XY:{70,28}
#_08BCD7: db $49, $4C, $2E, $9A ; ゆりこ:
#_08BCDB: db $F9 ; new line
#_08BCDC: db $2E, $2E, $3E, $CF, $50, $34, $30, $3D ; ここは⎵わたしの
#_08BCE4: db $CF, $43, $2D, $3C ; ⎵まけね
#_08BCE8: db $F2, $0B ; prewritten text 0B
#_08BCEA: db $FC ; wait for key and new line
#_08BCEB: db $D6, $02, $00 ; delete sprite in slot 02
#_08BCEE: db $FA ; clear message box
#_08BCEF: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames

;===================================================================================================

; [MOMO]:
; ゆめと おなじように たすけてくれたのね
; «ありがとう»
; アジトは もう つかえませんから
; れいの BARに きてください
; «あなたがた»も はやく ここから にげて«・・・»
Message_00_09_16:
#_08BCF2: db $D5, $47 ; send 47 to APU
#_08BCF4: db $D7, $2A ; load scene 2A
#_08BCF6: db $D6, $02, $01, $70, $08 ; place sprite 01 in slot 02 at XY:{70,08}
#_08BCFB: db $D6, $04, $05, $70, $08 ; place sprite 05 in slot 04 at XY:{70,08}
#_08BD00: db $ED ; write female protag name
#_08BD01: db $9A ; :
#_08BD02: db $F9 ; new line
#_08BD03: db $49, $46, $38, $CF, $29, $39, $A2, $4A ; ゆめと⎵おなじよ
#_08BD0B: db $27, $3A, $CF, $34, $31, $2D, $37, $2C ; うに⎵たすけてく
#_08BD13: db $4E, $34, $3D, $3C ; れたのね
#_08BD17: db $F9 ; new line
#_08BD18: db $F2, $0D ; prewritten text 0D
#_08BD1A: db $FC ; wait for key and new line
#_08BD1B: db $D2, $2F, $17 ; test progress bit 2F for message 17
#_08BD1E: db $D6, $02, $00 ; delete sprite in slot 02
#_08BD21: db $D6, $00, $4C, $78, $28 ; place sprite 4C in slot 00 at XY:{78,28}
#_08BD26: db $FA ; clear message box
#_08BD27: db $5D, $BB, $70, $3E, $CF, $47, $27, $CF ; アジトは⎵もう⎵
#_08BD2F: db $36, $2A, $28, $43, $32, $52, $2A, $4B ; つかえませんから
#_08BD37: db $F9 ; new line
#_08BD38: db $4E, $26, $3D, $CF, $0C, $0B, $1C, $3A ; れいの⎵BARに
#_08BD40: db $CF, $2B, $37, $2C, $A6, $2F, $26 ; ⎵きてください
#_08BD47: db $F9 ; new line
#_08BD48: db $F2, $03 ; prewritten text 03
#_08BD4A: db $47, $CF, $3E, $48, $2C, $CF, $2E, $2E ; も⎵はやく⎵ここ
#_08BD52: db $2A, $4B, $CF, $3A, $9F, $37 ; から⎵にげて
#_08BD58: db $F2, $0B ; prewritten text 0B
#_08BD5A: db $FC ; wait for key and new line
#_08BD5B: db $D6, $00, $00 ; delete sprite in slot 00
#_08BD5E: db $D6, $04, $00 ; delete sprite in slot 04
#_08BD61: db $FE, $1A, $26, $08, $08, $00, $00, $00 ; ext command 1A: 26,08,08,00,00,00
#_08BD69: db $D0, $27 ; set progress bit 27

;===================================================================================================

Message_00_09_17:
#_08BD6B: db $FF ; end of message

;===================================================================================================

; [DEMON1]:
; また しんがおの おでましだな
; マカイからの ながたび ごくろう
; おまえは うまく ニンゲンに ばけているな
; «・・・»ん? おまえは ニンゲンか!
Message_00_09_18:
#_08BD6C: db $D2, $1D, $1E ; test progress bit 1D for message 1E
#_08BD6F: db $DE, $00, $00, $D9, $01 ; load 1x demon 00D9
#_08BD74: db $E4, $00 ; load demon $00
#_08BD76: db $F5 ; write demon name from $050A
#_08BD77: db $9A ; :
#_08BD78: db $F9 ; new line
#_08BD79: db $43, $34, $CF, $30, $52, $9C, $29, $3D ; また⎵しんがおの
#_08BD81: db $CF, $29, $A9, $43, $30, $A6, $39 ; ⎵おでましだな
#_08BD88: db $F9 ; new line
#_08BD89: db $7B, $62, $5E, $2A, $4B, $3D, $CF, $39 ; マカイからの⎵な
#_08BD91: db $9C, $34, $AC, $CF, $A0, $2C, $4F, $27 ; がたび⎵ごくろう
#_08BD99: db $FC ; wait for key and new line
#_08BD9A: db $FA ; clear message box
#_08BD9B: db $29, $43, $28, $3E, $CF, $27, $43, $2C ; おまえは⎵うまく
#_08BDA3: db $CF, $72, $8A, $B8, $8A, $3A, $CF, $AB ; ⎵ニンゲンに⎵ば
#_08BDAB: db $2D, $37, $26, $4D, $39 ; けているな
#_08BDB0: db $F9 ; new line
#_08BDB1: db $F2, $0B ; prewritten text 0B
#_08BDB3: db $52, $95, $CF, $29, $43, $28, $3E, $CF ; ん?⎵おまえは⎵
#_08BDBB: db $72, $8A, $B8, $8A, $2A, $94 ; ニンゲンか!
#_08BDC1: db $FC ; wait for key and new line
#_08BDC2: db $E5, $01, $1A ; [COMMAND E5:01,1A]

;===================================================================================================

Message_00_09_19:
#_08BDC5: db $E5, $00, $1A ; [COMMAND E5:00,1A]
#_08BDC8: db $D3, $19 ; go to message 19

;===================================================================================================

Message_00_09_1A:
#_08BDCA: db $FA ; clear message box
#_08BDCB: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08BDCD: db $D0, $1D ; set progress bit 1D
#_08BDCF: db $FF ; end of message

;===================================================================================================

; [DEMON1]:
; おまえ どこから はいってきた!
Message_00_09_1B:
#_08BDD0: db $D2, $1E, $1E ; test progress bit 1E for message 1E
#_08BDD3: db $DE, $00, $00, $D9, $01 ; load 1x demon 00D9
#_08BDD8: db $E4, $00 ; load demon $00
#_08BDDA: db $F5 ; write demon name from $050A
#_08BDDB: db $9A ; :
#_08BDDC: db $F9 ; new line
#_08BDDD: db $29, $43, $28, $CF, $AA, $2E, $2A, $4B ; おまえ⎵どこから
#_08BDE5: db $CF, $3E, $26, $58, $37, $2B, $34, $94 ; ⎵はいってきた!
#_08BDED: db $FC ; wait for key and new line
#_08BDEE: db $FA ; clear message box
#_08BDEF: db $E5, $01, $1D ; [COMMAND E5:01,1D]

;===================================================================================================

Message_00_09_1C:
#_08BDF2: db $E5, $00, $1D ; [COMMAND E5:00,1D]
#_08BDF5: db $D3, $1C ; go to message 1C

;===================================================================================================

Message_00_09_1D:
#_08BDF7: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08BDF9: db $D0, $1E ; set progress bit 1E
#_08BDFB: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
Message_00_09_1E:
#_08BDFC: db $97 ; >
#_08BDFD: db $F2, $2C ; prewritten text 2C
#_08BDFF: db $FC ; wait for key and new line
#_08BE00: db $FF ; end of message

;===================================================================================================

; けんきゅういん:
; «・・・»よくぶじに はいってきたな«・・・»
; そとは«・・・»いったい どうなってる?
; ここでは ひみつの プロジェクトで
; «コンピュータ»の つうしんによる
; «ターミナルシステム»を かいはつしていたんだ
; 2・3にちまえに アクマが おそってきて
; みんな ころされるか ゾンビに された«・・・»
; «・・・»はやく ここから«・・・»
; «・・・»にげろ«・・・»
Message_00_09_1F:
#_08BE01: db $DE, $00, $00, $F2, $01 ; load 1x demon 00F2
#_08BE06: db $E4, $00 ; load demon $00
#_08BE08: db $D2, $1E, $20 ; test progress bit 1E for message 20
#_08BE0B: db $FA ; clear message box
#_08BE0C: db $2D, $52, $2B, $56, $27, $26, $52, $9A ; けんきゅういん:
#_08BE14: db $F9 ; new line
#_08BE15: db $F2, $0B ; prewritten text 0B
#_08BE17: db $4A, $2C, $AD, $A2, $3A, $CF, $3E, $26 ; よくぶじに⎵はい
#_08BE1F: db $58, $37, $2B, $34, $39 ; ってきたな
#_08BE24: db $F2, $0B ; prewritten text 0B
#_08BE26: db $F9 ; new line
#_08BE27: db $33, $38, $3E ; そとは
#_08BE2A: db $F2, $0B ; prewritten text 0B
#_08BE2C: db $26, $58, $34, $26, $CF, $AA, $27, $39 ; いったい⎵どうな
#_08BE34: db $58, $37, $4D, $95 ; ってる?
#_08BE38: db $FC ; wait for key and new line
#_08BE39: db $FA ; clear message box
#_08BE3A: db $2E, $2E, $A9, $3E, $CF, $3F, $44, $36 ; ここでは⎵ひみつ
#_08BE42: db $3D, $CF, $CB, $87, $BB, $8D, $64, $70 ; の⎵プロジェクト
#_08BE4A: db $A9 ; で
#_08BE4B: db $F9 ; new line
#_08BE4C: db $F2, $09 ; prewritten text 09
#_08BE4E: db $3D, $CF, $36, $27, $30, $52, $3A, $4A ; の⎵つうしんによ
#_08BE56: db $4D ; る
#_08BE57: db $F9 ; new line
#_08BE58: db $F2, $90 ; prewritten text 90
#_08BE5A: db $51, $CF, $2A, $26, $3E, $36, $30, $37 ; を⎵かいはつして
#_08BE62: db $26, $34, $52, $A6 ; いたんだ
#_08BE66: db $FC ; wait for key and new line
#_08BE67: db $FA ; clear message box
#_08BE68: db $03, $93, $04, $3A, $35, $43, $28, $3A ; 2・3にちまえに
#_08BE70: db $CF, $5D, $64, $7B, $9C, $CF, $29, $33 ; ⎵アクマが⎵おそ
#_08BE78: db $58, $37, $2B, $37 ; ってきて
#_08BE7C: db $F9 ; new line
#_08BE7D: db $44, $52, $39, $CF, $2E, $4F, $2F, $4E ; みんな⎵ころされ
#_08BE85: db $4D, $2A, $CF, $BE, $8A, $C5, $3A, $CF ; るか⎵ゾンビに⎵
#_08BE8D: db $2F, $4E, $34 ; された
#_08BE90: db $F2, $0B ; prewritten text 0B
#_08BE92: db $FC ; wait for key and new line
#_08BE93: db $FA ; clear message box
#_08BE94: db $F2, $0B ; prewritten text 0B
#_08BE96: db $3E, $48, $2C, $CF, $2E, $2E, $2A, $4B ; はやく⎵ここから
#_08BE9E: db $F2, $0B ; prewritten text 0B
#_08BEA0: db $F9 ; new line
#_08BEA1: db $F2, $0B ; prewritten text 0B
#_08BEA3: db $3A, $9F, $4F ; にげろ
#_08BEA6: db $F2, $0B ; prewritten text 0B
#_08BEA8: db $FC ; wait for key and new line
#_08BEA9: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08BEAB: db $FF ; end of message

;===================================================================================================

; «・・・»«・・・»«・・・»«・・・»
Message_00_09_20:
#_08BEAC: db $F2, $0B ; prewritten text 0B
#_08BEAE: db $F2, $0B ; prewritten text 0B
#_08BEB0: db $F2, $0B ; prewritten text 0B
#_08BEB2: db $F2, $0B ; prewritten text 0B
#_08BEB4: db $FC ; wait for key and new line
#_08BEB5: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08BEB7: db $FF ; end of message

;===================================================================================================

; くるまいすのおとこ:
Message_00_09_21:
#_08BEB8: db $D2, $ED, $29 ; test progress bit ED for message 29
#_08BEBB: db $D5, $47 ; send 47 to APU
#_08BEBD: db $D6, $00, $2D, $70, $28 ; place sprite 2D in slot 00 at XY:{70,28}
#_08BEC2: db $2C, $4D, $43, $26, $31, $3D, $29, $38 ; くるまいすのおと
#_08BECA: db $2E, $9A ; こ:
#_08BECC: db $F9 ; new line
#_08BECD: db $E9, $00, $22 ; go to message 22 maybe TODO
#_08BED0: db $D3, $23 ; go to message 23

;===================================================================================================

; だいじょうぶか? [CHASE]くん
; しっかりしたまえ
; わたしの はなしが きこえるか
Message_00_09_22:
#_08BED2: db $A6, $26, $A2, $57, $27, $AD, $2A, $95 ; だいじょうぶか?
#_08BEDA: db $CF ; ⎵
#_08BEDB: db $F0 ; write player name
#_08BEDC: db $2C, $52 ; くん
#_08BEDE: db $F9 ; new line
#_08BEDF: db $30, $58, $2A, $4C, $30, $34, $43, $28 ; しっかりしたまえ
#_08BEE7: db $F9 ; new line
#_08BEE8: db $50, $34, $30, $3D, $CF, $3E, $39, $30 ; わたしの⎵はなし
#_08BEF0: db $9C, $CF, $2B, $2E, $28, $4D, $2A ; が⎵きこえるか
#_08BEF7: db $F9 ; new line

;===================================================================================================

; よく きたな [CHASE]くん
; ここは «ターミナルシステム»を かいはつしていた
; けんきゅうじょ
; だが ゴトウの ては ここにも のびていた
Message_00_09_23:
#_08BEF8: db $FE, $25, $FF ; ext command 25: something FF TODO
#_08BEFB: db $FE, $23, $FF ; ext command 23: something FF TODO
#_08BEFE: db $FE, $24, $FF ; ext command 24: something FF TODO
#_08BF01: db $4A, $2C, $CF, $2B, $34, $39, $CF ; よく⎵きたな⎵
#_08BF08: db $F0 ; write player name
#_08BF09: db $2C, $52 ; くん
#_08BF0B: db $FC ; wait for key and new line
#_08BF0C: db $FA ; clear message box
#_08BF0D: db $2E, $2E, $3E, $CF ; ここは⎵
#_08BF11: db $F2, $90 ; prewritten text 90
#_08BF13: db $51, $CF, $2A, $26, $3E, $36, $30, $37 ; を⎵かいはつして
#_08BF1B: db $26, $34 ; いた
#_08BF1D: db $F9 ; new line
#_08BF1E: db $2D, $52, $2B, $56, $27, $A2, $57 ; けんきゅうじょ
#_08BF25: db $F9 ; new line
#_08BF26: db $A6, $9C, $CF, $B9, $70, $5F, $3D, $CF ; だが⎵ゴトウの⎵
#_08BF2E: db $37, $3E, $CF, $2E, $2E, $3A, $47, $CF ; ては⎵ここにも⎵
#_08BF36: db $3D, $AC, $37, $26, $34 ; のびていた
#_08BF3B: db $FC ; wait for key and new line
#_08BF3C: db $D1, $13 ; clear progress bit 13
#_08BF3E: db $FA ; clear message box

;===================================================================================================

; «・・・»ところで «アクマしょうかん»«プログラム»は
; «やくにたって いるかね?»
; それは つかいかたが わるいのでは ないかね
Message_00_09_24:
#_08BF3F: db $F2, $0B ; prewritten text 0B
#_08BF41: db $38, $2E, $4F, $A9, $CF ; ところで⎵
#_08BF46: db $F2, $13 ; prewritten text 13
#_08BF48: db $F2, $08 ; prewritten text 08
#_08BF4A: db $3E ; は
#_08BF4B: db $F9 ; new line
#_08BF4C: db $F2, $85 ; prewritten text 85
#_08BF4E: db $F8, $25 ; YES/NO - go to message 25 if YES
#_08BF50: db $D4, $03 ; set text box size to 3
#_08BF52: db $33, $4E, $3E, $CF, $36, $2A, $26, $2A ; それは⎵つかいか
#_08BF5A: db $34, $9C, $CF, $50, $4D, $26, $3D, $A9 ; たが⎵わるいので
#_08BF62: db $3E, $CF, $39, $26, $2A, $3C ; は⎵ないかね
#_08BF68: db $FC ; wait for key and new line

;===================================================================================================

; ナカマにできる アクマのかずは たりているかね?
Message_00_09_25:
#_08BF69: db $FA ; clear message box
#_08BF6A: db $71, $62, $7B, $3A, $A9, $2B, $4D, $CF ; ナカマにできる⎵
#_08BF72: db $5D, $64, $7B, $3D, $2A, $A3, $3E, $CF ; アクマのかずは⎵
#_08BF7A: db $34, $4C, $37, $26, $4D, $2A, $3C, $95 ; たりているかね?
#_08BF82: db $F8, $26 ; YES/NO - go to message 26 if YES
#_08BF84: db $D3, $28 ; go to message 28

;===================================================================================================

; ほんとうに そう おもうかね?
Message_00_09_26:
#_08BF86: db $FA ; clear message box
#_08BF87: db $42, $52, $38, $27, $3A, $CF, $33, $27 ; ほんとうに⎵そう
#_08BF8F: db $CF, $29, $47, $27, $2A, $3C, $95 ; ⎵おもうかね?
#_08BF96: db $F8, $27 ; YES/NO - go to message 27 if YES
#_08BF98: db $D3, $28 ; go to message 28

;===================================================================================================

; そうか せっかく
; ナカマに できる アクマの かずを
; ふやして あげようと おもったんだが«・・・»
Message_00_09_27:
#_08BF9A: db $D4, $03 ; set text box size to 3
#_08BF9C: db $33, $27, $2A, $CF, $32, $58, $2A, $2C ; そうか⎵せっかく
#_08BFA4: db $F9 ; new line
#_08BFA5: db $71, $62, $7B, $3A, $CF, $A9, $2B, $4D ; ナカマに⎵できる
#_08BFAD: db $CF, $5D, $64, $7B, $3D, $CF, $2A, $A3 ; ⎵アクマの⎵かず
#_08BFB5: db $51 ; を
#_08BFB6: db $F9 ; new line
#_08BFB7: db $40, $48, $30, $37, $CF, $25, $9F, $4A ; ふやして⎵あげよ
#_08BFBF: db $27, $38, $CF, $29, $47, $58, $34, $52 ; うと⎵おもったん
#_08BFC7: db $A6, $9C ; だが
#_08BFC9: db $F2, $0B ; prewritten text 0B
#_08BFCB: db $FC ; wait for key and new line
#_08BFCC: db $D3, $25 ; go to message 25

;===================================================================================================

; では «コンピュータ»の メモリーを
; ふやしてあげよう
; «・・・・・・・・・・・・・・・»
; «できた これで ストックできる»
; «ナカマが2たい ふえた»
; «わたしの アクマしょうかんプログラムも»
; より «つかいこなせる»だろう
Message_00_09_28:
#_08BFCE: db $D4, $03 ; set text box size to 3
#_08BFD0: db $A9, $3E, $CF ; では⎵
#_08BFD3: db $F2, $09 ; prewritten text 09
#_08BFD5: db $3D, $CF, $7E, $7F, $84, $5A, $51 ; の⎵メモリーを
#_08BFDC: db $F9 ; new line
#_08BFDD: db $40, $48, $30, $37, $25, $9F, $4A, $27 ; ふやしてあげよう
#_08BFE5: db $FC ; wait for key and new line
#_08BFE6: db $FA ; clear message box
#_08BFE7: db $F2, $54 ; prewritten text 54
#_08BFE9: db $F9 ; new line
#_08BFEA: db $4A, $4C, $CF ; より⎵
#_08BFED: db $F2, $55 ; prewritten text 55
#_08BFEF: db $A6, $4F, $27 ; だろう
#_08BFF2: db $FC ; wait for key and new line
#_08BFF3: db $D0, $ED ; set progress bit ED
#_08BFF5: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
Message_00_09_29:
#_08BFF6: db $97 ; >
#_08BFF7: db $F2, $2C ; prewritten text 2C
#_08BFF9: db $FC ; wait for key and new line
#_08BFFA: db $FF ; end of message

;===================================================================================================

; おとこ:
; わたしは かいげん«しれいかん»の ゴトウである!
; せかいの ぶんめいは くさりきっている
; それは だいちガイアからの さくしゅの うえに
; なりたつ ぶんめい だからである
; さべつ ひんこん たたかいが
; せかいを おおう いま
; «われわれ»は アクマと よばれる
; いにしえの かみがみを めざめさせた
; それは しんの ききに そなえるためである
; ニッポン まっさつけいかく!
; この きょうふの いんぼうを そしせんがため
; «われわれ»は いにしえの かみがみの
; ちからを かりた
; かみがみと じんるいが きょうぞんする
; ユートピアを きずきあげる ために!
; >えんぜつは つづいている
Message_00_09_2A:
#_08BFFB: db $D5, $46 ; send 46 to APU
#_08BFFD: db $D7, $20 ; load scene 20
#_08BFFF: db $FE, $3A, $02, $00 ; ext command 3A: 02 00 TODO
#_08C003: db $FE, $07, $FF ; ext command 07: draw buffered text then wait 254 frames
#_08C006: db $D2, $2B, $2B ; test progress bit 2B for message 2B
#_08C009: db $D6, $00, $99, $60, $20 ; place sprite 99 in slot 00 at XY:{60,20}
#_08C00E: db $29, $38, $2E, $9A ; おとこ:
#_08C012: db $F9 ; new line
#_08C013: db $50, $34, $30, $3E, $CF, $2A, $26, $9F ; わたしは⎵かいげ
#_08C01B: db $52 ; ん
#_08C01C: db $F2, $20 ; prewritten text 20
#_08C01E: db $3D, $CF, $B9, $70, $5F, $A9, $25, $4D ; の⎵ゴトウである
#_08C026: db $94 ; !
#_08C027: db $FC ; wait for key and new line
#_08C028: db $FA ; clear message box
#_08C029: db $32, $2A, $26, $3D, $CF, $AD, $52, $46 ; せかいの⎵ぶんめ
#_08C031: db $26, $3E, $CF, $2C, $2F, $4C, $2B, $58 ; いは⎵くさりきっ
#_08C039: db $37, $26, $4D ; ている
#_08C03C: db $F9 ; new line
#_08C03D: db $33, $4E, $3E, $CF, $A6, $26, $35, $B5 ; それは⎵だいちガ
#_08C045: db $5E, $5D, $2A, $4B, $3D, $CF, $2F, $2C ; イアからの⎵さく
#_08C04D: db $30, $56, $3D, $CF, $27, $28, $3A ; しゅの⎵うえに
#_08C054: db $F9 ; new line
#_08C055: db $39, $4C, $34, $36, $CF, $AD, $52, $46 ; なりたつ⎵ぶんめ
#_08C05D: db $26, $CF, $A6, $2A, $4B, $A9, $25, $4D ; い⎵だからである
#_08C065: db $F9 ; new line
#_08C066: db $2F, $AE, $36, $CF, $3F, $52, $2E, $52 ; さべつ⎵ひんこん
#_08C06E: db $CF, $34, $34, $2A, $26, $9C ; ⎵たたかいが
#_08C074: db $F9 ; new line
#_08C075: db $32, $2A, $26, $51, $CF, $29, $29, $27 ; せかいを⎵おおう
#_08C07D: db $CF, $26, $43 ; ⎵いま
#_08C080: db $F9 ; new line
#_08C081: db $F2, $02 ; prewritten text 02
#_08C083: db $3E, $CF, $5D, $64, $7B, $38, $CF, $4A ; は⎵アクマと⎵よ
#_08C08B: db $AB, $4E, $4D ; ばれる
#_08C08E: db $F9 ; new line
#_08C08F: db $26, $3A, $30, $28, $3D, $CF, $2A, $44 ; いにしえの⎵かみ
#_08C097: db $9C, $44, $51, $CF, $46, $A1, $46, $2F ; がみを⎵めざめさ
#_08C09F: db $32, $34 ; せた
#_08C0A1: db $FC ; wait for key and new line
#_08C0A2: db $FA ; clear message box
#_08C0A3: db $33, $4E, $3E, $CF, $30, $52, $3D, $CF ; それは⎵しんの⎵
#_08C0AB: db $2B, $2B, $3A, $CF, $33, $39, $28, $4D ; ききに⎵そなえる
#_08C0B3: db $34, $46, $A9, $25, $4D ; ためである
#_08C0B8: db $F9 ; new line
#_08C0B9: db $72, $92, $CD, $8A, $CF, $43, $58, $2F ; ニッポン⎵まっさ
#_08C0C1: db $36, $2D, $26, $2A, $2C, $94 ; つけいかく!
#_08C0C7: db $F9 ; new line
#_08C0C8: db $2E, $3D, $CF, $2B, $57, $27, $40, $3D ; この⎵きょうふの
#_08C0D0: db $CF, $26, $52, $AF, $27, $51, $CF, $33 ; ⎵いんぼうを⎵そ
#_08C0D8: db $30, $32, $52, $9C, $34, $46 ; しせんがため
#_08C0DE: db $F9 ; new line
#_08C0DF: db $F2, $02 ; prewritten text 02
#_08C0E1: db $3E, $CF, $26, $3A, $30, $28, $3D, $CF ; は⎵いにしえの⎵
#_08C0E9: db $2A, $44, $9C, $44, $3D ; かみがみの
#_08C0EE: db $F9 ; new line
#_08C0EF: db $35, $2A, $4B, $51, $CF, $2A, $4C, $34 ; ちからを⎵かりた
#_08C0F7: db $F9 ; new line
#_08C0F8: db $2A, $44, $9C, $44, $38, $CF, $A2, $52 ; かみがみと⎵じん
#_08C100: db $4D, $26, $9C, $CF, $2B, $57, $27, $A5 ; るいが⎵きょうぞ
#_08C108: db $52, $31, $4D ; んする
#_08C10B: db $F9 ; new line
#_08C10C: db $81, $5A, $70, $CA, $5D, $51, $CF, $2B ; ユートピアを⎵き
#_08C114: db $A3, $2B, $25, $9F, $4D, $CF, $34, $46 ; ずきあげる⎵ため
#_08C11C: db $3A, $94 ; に!
#_08C11E: db $FC ; wait for key and new line
#_08C11F: db $D4, $03 ; set text box size to 3
#_08C121: db $97, $28, $52, $A4, $36, $3E, $CF, $36 ; >えんぜつは⎵つ
#_08C129: db $A8, $26, $37, $26, $4D ; づいている
#_08C12E: db $FC ; wait for key and new line
#_08C12F: db $FF ; end of message

;===================================================================================================

; >«なにも うつっていない»
Message_00_09_2B:
#_08C130: db $97 ; >
#_08C131: db $F2, $6E ; prewritten text 6E
#_08C133: db $FC ; wait for key and new line
#_08C134: db $FF ; end of message

;===================================================================================================

; くみちょう:
; «クーデター»やら «アメリカ»ぐんやら
; あげくには アクマまで でてきて
; わしの シマで すきほうだい やりくさって!
; やつらは ぎりも すじも とおさん
; くされ ゲドウじゃ
; ほおっておけば «トウキョウ»は どうなる«・・・»
Message_00_09_2C:
#_08C135: db $D2, $2F, $38 ; test progress bit 2F for message 38
#_08C138: db $D7, $05 ; load scene 05
#_08C13A: db $D5, $54 ; send 54 to APU
#_08C13C: db $D6, $00, $68, $70, $28 ; place sprite 68 in slot 00 at XY:{70,28}
#_08C141: db $2C, $44, $35, $57, $27, $9A ; くみちょう:
#_08C147: db $F9 ; new line
#_08C148: db $F2, $17 ; prewritten text 17
#_08C14A: db $48, $4B, $CF ; やら⎵
#_08C14D: db $F2, $1B ; prewritten text 1B
#_08C14F: db $9E, $52, $48, $4B ; ぐんやら
#_08C153: db $F9 ; new line
#_08C154: db $25, $9F, $2C, $3A, $3E, $CF, $5D, $64 ; あげくには⎵アク
#_08C15C: db $7B, $43, $A9, $CF, $A9, $37, $2B, $37 ; マまで⎵でてきて
#_08C164: db $F9 ; new line
#_08C165: db $50, $30, $3D, $CF, $68, $7B, $A9, $CF ; わしの⎵シマで⎵
#_08C16D: db $31, $2B, $42, $27, $A6, $26, $CF, $48 ; すきほうだい⎵や
#_08C175: db $4C, $2C, $2F, $58, $37, $94 ; りくさって!
#_08C17B: db $FC ; wait for key and new line
#_08C17C: db $FA ; clear message box
#_08C17D: db $48, $36, $4B, $3E, $CF, $9D, $4C, $47 ; やつらは⎵ぎりも
#_08C185: db $CF, $31, $A2, $47, $CF, $38, $29, $2F ; ⎵すじも⎵とおさ
#_08C18D: db $52 ; ん
#_08C18E: db $F9 ; new line
#_08C18F: db $2C, $2F, $4E, $CF, $B8, $C3, $5F, $A2 ; くされ⎵ゲドウじ
#_08C197: db $55 ; ゃ
#_08C198: db $F9 ; new line
#_08C199: db $42, $29, $58, $37, $29, $2D, $AB, $CF ; ほおっておけば⎵
#_08C1A1: db $F2, $1C ; prewritten text 1C
#_08C1A3: db $3E, $CF, $AA, $27, $39, $4D ; は⎵どうなる
#_08C1A9: db $F2, $0B ; prewritten text 0B
#_08C1AB: db $FC ; wait for key and new line
#_08C1AC: db $FF ; end of message

;===================================================================================================

; へいし:
; みんかんじんは «たちいりきんし»だ! かえれ!
; なに? [ITEM]を もっているな
; «・・・»よし とおっていいぞ
Message_00_09_2D:
#_08C1AD: db $FE, $2A ; ext command 2A: call routine 02E87C TODO
#_08C1AF: db $D2, $2B, $30 ; test progress bit 2B for message 30
#_08C1B2: db $D6, $00, $5B, $70, $28 ; place sprite 5B in slot 00 at XY:{70,28}
#_08C1B7: db $D6, $01, $5A, $40, $28 ; place sprite 5A in slot 01 at XY:{40,28}
#_08C1BC: db $D6, $02, $5A, $A0, $28 ; place sprite 5A in slot 02 at XY:{A0,28}
#_08C1C1: db $D6, $03, $5F, $38, $48 ; place sprite 5F in slot 03 at XY:{38,48}
#_08C1C6: db $D6, $04, $5F, $88, $48 ; place sprite 5F in slot 04 at XY:{88,48}
#_08C1CB: db $41, $26, $30, $9A ; へいし:
#_08C1CF: db $F9 ; new line
#_08C1D0: db $D2, $0B, $2F ; test progress bit 0B for message 2F
#_08C1D3: db $44, $52, $2A, $52, $A2, $52, $3E, $CF ; みんかんじんは⎵
#_08C1DB: db $F2, $0E ; prewritten text 0E
#_08C1DD: db $A6, $94, $CF, $2A, $28, $4E, $94 ; だ!⎵かえれ!
#_08C1E4: db $FC ; wait for key and new line
#_08C1E5: db $E1, $F0 ; set $0A50 to item F0
#_08C1E7: db $DD, $F2, $31 ; go to message 31 if missing item F2
#_08C1EA: db $FA ; clear message box
#_08C1EB: db $39, $3A, $95, $CF ; なに?⎵
#_08C1EF: db $F3 ; write item name from $0A50
#_08C1F0: db $51, $CF, $47, $58, $37, $26, $4D, $39 ; を⎵もっているな
#_08C1F8: db $F9 ; new line
#_08C1F9: db $F2, $0B ; prewritten text 0B
#_08C1FB: db $4A, $30, $CF, $38, $29, $58, $37, $26 ; よし⎵とおってい
#_08C203: db $26, $A5 ; いぞ
#_08C205: db $FC ; wait for key and new line

;===================================================================================================

Message_00_09_2E:
#_08C206: db $D0, $0B ; set progress bit 0B
#_08C208: db $FE, $1A, $EF, $8A, $00, $00, $03, $08 ; ext command 1A: EF,8A,00,00,03,08
#_08C210: db $FF ; end of message

;===================================================================================================

; よし とおれ!
Message_00_09_2F:
#_08C211: db $4A, $30, $CF, $38, $29, $4E, $94 ; よし⎵とおれ!
#_08C218: db $FC ; wait for key and new line
#_08C219: db $D2, $0B, $31 ; test progress bit 0B for message 31
#_08C21C: db $D3, $2E ; go to message 2E

;===================================================================================================

; >«だれもいない»
Message_00_09_30:
#_08C21E: db $97 ; >
#_08C21F: db $F2, $2C ; prewritten text 2C
#_08C221: db $FC ; wait for key and new line
#_08C222: db $D2, $0B, $31 ; test progress bit 0B for message 31
#_08C225: db $D3, $2E ; go to message 2E

;===================================================================================================

Message_00_09_31:
#_08C227: db $D1, $0B ; clear progress bit 0B
#_08C229: db $FE, $1A, $EF, $8C, $00, $00, $03, $08 ; ext command 1A: EF,8C,00,00,03,08
#_08C231: db $FF ; end of message

;===================================================================================================

Message_00_09_32:
#_08C232: db $FE, $2A ; ext command 2A: call routine 02E87C TODO
#_08C234: db $D5, $54 ; send 54 to APU
#_08C236: db $D6, $00, $B0, $70, $38 ; place sprite B0 in slot 00 at XY:{70,38}

;===================================================================================================

; «みすぼらしいおとこ:»
; よお そこの にいちゃん
; なんか めぐんでくれよお
; もう なんにちも たべてないんだよお
; たのむよ なあ
; >おとこに かねを わたしますか?
; [JIMMY]:
; かわいそうだから すこし あげましょう
Message_00_09_33:
#_08C23B: db $FA ; clear message box
#_08C23C: db $F2, $91 ; prewritten text 91
#_08C23E: db $4A, $29, $CF, $33, $2E, $3D, $CF, $3A ; よお⎵そこの⎵に
#_08C246: db $26, $35, $55, $52 ; いちゃん
#_08C24A: db $F9 ; new line
#_08C24B: db $39, $52, $2A, $CF, $46, $9E, $52, $A9 ; なんか⎵めぐんで
#_08C253: db $2C, $4E, $4A, $29 ; くれよお
#_08C257: db $FC ; wait for key and new line
#_08C258: db $FA ; clear message box
#_08C259: db $47, $27, $CF, $39, $52, $3A, $35, $47 ; もう⎵なんにちも
#_08C261: db $CF, $34, $AE, $37, $39, $26, $52, $A6 ; ⎵たべてないんだ
#_08C269: db $4A, $29 ; よお
#_08C26B: db $F9 ; new line
#_08C26C: db $34, $3D, $45, $4A, $CF, $39, $25 ; たのむよ⎵なあ
#_08C273: db $FC ; wait for key and new line
#_08C274: db $FA ; clear message box
#_08C275: db $97, $29, $38, $2E, $3A, $CF, $2A, $3C ; >おとこに⎵かね
#_08C27D: db $51, $CF, $50, $34, $30, $43, $31, $2A ; を⎵わたしますか
#_08C285: db $95 ; ?
#_08C286: db $F9 ; new line
#_08C287: db $F8, $34 ; YES/NO - go to message 34 if YES
#_08C289: db $D4, $03 ; set text box size to 3
#_08C28B: db $EE ; write lawful hero name
#_08C28C: db $9A ; :
#_08C28D: db $F9 ; new line
#_08C28E: db $2A, $50, $26, $33, $27, $A6, $2A, $4B ; かわいそうだから
#_08C296: db $CF, $31, $2E, $30, $CF, $25, $9F, $43 ; ⎵すこし⎵あげま
#_08C29E: db $30, $57, $27 ; しょう
#_08C2A1: db $FC ; wait for key and new line
#_08C2A2: db $D3, $33 ; go to message 33

;===================================================================================================

; [HIM]:
; かねの むだだぜ やめとけよ
; >[CHASE]は
; すこし おかねを わたそうとした
; «みすぼらしいおとこ:»
; «・・・»なんだ こりゃ!?
; マッカだせよ ℏじゃなけりゃ
; なにも かえねえよ
; びんぼうにんめ
; «シンジュク»の オザワの どれいに なっちまえ
; «・・・»«シンジュク»も しらねえのかよ
; ここから キタにでて ニシにいけば すぐだ
; >[LEADER]の もっていた ¥は
; かみくずどうぜんに なってしまった
Message_00_09_34:
#_08C2A4: db $D4, $03 ; set text box size to 3
#_08C2A6: db $EF ; write chaos hero name
#_08C2A7: db $9A ; :
#_08C2A8: db $F9 ; new line
#_08C2A9: db $2A, $3C, $3D, $CF, $45, $A6, $A6, $A4 ; かねの⎵むだだぜ
#_08C2B1: db $CF, $48, $46, $38, $2D, $4A ; ⎵やめとけよ
#_08C2B7: db $FC ; wait for key and new line
#_08C2B8: db $D9, $01, $00, $00, $37 ; go to message 37 if money < 1
#_08C2BD: db $FA ; clear message box
#_08C2BE: db $97 ; >
#_08C2BF: db $F0 ; write player name
#_08C2C0: db $3E ; は
#_08C2C1: db $F9 ; new line
#_08C2C2: db $31, $2E, $30, $CF, $29, $2A, $3C, $51 ; すこし⎵おかねを
#_08C2CA: db $CF, $50, $34, $33, $27, $38, $30, $34 ; ⎵わたそうとした
#_08C2D2: db $FC ; wait for key and new line
#_08C2D3: db $FA ; clear message box
#_08C2D4: db $F2, $91 ; prewritten text 91
#_08C2D6: db $F2, $0B ; prewritten text 0B
#_08C2D8: db $39, $52, $A6, $CF, $2E, $4C, $55, $94 ; なんだ⎵こりゃ!
#_08C2E0: db $95 ; ?
#_08C2E1: db $F9 ; new line
#_08C2E2: db $7B, $92, $62, $A6, $32, $4A, $CF, $5C ; マッカだせよ⎵ℏ
#_08C2EA: db $A2, $55, $39, $2D, $4C, $55 ; じゃなけりゃ
#_08C2F0: db $F9 ; new line
#_08C2F1: db $39, $3A, $47, $CF, $2A, $28, $3C, $28 ; なにも⎵かえねえ
#_08C2F9: db $4A ; よ
#_08C2FA: db $FC ; wait for key and new line
#_08C2FB: db $FA ; clear message box
#_08C2FC: db $AC, $52, $AF, $27, $3A, $52, $46 ; びんぼうにんめ
#_08C303: db $F9 ; new line
#_08C304: db $F2, $18 ; prewritten text 18
#_08C306: db $3D, $CF, $61, $BA, $88, $3D, $CF, $AA ; の⎵オザワの⎵ど
#_08C30E: db $4E, $26, $3A, $CF, $39, $58, $35, $43 ; れいに⎵なっちま
#_08C316: db $28 ; え
#_08C317: db $F9 ; new line
#_08C318: db $F2, $0B ; prewritten text 0B
#_08C31A: db $F2, $18 ; prewritten text 18
#_08C31C: db $47, $CF, $30, $4B, $3C, $28, $3D, $2A ; も⎵しらねえのか
#_08C324: db $4A ; よ
#_08C325: db $F9 ; new line
#_08C326: db $2E, $2E, $2A, $4B, $CF, $63, $6C, $3A ; ここから⎵キタに
#_08C32E: db $A9, $37, $CF, $72, $68, $3A, $26, $2D ; でて⎵ニシにいけ
#_08C336: db $AB, $CF, $31, $9E, $A6 ; ば⎵すぐだ
#_08C33B: db $FC ; wait for key and new line
#_08C33C: db $D4, $03 ; set text box size to 3
#_08C33E: db $97 ; >
#_08C33F: db $F1 ; write leader's name for team
#_08C340: db $3D, $CF, $47, $58, $37, $26, $34, $CF ; の⎵もっていた⎵
#_08C348: db $5B, $3E ; ¥は
#_08C34A: db $F9 ; new line
#_08C34B: db $2A, $44, $2C, $A3, $AA, $27, $A4, $52 ; かみくずどうぜん
#_08C353: db $3A, $CF, $39, $58, $37, $30, $43, $58 ; に⎵なってしまっ
#_08C35B: db $34 ; た
#_08C35C: db $FC ; wait for key and new line

;===================================================================================================

Message_00_09_35:
#_08C35D: db $D9, $E8, $03, $00, $36 ; go to message 36 if money < 1000
#_08C362: db $DA, $18, $FC, $FF ; take 1000 money
#_08C366: db $E1, $FE ; set $0A50 to item FE
#_08C368: db $FE, $3C, $36 ; ext command 3C: go to message 36 if no space for item
#_08C36B: db $FE, $28 ; ext command 28: add item to inventory from $0A50
#_08C36D: db $D3, $35 ; go to message 35

;===================================================================================================

; «みすぼらしいおとこ:»
; けっ とっとと きえな!
Message_00_09_36:
#_08C36F: db $DA, $18, $FC, $FF ; take 1000 money
#_08C373: db $D0, $EC ; set progress bit EC
#_08C375: db $D4, $03 ; set text box size to 3
#_08C377: db $F2, $91 ; prewritten text 91
#_08C379: db $2D, $58, $CF, $38, $58, $38, $38, $CF ; けっ⎵とっとと⎵
#_08C381: db $2B, $28, $39, $94 ; きえな!
#_08C385: db $FC ; wait for key and new line
#_08C386: db $FF ; end of message

;===================================================================================================

; «みすぼらしいおとこ:»
; なんだ かね もってねえのか
; マッカを かせげよ ℏをよ
Message_00_09_37:
#_08C387: db $F2, $91 ; prewritten text 91
#_08C389: db $39, $52, $A6, $CF, $2A, $3C, $CF, $47 ; なんだ⎵かね⎵も
#_08C391: db $58, $37, $3C, $28, $3D, $2A ; ってねえのか
#_08C397: db $F9 ; new line
#_08C398: db $7B, $92, $62, $51, $CF, $2A, $32, $9F ; マッカを⎵かせげ
#_08C3A0: db $4A, $CF, $5C, $51, $4A ; よ⎵ℏをよ
#_08C3A5: db $FC ; wait for key and new line
#_08C3A6: db $D0, $EC ; set progress bit EC
#_08C3A8: db $FF ; end of message

;===================================================================================================

; ちゅうねんのおとこ:
; きみたちは わかくて いせいが いいね
; わたしは このまちを おさめている
; オザワ というものだ
; みんなが あんしんして
; くらせることだけを かんがえて いるのだよ
; [HIM]:
; おまえは オザワ«・・・»オザワだな!
; おれの ことを わすれたとは いわせんぞ!
; オザワ:
; さて なんの ことやら«・・・»
; わたしは いそがしい
; またこんどに してくれ
Message_00_09_38:
#_08C3A9: db $D7, $24 ; load scene 24
#_08C3AB: db $D5, $46 ; send 46 to APU
#_08C3AD: db $D2, $47, $3A ; test progress bit 47 for message 3A
#_08C3B0: db $DE, $01, $00, $07, $01 ; load 1x demon 0107
#_08C3B5: db $D6, $00, $A8, $70, $28 ; place sprite A8 in slot 00 at XY:{70,28}
#_08C3BA: db $D2, $48, $3B ; test progress bit 48 for message 3B
#_08C3BD: db $35, $56, $27, $3C, $52, $3D, $29, $38 ; ちゅうねんのおと
#_08C3C5: db $2E, $9A ; こ:
#_08C3C7: db $F9 ; new line
#_08C3C8: db $2B, $44, $34, $35, $3E, $CF, $50, $2A ; きみたちは⎵わか
#_08C3D0: db $2C, $37, $CF, $26, $32, $26, $9C, $CF ; くて⎵いせいが⎵
#_08C3D8: db $26, $26, $3C ; いいね
#_08C3DB: db $FC ; wait for key and new line
#_08C3DC: db $FA ; clear message box
#_08C3DD: db $50, $34, $30, $3E, $CF, $2E, $3D, $43 ; わたしは⎵このま
#_08C3E5: db $35, $51, $CF, $29, $2F, $46, $37, $26 ; ちを⎵おさめてい
#_08C3ED: db $4D ; る
#_08C3EE: db $F9 ; new line
#_08C3EF: db $61, $BA, $88, $CF, $38, $26, $27, $47 ; オザワ⎵というも
#_08C3F7: db $3D, $A6 ; のだ
#_08C3F9: db $FC ; wait for key and new line
#_08C3FA: db $FA ; clear message box
#_08C3FB: db $44, $52, $39, $9C, $CF, $25, $52, $30 ; みんなが⎵あんし
#_08C403: db $52, $30, $37 ; んして
#_08C406: db $F9 ; new line
#_08C407: db $2C, $4B, $32, $4D, $2E, $38, $A6, $2D ; くらせることだけ
#_08C40F: db $51, $CF, $2A, $52, $9C, $28, $37, $CF ; を⎵かんがえて⎵
#_08C417: db $26, $4D, $3D, $A6, $4A ; いるのだよ
#_08C41C: db $FC ; wait for key and new line
#_08C41D: db $E9, $03, $39 ; go to message 39 maybe TODO
#_08C420: db $FA ; clear message box
#_08C421: db $EF ; write chaos hero name
#_08C422: db $9A ; :
#_08C423: db $F9 ; new line
#_08C424: db $29, $43, $28, $3E, $CF, $61, $BA, $88 ; おまえは⎵オザワ
#_08C42C: db $F2, $0B ; prewritten text 0B
#_08C42E: db $61, $BA, $88, $A6, $39, $94 ; オザワだな!
#_08C434: db $F9 ; new line
#_08C435: db $29, $4E, $3D, $CF, $2E, $38, $51, $CF ; おれの⎵ことを⎵
#_08C43D: db $50, $31, $4E, $34, $38, $3E, $CF, $26 ; わすれたとは⎵い
#_08C445: db $50, $32, $52, $A5, $94 ; わせんぞ!
#_08C44A: db $FC ; wait for key and new line
#_08C44B: db $FA ; clear message box
#_08C44C: db $61, $BA, $88, $9A ; オザワ:
#_08C450: db $F9 ; new line
#_08C451: db $2F, $37, $CF, $39, $52, $3D, $CF, $2E ; さて⎵なんの⎵こ
#_08C459: db $38, $48, $4B ; とやら
#_08C45C: db $F2, $0B ; prewritten text 0B
#_08C45E: db $F9 ; new line
#_08C45F: db $50, $34, $30, $3E, $CF, $26, $33, $9C ; わたしは⎵いそが
#_08C467: db $30, $26 ; しい
#_08C469: db $F9 ; new line
#_08C46A: db $43, $34, $2E, $52, $AA, $3A, $CF, $30 ; またこんどに⎵し
#_08C472: db $37, $2C, $4E ; てくれ
#_08C475: db $FC ; wait for key and new line
#_08C476: db $D6, $00, $00 ; delete sprite in slot 00
#_08C479: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames

;===================================================================================================

Message_00_09_39:
#_08C47C: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
Message_00_09_3A:
#_08C47D: db $FA ; clear message box
#_08C47E: db $97 ; >
#_08C47F: db $F2, $2C ; prewritten text 2C
#_08C481: db $FC ; wait for key and new line
#_08C482: db $FF ; end of message

;===================================================================================================

; オザワ:
; «・・・»おっと [ITEM]を もっているな
; そんなものを つかったら
; [CLASS] [DEMON1]でさえ ふういんされてしまう
; その あぶない ものを
; すててきたら また あってやろう
; では しつれいするよ
Message_00_09_3B:
#_08C483: db $61, $BA, $88, $9A ; オザワ:
#_08C487: db $F9 ; new line
#_08C488: db $DD, $E1, $3C ; go to message 3C if missing item E1
#_08C48B: db $E1, $E1 ; set $0A50 to item E1
#_08C48D: db $F2, $0B ; prewritten text 0B
#_08C48F: db $29, $58, $38, $CF ; おっと⎵
#_08C493: db $F3 ; write item name from $0A50
#_08C494: db $51, $CF, $47, $58, $37, $26, $4D, $39 ; を⎵もっているな
#_08C49C: db $F9 ; new line
#_08C49D: db $33, $52, $39, $47, $3D, $51, $CF, $36 ; そんなものを⎵つ
#_08C4A5: db $2A, $58, $34, $4B ; かったら
#_08C4A9: db $F9 ; new line
#_08C4AA: db $DE, $01, $00, $09, $01 ; load 1x demon 0109
#_08C4AF: db $F6 ; write class name from $0506
#_08C4B0: db $CF ; ⎵
#_08C4B1: db $F5 ; write demon name from $050A
#_08C4B2: db $A9, $2F, $28, $CF, $40, $27, $26, $52 ; でさえ⎵ふういん
#_08C4BA: db $2F, $4E, $37, $30, $43, $27 ; されてしまう
#_08C4C0: db $FC ; wait for key and new line
#_08C4C1: db $FA ; clear message box
#_08C4C2: db $33, $3D, $CF, $25, $AD, $39, $26, $CF ; その⎵あぶない⎵
#_08C4CA: db $47, $3D, $51 ; ものを
#_08C4CD: db $F9 ; new line
#_08C4CE: db $31, $37, $37, $2B, $34, $4B, $CF, $43 ; すててきたら⎵ま
#_08C4D6: db $34, $CF, $25, $58, $37, $48, $4F, $27 ; た⎵あってやろう
#_08C4DE: db $F9 ; new line
#_08C4DF: db $A9, $3E, $CF, $30, $36, $4E, $26, $31 ; では⎵しつれいす
#_08C4E7: db $4D, $4A ; るよ
#_08C4E9: db $FC ; wait for key and new line
#_08C4EA: db $FF ; end of message

;===================================================================================================

; このわたしに なにかようかね?
; [HIM]:
; オザワ! おまえは むかしから
; かわっちゃいねえな
; よわいものを むりやりおさえつけて
; しはいする やりかたは そのままだ!
; オザワ:
; ほほう わかぞうが たわごとを ぬかしおって
; わたしのやりかたが きにいらんと いうのか?
; だが わたしに したがっていれば
; アクマに おそわれず あれはてたせかいで
; いきていけるんだぞ
; [HIM]:
; うるさい! きさまだけは ぜったい ゆるさん!
; オザワ:
; ききわけのないやつめ«・・・»[DEMON1]さま
; この めざわりな ガキどもを
; しまつしてください!
Message_00_09_3C:
#_08C4EB: db $D2, $49, $40 ; test progress bit 49 for message 40
#_08C4EE: db $2E, $3D, $50, $34, $30, $3A, $CF, $39 ; このわたしに⎵な
#_08C4F6: db $3A, $2A, $4A, $27, $2A, $3C, $95 ; にかようかね?
#_08C4FD: db $FC ; wait for key and new line
#_08C4FE: db $E9, $0C, $39 ; go to message 39 maybe TODO
#_08C501: db $FA ; clear message box
#_08C502: db $EF ; write chaos hero name
#_08C503: db $9A ; :
#_08C504: db $F9 ; new line
#_08C505: db $61, $BA, $88, $94, $CF, $29, $43, $28 ; オザワ!⎵おまえ
#_08C50D: db $3E, $CF, $45, $2A, $30, $2A, $4B ; は⎵むかしから
#_08C514: db $F9 ; new line
#_08C515: db $2A, $50, $58, $35, $55, $26, $3C, $28 ; かわっちゃいねえ
#_08C51D: db $39 ; な
#_08C51E: db $FC ; wait for key and new line
#_08C51F: db $FA ; clear message box
#_08C520: db $4A, $50, $26, $47, $3D, $51, $CF, $45 ; よわいものを⎵む
#_08C528: db $4C, $48, $4C, $29, $2F, $28, $36, $2D ; りやりおさえつけ
#_08C530: db $37 ; て
#_08C531: db $F9 ; new line
#_08C532: db $30, $3E, $26, $31, $4D, $CF, $48, $4C ; しはいする⎵やり
#_08C53A: db $2A, $34, $3E, $CF, $33, $3D, $43, $43 ; かたは⎵そのまま
#_08C542: db $A6, $94 ; だ!
#_08C544: db $FC ; wait for key and new line
#_08C545: db $FA ; clear message box
#_08C546: db $61, $BA, $88, $9A ; オザワ:
#_08C54A: db $F9 ; new line
#_08C54B: db $42, $42, $27, $CF, $50, $2A, $A5, $27 ; ほほう⎵わかぞう
#_08C553: db $9C, $CF, $34, $50, $A0, $38, $51, $CF ; が⎵たわごとを⎵
#_08C55B: db $3B, $2A, $30, $29, $58, $37 ; ぬかしおって
#_08C561: db $F9 ; new line
#_08C562: db $50, $34, $30, $3D, $48, $4C, $2A, $34 ; わたしのやりかた
#_08C56A: db $9C, $CF, $2B, $3A, $26, $4B, $52, $38 ; が⎵きにいらんと
#_08C572: db $CF, $26, $27, $3D, $2A, $95 ; ⎵いうのか?
#_08C578: db $FC ; wait for key and new line
#_08C579: db $FA ; clear message box
#_08C57A: db $A6, $9C, $CF, $50, $34, $30, $3A, $CF ; だが⎵わたしに⎵
#_08C582: db $30, $34, $9C, $58, $37, $26, $4E, $AB ; したがっていれば
#_08C58A: db $F9 ; new line
#_08C58B: db $5D, $64, $7B, $3A, $CF, $29, $33, $50 ; アクマに⎵おそわ
#_08C593: db $4E, $A3, $CF, $25, $4E, $3E, $37, $34 ; れず⎵あれはてた
#_08C59B: db $32, $2A, $26, $A9 ; せかいで
#_08C59F: db $F9 ; new line
#_08C5A0: db $26, $2B, $37, $26, $2D, $4D, $52, $A6 ; いきていけるんだ
#_08C5A8: db $A5 ; ぞ
#_08C5A9: db $FC ; wait for key and new line
#_08C5AA: db $FA ; clear message box
#_08C5AB: db $EF ; write chaos hero name
#_08C5AC: db $9A ; :
#_08C5AD: db $F9 ; new line
#_08C5AE: db $27, $4D, $2F, $26, $94, $CF, $2B, $2F ; うるさい!⎵きさ
#_08C5B6: db $43, $A6, $2D, $3E, $CF, $A4, $58, $34 ; まだけは⎵ぜった
#_08C5BE: db $26, $CF, $49, $4D, $2F, $52, $94 ; い⎵ゆるさん!
#_08C5C5: db $FC ; wait for key and new line
#_08C5C6: db $FA ; clear message box
#_08C5C7: db $61, $BA, $88, $9A ; オザワ:
#_08C5CB: db $F9 ; new line
#_08C5CC: db $2B, $2B, $50, $2D, $3D, $39, $26, $48 ; ききわけのないや
#_08C5D4: db $36, $46 ; つめ
#_08C5D6: db $F2, $0B ; prewritten text 0B
#_08C5D8: db $F5 ; write demon name from $050A
#_08C5D9: db $2F, $43 ; さま
#_08C5DB: db $F9 ; new line
#_08C5DC: db $2E, $3D, $CF, $46, $A1, $50, $4C, $39 ; この⎵めざわりな
#_08C5E4: db $CF, $B5, $63, $AA, $47, $51 ; ⎵ガキどもを
#_08C5EA: db $F9 ; new line
#_08C5EB: db $30, $43, $36, $30, $37, $2C, $A6, $2F ; しまつしてくださ
#_08C5F3: db $26, $94 ; い!
#_08C5F5: db $FC ; wait for key and new line

;===================================================================================================

; [CLASS] [DEMON1]が でた!
; アクマが とつぜん おそいかかってきた
; [JIMMY]:
; だめだ! こいつには かてない にげましょう!
Message_00_09_3D:
#_08C5F6: db $D6, $00, $00 ; delete sprite in slot 00
#_08C5F9: db $F2, $7C ; prewritten text 7C
#_08C5FB: db $F2, $7D ; prewritten text 7D
#_08C5FD: db $D5, $39 ; send 39 to APU
#_08C5FF: db $E4, $00 ; load demon $00
#_08C601: db $D2, $49, $41 ; test progress bit 49 for message 41
#_08C604: db $D4, $02 ; set text box size to 2
#_08C606: db $D5, $3C ; send 3C to APU
#_08C608: db $F6 ; write class name from $0506
#_08C609: db $CF ; ⎵
#_08C60A: db $F5 ; write demon name from $050A
#_08C60B: db $9C, $CF, $A9, $34, $94 ; が⎵でた!
#_08C610: db $FC ; wait for key and new line
#_08C611: db $FA ; clear message box
#_08C612: db $5D, $64, $7B, $9C, $CF, $38, $36, $A4 ; アクマが⎵とつぜ
#_08C61A: db $52, $CF, $29, $33, $26, $2A, $2A, $58 ; ん⎵おそいかかっ
#_08C622: db $37, $2B, $34 ; てきた
#_08C625: db $FC ; wait for key and new line
#_08C626: db $D5, $11 ; send 11 to APU
#_08C628: db $FE, $1C, $03 ; ext command 1C: $03 TODO
#_08C62B: db $D5, $2D ; send 2D to APU
#_08C62D: db $FE, $0B, $FF, $3C ; ext command 0B: remove 60% of everyone's hp
#_08C631: db $E9, $02, $3E ; go to message 3E maybe TODO
#_08C634: db $FA ; clear message box
#_08C635: db $EE ; write lawful hero name
#_08C636: db $9A ; :
#_08C637: db $F9 ; new line
#_08C638: db $A6, $46, $A6, $94, $CF, $2E, $26, $36 ; だめだ!⎵こいつ
#_08C640: db $3A, $3E, $CF, $2A, $37, $39, $26, $CF ; には⎵かてない⎵
#_08C648: db $3A, $9F, $43, $30, $57, $27, $94 ; にげましょう!
#_08C64F: db $FC ; wait for key and new line

;===================================================================================================

; [HIM]:
; くそっ! ここまできて«・・・»
Message_00_09_3E:
#_08C650: db $E9, $03, $3F ; go to message 3F maybe TODO
#_08C653: db $FA ; clear message box
#_08C654: db $EF ; write chaos hero name
#_08C655: db $9A ; :
#_08C656: db $F9 ; new line
#_08C657: db $2C, $33, $58, $94, $CF, $2E, $2E, $43 ; くそっ!⎵ここま
#_08C65F: db $A9, $2B, $37 ; できて
#_08C662: db $F2, $0B ; prewritten text 0B
#_08C664: db $FC ; wait for key and new line

;===================================================================================================

; >[LEADER]は なんとか にげのびた
Message_00_09_3F:
#_08C665: db $FA ; clear message box
#_08C666: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08C668: db $97 ; >
#_08C669: db $F1 ; write leader's name for team
#_08C66A: db $3E, $CF, $39, $52, $38, $2A, $CF, $3A ; は⎵なんとか⎵に
#_08C672: db $9F, $3D, $AC, $34 ; げのびた
#_08C676: db $FC ; wait for key and new line
#_08C677: db $D0, $E2 ; set progress bit E2
#_08C679: db $FF ; end of message

;===================================================================================================

; うるさいやつらめ
; およがせておけば つけあがりおって
; そういえば むかし «おまえたち»に よくにた
; はねっかえりの わかぞうどもが いたな
; [HIM]:
; オザワ! こんどは まけないぜ!
; オザワ:
; どうしても わたしに さからうのだな?
; «サイコダイバー»に せいしんをいじらせて
; わたしの ドレイにしてやる
; [DEMON1]さま こいつらを とらえてください!
Message_00_09_40:
#_08C67A: db $27, $4D, $2F, $26, $48, $36, $4B, $46 ; うるさいやつらめ
#_08C682: db $F9 ; new line
#_08C683: db $29, $4A, $9C, $32, $37, $29, $2D, $AB ; およがせておけば
#_08C68B: db $CF, $36, $2D, $25, $9C, $4C, $29, $58 ; ⎵つけあがりおっ
#_08C693: db $37 ; て
#_08C694: db $FC ; wait for key and new line
#_08C695: db $FA ; clear message box
#_08C696: db $33, $27, $26, $28, $AB, $CF, $45, $2A ; そういえば⎵むか
#_08C69E: db $30, $CF ; し⎵
#_08C6A0: db $F2, $04 ; prewritten text 04
#_08C6A2: db $3A, $CF, $4A, $2C, $3A, $34 ; に⎵よくにた
#_08C6A8: db $F9 ; new line
#_08C6A9: db $3E, $3C, $58, $2A, $28, $4C, $3D, $CF ; はねっかえりの⎵
#_08C6B1: db $50, $2A, $A5, $27, $AA, $47, $9C, $CF ; わかぞうどもが⎵
#_08C6B9: db $26, $34, $39 ; いたな
#_08C6BC: db $FC ; wait for key and new line
#_08C6BD: db $E9, $0C, $39 ; go to message 39 maybe TODO
#_08C6C0: db $FA ; clear message box
#_08C6C1: db $EF ; write chaos hero name
#_08C6C2: db $9A ; :
#_08C6C3: db $F9 ; new line
#_08C6C4: db $61, $BA, $88, $94, $CF, $2E, $52, $AA ; オザワ!⎵こんど
#_08C6CC: db $3E, $CF, $43, $2D, $39, $26, $A4, $94 ; は⎵まけないぜ!
#_08C6D4: db $FC ; wait for key and new line
#_08C6D5: db $FA ; clear message box
#_08C6D6: db $61, $BA, $88, $9A ; オザワ:
#_08C6DA: db $F9 ; new line
#_08C6DB: db $AA, $27, $30, $37, $47, $CF, $50, $34 ; どうしても⎵わた
#_08C6E3: db $30, $3A, $CF, $2F, $2A, $4B, $27, $3D ; しに⎵さからうの
#_08C6EB: db $A6, $39, $95 ; だな?
#_08C6EE: db $F9 ; new line
#_08C6EF: db $F2, $46 ; prewritten text 46
#_08C6F1: db $3A, $CF, $32, $26, $30, $52, $51, $26 ; に⎵せいしんをい
#_08C6F9: db $A2, $4B, $32, $37 ; じらせて
#_08C6FD: db $F9 ; new line
#_08C6FE: db $50, $34, $30, $3D, $CF, $C3, $86, $5E ; わたしの⎵ドレイ
#_08C706: db $3A, $30, $37, $48, $4D ; にしてやる
#_08C70B: db $F9 ; new line
#_08C70C: db $F5 ; write demon name from $050A
#_08C70D: db $2F, $43, $CF, $2E, $26, $36, $4B, $51 ; さま⎵こいつらを
#_08C715: db $CF, $38, $4B, $28, $37, $2C, $A6, $2F ; ⎵とらえてくださ
#_08C71D: db $26, $94 ; い!
#_08C71F: db $FC ; wait for key and new line
#_08C720: db $D3, $3D ; go to message 3D

;===================================================================================================

; [HIM]:
; いまの おれなら やつと たたかえるぞ!
Message_00_09_41:
#_08C722: db $D4, $03 ; set text box size to 3
#_08C724: db $EF ; write chaos hero name
#_08C725: db $9A ; :
#_08C726: db $F9 ; new line
#_08C727: db $26, $43, $3D, $CF, $29, $4E, $39, $4B ; いまの⎵おれなら
#_08C72F: db $CF, $48, $36, $38, $CF, $34, $34, $2A ; ⎵やつと⎵たたか
#_08C737: db $28, $4D, $A5, $94 ; えるぞ!
#_08C73B: db $FC ; wait for key and new line
#_08C73C: db $E5, $03, $43 ; [COMMAND E5:03,43]

;===================================================================================================

Message_00_09_42:
#_08C73F: db $E5, $00, $43 ; [COMMAND E5:00,43]
#_08C742: db $D3, $42 ; go to message 42

;===================================================================================================

; オザワ:
; な なんてことだ [DEMON1]を
; たおすとは«・・・»«・・・»
Message_00_09_43:
#_08C744: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08C746: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08C749: db $D6, $00, $A8, $70, $28 ; place sprite A8 in slot 00 at XY:{70,28}
#_08C74E: db $61, $BA, $88, $9A ; オザワ:
#_08C752: db $F9 ; new line
#_08C753: db $39, $CF, $39, $52, $37, $2E, $38, $A6 ; な⎵なんてことだ
#_08C75B: db $CF ; ⎵
#_08C75C: db $F5 ; write demon name from $050A
#_08C75D: db $51 ; を
#_08C75E: db $F9 ; new line
#_08C75F: db $34, $29, $31, $38, $3E ; たおすとは
#_08C764: db $F2, $0B ; prewritten text 0B
#_08C766: db $F2, $0B ; prewritten text 0B
#_08C768: db $FC ; wait for key and new line
#_08C769: db $FA ; clear message box

;===================================================================================================

; わるかった い いのちだけは たすけてくれ«・・・»
; たのむ!
Message_00_09_44:
#_08C76A: db $50, $4D, $2A, $58, $34, $CF, $26, $CF ; わるかった⎵い⎵
#_08C772: db $26, $3D, $35, $A6, $2D, $3E, $CF, $34 ; いのちだけは⎵た
#_08C77A: db $31, $2D, $37, $2C, $4E ; すけてくれ
#_08C77F: db $F2, $0B ; prewritten text 0B
#_08C781: db $F9 ; new line
#_08C782: db $34, $3D, $45, $94 ; たのむ!
#_08C786: db $FC ; wait for key and new line
#_08C787: db $E9, $0C, $45 ; go to message 45 maybe TODO
#_08C78A: db $D3, $46 ; go to message 46

;===================================================================================================

; そ そうだ きずついた ものは
; てあてしてやろう
; すこしは かいふくの まほうも
; つかえるんだ«・・・»
; こ これで どうだ«・・・»
Message_00_09_45:
#_08C78C: db $FA ; clear message box
#_08C78D: db $33, $CF, $33, $27, $A6, $CF, $2B, $A3 ; そ⎵そうだ⎵きず
#_08C795: db $36, $26, $34, $CF, $47, $3D, $3E ; ついた⎵ものは
#_08C79C: db $F9 ; new line
#_08C79D: db $37, $25, $37, $30, $37, $48, $4F, $27 ; てあてしてやろう
#_08C7A5: db $F9 ; new line
#_08C7A6: db $31, $2E, $30, $3E, $CF, $2A, $26, $40 ; すこしは⎵かいふ
#_08C7AE: db $2C, $3D, $CF, $43, $42, $27, $47 ; くの⎵まほうも
#_08C7B5: db $F9 ; new line
#_08C7B6: db $36, $2A, $28, $4D, $52, $A6 ; つかえるんだ
#_08C7BC: db $F2, $0B ; prewritten text 0B
#_08C7BE: db $FC ; wait for key and new line
#_08C7BF: db $FE, $25, $FF ; ext command 25: something FF TODO
#_08C7C2: db $FE, $23, $FF ; ext command 23: something FF TODO
#_08C7C5: db $FA ; clear message box
#_08C7C6: db $2E, $CF, $2E, $4E, $A9, $CF, $AA, $27 ; こ⎵これで⎵どう
#_08C7CE: db $A6 ; だ
#_08C7CF: db $F2, $0B ; prewritten text 0B
#_08C7D1: db $FC ; wait for key and new line

;===================================================================================================

; >オザワを たおしますか?
; [HIM]:
; おい ほんきか? こんなやつ たすけてやるのか?
Message_00_09_46:
#_08C7D2: db $FA ; clear message box
#_08C7D3: db $97, $61, $BA, $88, $51, $CF, $34, $29 ; >オザワを⎵たお
#_08C7DB: db $30, $43, $31, $2A, $95 ; しますか?
#_08C7E0: db $F8, $47 ; YES/NO - go to message 47 if YES
#_08C7E2: db $FE, $02, $FB ; ext command 02: add 251 to alignment if progress bit FB
#_08C7E5: db $EF ; write chaos hero name
#_08C7E6: db $9A ; :
#_08C7E7: db $F9 ; new line
#_08C7E8: db $29, $26, $CF, $42, $52, $2B, $2A, $95 ; おい⎵ほんきか?
#_08C7F0: db $CF, $2E, $52, $39, $48, $36, $CF, $34 ; ⎵こんなやつ⎵た
#_08C7F8: db $31, $2D, $37, $48, $4D, $3D, $2A, $95 ; すけてやるのか?
#_08C800: db $F8, $49 ; YES/NO - go to message 49 if YES
#_08C802: db $D3, $4A ; go to message 4A

;===================================================================================================

; [HIM]:
; オザワに とどめを さすのは おれだ!
; いいな?
Message_00_09_47:
#_08C804: db $FE, $02, $05 ; ext command 02: add 5 to alignment if progress bit FB
#_08C807: db $EF ; write chaos hero name
#_08C808: db $9A ; :
#_08C809: db $F9 ; new line
#_08C80A: db $61, $BA, $88, $3A, $CF, $38, $AA, $46 ; オザワに⎵とどめ
#_08C812: db $51, $CF, $2F, $31, $3D, $3E, $CF, $29 ; を⎵さすのは⎵お
#_08C81A: db $4E, $A6, $94 ; れだ!
#_08C81D: db $FC ; wait for key and new line
#_08C81E: db $26, $26, $39, $95 ; いいな?
#_08C822: db $F8, $4A ; YES/NO - go to message 4A if YES
#_08C824: db $D3, $4C ; go to message 4C

;===================================================================================================

; オザワ:
Message_00_09_48:
#_08C826: db $D4, $03 ; set text box size to 3
#_08C828: db $61, $BA, $88, $9A ; オザワ:
#_08C82C: db $F9 ; new line
#_08C82D: db $D3, $44 ; go to message 44

;===================================================================================================

Message_00_09_49:
#_08C82F: db $FE, $02, $FB ; ext command 02: add 251 to alignment if progress bit FB
#_08C832: db $D3, $4B ; go to message 4B

;===================================================================================================

Message_00_09_4A:
#_08C834: db $FE, $02, $05 ; ext command 02: add 5 to alignment if progress bit FB

;===================================================================================================

; >[HIM]は オザワに とどめをさした
; [HIM]:
; やっと オザワに おとしまえをつけた«・・・»«・・・»
; «・・・»[CHASE]! [JIMMY]!
; «おまえたち» みたいな あまいやりかたじゃ
; このさき いきのびることさえ できやしねえぜ!
; おれは がったいで ちからをえた
; もう おまえたちと いっしょにいる ひつようも
; なくなった«・・・»
; じゃあな いきてたら またあおうぜ
; >[HIM]は さっていった
Message_00_09_4B:
#_08C837: db $D5, $2B ; send 2B to APU
#_08C839: db $D6, $00, $00 ; delete sprite in slot 00
#_08C83C: db $D4, $03 ; set text box size to 3
#_08C83E: db $97 ; >
#_08C83F: db $EF ; write chaos hero name
#_08C840: db $3E, $CF, $61, $BA, $88, $3A, $CF, $38 ; は⎵オザワに⎵と
#_08C848: db $AA, $46, $51, $2F, $30, $34 ; どめをさした
#_08C84E: db $FC ; wait for key and new line
#_08C84F: db $FE, $07, $40 ; ext command 07: draw buffered text then wait 63 frames
#_08C852: db $DE, $01, $00, $1C, $01 ; load 1x demon 011C
#_08C857: db $E4, $00 ; load demon $00
#_08C859: db $FA ; clear message box
#_08C85A: db $EF ; write chaos hero name
#_08C85B: db $9A ; :
#_08C85C: db $F9 ; new line
#_08C85D: db $48, $58, $38, $CF, $61, $BA, $88, $3A ; やっと⎵オザワに
#_08C865: db $CF, $29, $38, $30, $43, $28, $51, $36 ; ⎵おとしまえをつ
#_08C86D: db $2D, $34 ; けた
#_08C86F: db $F2, $0B ; prewritten text 0B
#_08C871: db $F2, $0B ; prewritten text 0B
#_08C873: db $FC ; wait for key and new line
#_08C874: db $FA ; clear message box
#_08C875: db $F2, $0B ; prewritten text 0B
#_08C877: db $F0 ; write player name
#_08C878: db $94, $CF ; !⎵
#_08C87A: db $EE ; write lawful hero name
#_08C87B: db $94 ; !
#_08C87C: db $F9 ; new line
#_08C87D: db $F2, $04 ; prewritten text 04
#_08C87F: db $CF, $44, $34, $26, $39, $CF, $25, $43 ; ⎵みたいな⎵あま
#_08C887: db $26, $48, $4C, $2A, $34, $A2, $55 ; いやりかたじゃ
#_08C88E: db $F9 ; new line
#_08C88F: db $2E, $3D, $2F, $2B, $CF, $26, $2B, $3D ; このさき⎵いきの
#_08C897: db $AC, $4D, $2E, $38, $2F, $28, $CF, $A9 ; びることさえ⎵で
#_08C89F: db $2B, $48, $30, $3C, $28, $A4, $94 ; きやしねえぜ!
#_08C8A6: db $FC ; wait for key and new line
#_08C8A7: db $FA ; clear message box
#_08C8A8: db $29, $4E, $3E, $CF, $9C, $58, $34, $26 ; おれは⎵がったい
#_08C8B0: db $A9, $CF, $35, $2A, $4B, $51, $28, $34 ; で⎵ちからをえた
#_08C8B8: db $F9 ; new line
#_08C8B9: db $47, $27, $CF, $29, $43, $28, $34, $35 ; もう⎵おまえたち
#_08C8C1: db $38, $CF, $26, $58, $30, $57, $3A, $26 ; と⎵いっしょにい
#_08C8C9: db $4D, $CF, $3F, $36, $4A, $27, $47 ; る⎵ひつようも
#_08C8D0: db $F9 ; new line
#_08C8D1: db $39, $2C, $39, $58, $34 ; なくなった
#_08C8D6: db $F2, $0B ; prewritten text 0B
#_08C8D8: db $FC ; wait for key and new line
#_08C8D9: db $FA ; clear message box
#_08C8DA: db $A2, $55, $25, $39, $CF, $26, $2B, $37 ; じゃあな⎵いきて
#_08C8E2: db $34, $4B, $CF, $43, $34, $25, $29, $27 ; たら⎵またあおう
#_08C8EA: db $A4 ; ぜ
#_08C8EB: db $FC ; wait for key and new line
#_08C8EC: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08C8EE: db $FE, $27, $03 ; ext command 27: something 03 TODO
#_08C8F1: db $FA ; clear message box
#_08C8F2: db $97 ; >
#_08C8F3: db $EF ; write chaos hero name
#_08C8F4: db $3E, $CF, $2F, $58, $37, $26, $58, $34 ; は⎵さっていった
#_08C8FC: db $FC ; wait for key and new line
#_08C8FD: db $D0, $47 ; set progress bit 47
#_08C8FF: db $D1, $FF ; clear progress bit FF
#_08C901: db $FF ; end of message

;===================================================================================================

; こいつだけは ぜったいに いかしておけない!
Message_00_09_4C:
#_08C902: db $FA ; clear message box
#_08C903: db $2E, $26, $36, $A6, $2D, $3E, $CF, $A4 ; こいつだけは⎵ぜ
#_08C90B: db $58, $34, $26, $3A, $CF, $26, $2A, $30 ; ったいに⎵いかし
#_08C913: db $37, $29, $2D, $39, $26, $94 ; ておけない!
#_08C919: db $FC ; wait for key and new line
#_08C91A: db $D3, $49 ; go to message 49

;===================================================================================================

Message_00_09_4D:
#_08C91C: db $D2, $2F, $4E ; test progress bit 2F for message 4E
#_08C91F: db $D3, $51 ; go to message 51

;===================================================================================================

Message_00_09_4E:
#_08C921: db $D2, $47, $51 ; test progress bit 47 for message 51
#_08C924: db $D0, $FF ; set progress bit FF
#_08C926: db $FF ; end of message

;===================================================================================================

Message_00_09_4F:
#_08C927: db $D2, $2F, $50 ; test progress bit 2F for message 50
#_08C92A: db $D3, $51 ; go to message 51

;===================================================================================================

Message_00_09_50:
#_08C92C: db $D2, $47, $51 ; test progress bit 47 for message 51
#_08C92F: db $D1, $FF ; clear progress bit FF

;===================================================================================================

Message_00_09_51:
#_08C931: db $FF ; end of message

;===================================================================================================

Message_00_09_52:
#_08C932: db $D1, $FF ; clear progress bit FF

;===================================================================================================

Message_00_09_53:
#_08C934: db $D2, $4B, $58 ; test progress bit 4B for message 58

;===================================================================================================

Message_00_09_54:
#_08C937: db $FE, $2A ; ext command 2A: call routine 02E87C TODO

;===================================================================================================

; おんなのこえ:
; きゃーっ! たすけてーっ!!
; >[CHASE]は おんなのひめいを きいた
; [JIMMY]:
; [CHASE]くん どうしたんですか?
Message_00_09_55:
#_08C939: db $FA ; clear message box
#_08C93A: db $29, $52, $39, $3D, $2E, $28, $9A ; おんなのこえ:
#_08C941: db $F9 ; new line
#_08C942: db $2B, $55, $5A, $58, $94, $CF, $34, $31 ; きゃーっ!⎵たす
#_08C94A: db $2D, $37, $5A, $58, $94, $94 ; けてーっ!!
#_08C950: db $FC ; wait for key and new line
#_08C951: db $FA ; clear message box
#_08C952: db $97 ; >
#_08C953: db $F0 ; write player name
#_08C954: db $3E, $CF, $29, $52, $39, $3D, $3F, $46 ; は⎵おんなのひめ
#_08C95C: db $26, $51, $CF, $2B, $26, $34 ; いを⎵きいた
#_08C962: db $FC ; wait for key and new line
#_08C963: db $E9, $02, $56 ; go to message 56 maybe TODO
#_08C966: db $FA ; clear message box
#_08C967: db $EE ; write lawful hero name
#_08C968: db $9A ; :
#_08C969: db $F9 ; new line
#_08C96A: db $F0 ; write player name
#_08C96B: db $2C, $52, $CF, $AA, $27, $30, $34, $52 ; くん⎵どうしたん
#_08C973: db $A9, $31, $2A, $95 ; ですか?
#_08C977: db $FC ; wait for key and new line

;===================================================================================================

; [HIM]:
; ひめい? きこえなかったぜ
Message_00_09_56:
#_08C978: db $E9, $03, $57 ; go to message 57 maybe TODO
#_08C97B: db $FA ; clear message box
#_08C97C: db $EF ; write chaos hero name
#_08C97D: db $9A ; :
#_08C97E: db $F9 ; new line
#_08C97F: db $3F, $46, $26, $95, $CF, $2B, $2E, $28 ; ひめい?⎵きこえ
#_08C987: db $39, $2A, $58, $34, $A4 ; なかったぜ
#_08C98C: db $FC ; wait for key and new line

;===================================================================================================

; «おんなのこえ:»
; «・・・たすけて・・・»
; «[CHASE]・・・ たすけて・・・»
; «>[CHASE]の いしきのなかに»
; «おんなのこえが ひびいた・・・»
; [CHASE]の からだから
; ちからが ぬけていった«・・・»
Message_00_09_57:
#_08C98D: db $FA ; clear message box
#_08C98E: db $F2, $45 ; prewritten text 45
#_08C990: db $FA ; clear message box
#_08C991: db $F0 ; write player name
#_08C992: db $3D, $CF, $2A, $4B, $A6, $2A, $4B ; の⎵からだから
#_08C999: db $F9 ; new line
#_08C99A: db $35, $2A, $4B, $9C, $CF, $3B, $2D, $37 ; ちからが⎵ぬけて
#_08C9A2: db $26, $58, $34 ; いった
#_08C9A5: db $F2, $0B ; prewritten text 0B
#_08C9A7: db $FE, $1C, $03 ; ext command 1C: $03 TODO
#_08C9AA: db $FE, $0B, $00, $0A ; ext command 0B: remove 10% of chase hp
#_08C9AE: db $FC ; wait for key and new line
#_08C9AF: db $D0, $4B ; set progress bit 4B
#_08C9B1: db $D0, $A8 ; set progress bit A8
#_08C9B3: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
Message_00_09_58:
#_08C9B4: db $FE, $2A ; ext command 2A: call routine 02E87C TODO
#_08C9B6: db $97 ; >
#_08C9B7: db $F2, $2C ; prewritten text 2C
#_08C9B9: db $FC ; wait for key and new line
#_08C9BA: db $FF ; end of message

;===================================================================================================

; «しせつけいさつ»ちょうかん:
; わたしは «シンジュク»の へいわをまもる
; «しせつけいさつ»の ちょうかんだ
; «オザワさま»から じきじきに にんめいされたのだ
; わたしが いるかぎり
; «シンジュク»の へいわは だいじょうぶなのだよ
Message_00_09_59:
#_08C9BB: db $D7, $24 ; load scene 24
#_08C9BD: db $D2, $47, $5A ; test progress bit 47 for message 5A
#_08C9C0: db $D6, $00, $A6, $70, $28 ; place sprite A6 in slot 00 at XY:{70,28}
#_08C9C5: db $F2, $42 ; prewritten text 42
#_08C9C7: db $35, $57, $27, $2A, $52, $9A ; ちょうかん:
#_08C9CD: db $F9 ; new line
#_08C9CE: db $50, $34, $30, $3E, $CF ; わたしは⎵
#_08C9D3: db $F2, $18 ; prewritten text 18
#_08C9D5: db $3D, $CF, $41, $26, $50, $51, $43, $47 ; の⎵へいわをまも
#_08C9DD: db $4D ; る
#_08C9DE: db $F9 ; new line
#_08C9DF: db $F2, $42 ; prewritten text 42
#_08C9E1: db $3D, $CF, $35, $57, $27, $2A, $52, $A6 ; の⎵ちょうかんだ
#_08C9E9: db $FC ; wait for key and new line
#_08C9EA: db $FA ; clear message box
#_08C9EB: db $F2, $65 ; prewritten text 65
#_08C9ED: db $2A, $4B, $CF, $A2, $2B, $A2, $2B, $3A ; から⎵じきじきに
#_08C9F5: db $CF, $3A, $52, $46, $26, $2F, $4E, $34 ; ⎵にんめいされた
#_08C9FD: db $3D, $A6 ; のだ
#_08C9FF: db $F9 ; new line
#_08CA00: db $50, $34, $30, $9C, $CF, $26, $4D, $2A ; わたしが⎵いるか
#_08CA08: db $9D, $4C ; ぎり
#_08CA0A: db $F9 ; new line
#_08CA0B: db $F2, $18 ; prewritten text 18
#_08CA0D: db $3D, $CF, $41, $26, $50, $3E, $CF, $A6 ; の⎵へいわは⎵だ
#_08CA15: db $26, $A2, $57, $27, $AD, $39, $3D, $A6 ; いじょうぶなのだ
#_08CA1D: db $4A ; よ
#_08CA1E: db $FC ; wait for key and new line
#_08CA1F: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
; おきてがみがある よんでみますか?
Message_00_09_5A:
#_08CA20: db $FA ; clear message box
#_08CA21: db $97 ; >
#_08CA22: db $F2, $2C ; prewritten text 2C
#_08CA24: db $FC ; wait for key and new line
#_08CA25: db $FA ; clear message box
#_08CA26: db $29, $2B, $37, $9C, $44, $9C, $25, $4D ; おきてがみがある
#_08CA2E: db $CF, $4A, $52, $A9, $44, $43, $31, $2A ; ⎵よんでみますか
#_08CA36: db $95 ; ?
#_08CA37: db $F8, $5B ; YES/NO - go to message 5B if YES
#_08CA39: db $FF ; end of message

;===================================================================================================

; [CHASE]へ
; «しせつけいさつ»の ちょうかんは
; オザワの ちからを バックに
; けいかんどもを つかい あくじを はたらいてきた
; こんなやつは いかしておけない!
; だから おれが しまつした
;                [HIM]
Message_00_09_5B:
#_08CA3A: db $FA ; clear message box
#_08CA3B: db $F0 ; write player name
#_08CA3C: db $41 ; へ
#_08CA3D: db $F9 ; new line
#_08CA3E: db $F2, $42 ; prewritten text 42
#_08CA40: db $3D, $CF, $35, $57, $27, $2A, $52, $3E ; の⎵ちょうかんは
#_08CA48: db $F9 ; new line
#_08CA49: db $61, $BA, $88, $3D, $CF, $35, $2A, $4B ; オザワの⎵ちから
#_08CA51: db $51, $CF, $C4, $92, $64, $3A ; を⎵バックに
#_08CA57: db $F9 ; new line
#_08CA58: db $2D, $26, $2A, $52, $AA, $47, $51, $CF ; けいかんどもを⎵
#_08CA60: db $36, $2A, $26, $CF, $25, $2C, $A2, $51 ; つかい⎵あくじを
#_08CA68: db $CF, $3E, $34, $4B, $26, $37, $2B, $34 ; ⎵はたらいてきた
#_08CA70: db $F9 ; new line
#_08CA71: db $2E, $52, $39, $48, $36, $3E, $CF, $26 ; こんなやつは⎵い
#_08CA79: db $2A, $30, $37, $29, $2D, $39, $26, $94 ; かしておけない!
#_08CA81: db $F9 ; new line
#_08CA82: db $A6, $2A, $4B, $CF, $29, $4E, $9C, $CF ; だから⎵おれが⎵
#_08CA8A: db $30, $43, $36, $30, $34 ; しまつした
#_08CA8F: db $FC ; wait for key and new line
#_08CA90: db $CF, $CF, $CF, $CF, $CF, $CF, $CF, $CF ; ⎵⎵⎵⎵⎵⎵⎵⎵
#_08CA98: db $CF, $CF, $CF, $CF, $CF, $CF, $CF ; ⎵⎵⎵⎵⎵⎵⎵
#_08CA9F: db $EF ; write chaos hero name
#_08CAA0: db $FC ; wait for key and new line
#_08CAA1: db $FF ; end of message

;===================================================================================================

Message_00_09_5C:
#_08CAA2: db $D2, $2F, $5D ; test progress bit 2F for message 5D
#_08CAA5: db $D3, $60 ; go to message 60

;===================================================================================================

Message_00_09_5D:
#_08CAA7: db $D2, $47, $60 ; test progress bit 47 for message 60
#_08CAAA: db $D0, $FF ; set progress bit FF
#_08CAAC: db $FF ; end of message

;===================================================================================================

Message_00_09_5E:
#_08CAAD: db $D2, $2F, $5F ; test progress bit 2F for message 5F
#_08CAB0: db $D3, $60 ; go to message 60

;===================================================================================================

Message_00_09_5F:
#_08CAB2: db $D2, $47, $60 ; test progress bit 47 for message 60
#_08CAB5: db $D1, $FF ; clear progress bit FF
#_08CAB7: db $FF ; end of message

;===================================================================================================

Message_00_09_60:
#_08CAB8: db $FF ; end of message

;===================================================================================================

; おとこ:
; おまえら «レジスタンス»かあ?
Message_00_09_61:
#_08CAB9: db $D2, $2F, $63 ; test progress bit 2F for message 63
#_08CABC: db $D6, $00, $28, $70, $28 ; place sprite 28 in slot 00 at XY:{70,28}
#_08CAC1: db $29, $38, $2E, $9A ; おとこ:
#_08CAC5: db $F9 ; new line
#_08CAC6: db $29, $43, $28, $4B ; おまえら
#_08CACA: db $D2, $20, $62 ; test progress bit 20 for message 62
#_08CACD: db $CF ; ⎵
#_08CACE: db $F2, $15 ; prewritten text 15
#_08CAD0: db $2A, $25, $95 ; かあ?
#_08CAD3: db $FC ; wait for key and new line
#_08CAD4: db $FF ; end of message

;===================================================================================================

; が «オザワさま»に さからっても
; むだむだ
Message_00_09_62:
#_08CAD5: db $9C, $CF ; が⎵
#_08CAD7: db $F2, $65 ; prewritten text 65
#_08CAD9: db $3A, $CF, $2F, $2A, $4B, $58, $37, $47 ; に⎵さからっても
#_08CAE1: db $F9 ; new line
#_08CAE2: db $45, $A6, $45, $A6 ; むだむだ
#_08CAE6: db $FC ; wait for key and new line
#_08CAE7: db $FF ; end of message

;===================================================================================================

; «メシアきょう»と:
; «シンジュク»の ニシに たっている
; とちょうだった たてものは
; アクマのすと なっています
; ちょうじょうの 2つの とうから
; とても つよい けはいが かんじられます
Message_00_09_63:
#_08CAE8: db $D6, $00, $49, $78, $28 ; place sprite 49 in slot 00 at XY:{78,28}
#_08CAED: db $F2, $33 ; prewritten text 33
#_08CAEF: db $38, $9A ; と:
#_08CAF1: db $F9 ; new line
#_08CAF2: db $F2, $18 ; prewritten text 18
#_08CAF4: db $3D, $CF, $72, $68, $3A, $CF, $34, $58 ; の⎵ニシに⎵たっ
#_08CAFC: db $37, $26, $4D ; ている
#_08CAFF: db $F9 ; new line
#_08CB00: db $38, $35, $57, $27, $A6, $58, $34, $CF ; とちょうだった⎵
#_08CB08: db $34, $37, $47, $3D, $3E ; たてものは
#_08CB0D: db $F9 ; new line
#_08CB0E: db $5D, $64, $7B, $3D, $31, $38, $CF, $39 ; アクマのすと⎵な
#_08CB16: db $58, $37, $26, $43, $31 ; っています
#_08CB1B: db $FC ; wait for key and new line
#_08CB1C: db $FA ; clear message box
#_08CB1D: db $35, $57, $27, $A2, $57, $27, $3D, $CF ; ちょうじょうの⎵
#_08CB25: db $03, $36, $3D, $CF, $38, $27, $2A, $4B ; 2つの⎵とうから
#_08CB2D: db $F9 ; new line
#_08CB2E: db $38, $37, $47, $CF, $36, $4A, $26, $CF ; とても⎵つよい⎵
#_08CB36: db $2D, $3E, $26, $9C, $CF, $2A, $52, $A2 ; けはいが⎵かんじ
#_08CB3E: db $4B, $4E, $43, $31 ; られます
#_08CB42: db $FC ; wait for key and new line
#_08CB43: db $FF ; end of message

;===================================================================================================

; [DEMON1]:
; うちの じむしょに なんかようかい!
Message_00_09_64:
#_08CB44: db $D2, $2F, $65 ; test progress bit 2F for message 65
#_08CB47: db $DE, $00, $00, $F7, $01 ; load 1x demon 00F7
#_08CB4C: db $E4, $00 ; load demon $00
#_08CB4E: db $F5 ; write demon name from $050A
#_08CB4F: db $9A ; :
#_08CB50: db $F9 ; new line
#_08CB51: db $27, $35, $3D, $CF, $A2, $45, $30, $57 ; うちの⎵じむしょ
#_08CB59: db $3A, $CF, $39, $52, $2A, $4A, $27, $2A ; に⎵なんかようか
#_08CB61: db $26, $94 ; い!
#_08CB63: db $FC ; wait for key and new line
#_08CB64: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08CB66: db $FF ; end of message

;===================================================================================================

Message_00_09_65:
#_08CB67: db $D2, $49, $66 ; test progress bit 49 for message 66
#_08CB6A: db $D2, $E2, $67 ; test progress bit E2 for message 67

;===================================================================================================

; しせつけいさつ:
; «オザワさま»の オフィスに
; なにか ようか
Message_00_09_66:
#_08CB6D: db $D6, $00, $A6, $70, $28 ; place sprite A6 in slot 00 at XY:{70,28}
#_08CB72: db $30, $32, $36, $2D, $26, $2F, $36, $9A ; しせつけいさつ:
#_08CB7A: db $F9 ; new line
#_08CB7B: db $D2, $47, $6A ; test progress bit 47 for message 6A
#_08CB7E: db $F2, $65 ; prewritten text 65
#_08CB80: db $3D, $CF, $61, $78, $8C, $69, $3A ; の⎵オフィスに
#_08CB87: db $F9 ; new line
#_08CB88: db $39, $3A, $2A, $CF, $4A, $27, $2A ; なにか⎵ようか
#_08CB8F: db $FC ; wait for key and new line
#_08CB90: db $FF ; end of message

;===================================================================================================

Message_00_09_67:
#_08CB91: db $E9, $03, $6B ; go to message 6B maybe TODO
#_08CB94: db $DE, $01, $00, $35, $01 ; load 1x demon 0135
#_08CB99: db $E4, $00 ; load demon $00

;===================================================================================================

; [HIM]:
; オザワを たおすために もっと ちからが ほしい
; そうだ!アクマの ちからだ!
; おれの からだに
; アクマの ちからを やどすんだ
; [JIMMY]:
; なんてこと いうんです!
; アクマと がったいしたら [HIM]くんは
; もはや ニンゲンじゃなくなる
; そうまでして かって なんに なるんです
; [HIM]:
; [JIMMY]!
; おまえには わからねえだろうよ«・・・»
Message_00_09_68:
#_08CB9B: db $EF ; write chaos hero name
#_08CB9C: db $9A ; :
#_08CB9D: db $F9 ; new line
#_08CB9E: db $61, $BA, $88, $51, $CF, $34, $29, $31 ; オザワを⎵たおす
#_08CBA6: db $34, $46, $3A, $CF, $47, $58, $38, $CF ; ために⎵もっと⎵
#_08CBAE: db $35, $2A, $4B, $9C, $CF, $42, $30, $26 ; ちからが⎵ほしい
#_08CBB6: db $F9 ; new line
#_08CBB7: db $33, $27, $A6, $94, $5D, $64, $7B, $3D ; そうだ!アクマの
#_08CBBF: db $CF, $35, $2A, $4B, $A6, $94 ; ⎵ちからだ!
#_08CBC5: db $F9 ; new line
#_08CBC6: db $29, $4E, $3D, $CF, $2A, $4B, $A6, $3A ; おれの⎵からだに
#_08CBCE: db $F9 ; new line
#_08CBCF: db $5D, $64, $7B, $3D, $CF, $35, $2A, $4B ; アクマの⎵ちから
#_08CBD7: db $51, $CF, $48, $AA, $31, $52, $A6 ; を⎵やどすんだ
#_08CBDE: db $FC ; wait for key and new line
#_08CBDF: db $E9, $09, $69 ; go to message 69 maybe TODO
#_08CBE2: db $FA ; clear message box
#_08CBE3: db $EE ; write lawful hero name
#_08CBE4: db $9A ; :
#_08CBE5: db $F9 ; new line
#_08CBE6: db $39, $52, $37, $2E, $38, $CF, $26, $27 ; なんてこと⎵いう
#_08CBEE: db $52, $A9, $31, $94 ; んです!
#_08CBF2: db $F9 ; new line
#_08CBF3: db $5D, $64, $7B, $38, $CF, $9C, $58, $34 ; アクマと⎵がった
#_08CBFB: db $26, $30, $34, $4B, $CF ; いしたら⎵
#_08CC00: db $EF ; write chaos hero name
#_08CC01: db $2C, $52, $3E ; くんは
#_08CC04: db $F9 ; new line
#_08CC05: db $47, $3E, $48, $CF, $72, $8A, $B8, $8A ; もはや⎵ニンゲン
#_08CC0D: db $A2, $55, $39, $2C, $39, $4D ; じゃなくなる
#_08CC13: db $F9 ; new line
#_08CC14: db $33, $27, $43, $A9, $30, $37, $CF, $2A ; そうまでして⎵か
#_08CC1C: db $58, $37, $CF, $39, $52, $3A, $CF, $39 ; って⎵なんに⎵な
#_08CC24: db $4D, $52, $A9, $31 ; るんです
#_08CC28: db $FC ; wait for key and new line
#_08CC29: db $D4, $03 ; set text box size to 3
#_08CC2B: db $EF ; write chaos hero name
#_08CC2C: db $9A ; :
#_08CC2D: db $F9 ; new line
#_08CC2E: db $EE ; write lawful hero name
#_08CC2F: db $94 ; !
#_08CC30: db $F9 ; new line
#_08CC31: db $29, $43, $28, $3A, $3E, $CF, $50, $2A ; おまえには⎵わか
#_08CC39: db $4B, $3C, $28, $A6, $4F, $27, $4A ; らねえだろうよ
#_08CC40: db $F2, $0B ; prewritten text 0B
#_08CC42: db $FC ; wait for key and new line

;===================================================================================================

Message_00_09_69:
#_08CC43: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08CC45: db $FF ; end of message

;===================================================================================================

; オ «オザワさま»が たおされるなんて«・・・»
; オレは どうすれば いいんだ
Message_00_09_6A:
#_08CC46: db $61, $CF ; オ⎵
#_08CC48: db $F2, $65 ; prewritten text 65
#_08CC4A: db $9C, $CF, $34, $29, $2F, $4E, $4D, $39 ; が⎵たおされるな
#_08CC52: db $52, $37 ; んて
#_08CC54: db $F2, $0B ; prewritten text 0B
#_08CC56: db $F9 ; new line
#_08CC57: db $61, $86, $3E, $CF, $AA, $27, $31, $4E ; オレは⎵どうすれ
#_08CC5F: db $AB, $CF, $26, $26, $52, $A6 ; ば⎵いいんだ
#_08CC65: db $FC ; wait for key and new line
#_08CC66: db $FF ; end of message

;===================================================================================================

; >[LEADER]の いしきの なかに
; [HIM]の こえが ひびいた
Message_00_09_6B:
#_08CC67: db $97 ; >
#_08CC68: db $F1 ; write leader's name for team
#_08CC69: db $3D, $CF, $26, $30, $2B, $3D, $CF, $39 ; の⎵いしきの⎵な
#_08CC71: db $2A, $3A ; かに
#_08CC73: db $F9 ; new line
#_08CC74: db $EF ; write chaos hero name
#_08CC75: db $3D, $CF, $2E, $28, $9C, $CF, $3F, $AC ; の⎵こえが⎵ひび
#_08CC7D: db $26, $34 ; いた
#_08CC7F: db $FC ; wait for key and new line
#_08CC80: db $FA ; clear message box
#_08CC81: db $D3, $68 ; go to message 68

;===================================================================================================

; おんな:
; ちょっと いいですか?
; あなたは カミを しんじますか?
; それは いけません
; わたしたち «メシアきょう»の ナカマに なって
; ともに カミに いのりましょう
Message_00_0A_00:
#_08CC83: db $D6, $00, $49, $78, $28 ; place sprite 49 in slot 00 at XY:{78,28}
#_08CC88: db $D2, $2F, $2A ; test progress bit 2F for message 2A
#_08CC8B: db $29, $52, $39, $9A ; おんな:
#_08CC8F: db $F9 ; new line
#_08CC90: db $35, $57, $58, $38, $CF, $26, $26, $A9 ; ちょっと⎵いいで
#_08CC98: db $31, $2A, $95 ; すか?
#_08CC9B: db $F9 ; new line
#_08CC9C: db $25, $39, $34, $3E, $CF, $62, $7C, $51 ; あなたは⎵カミを
#_08CCA4: db $CF, $30, $52, $A2, $43, $31, $2A, $95 ; ⎵しんじますか?
#_08CCAC: db $F8, $01 ; YES/NO - go to message 01 if YES
#_08CCAE: db $D4, $03 ; set text box size to 3
#_08CCB0: db $33, $4E, $3E, $CF, $26, $2D, $43, $32 ; それは⎵いけませ
#_08CCB8: db $52 ; ん
#_08CCB9: db $F9 ; new line
#_08CCBA: db $50, $34, $30, $34, $35, $CF ; わたしたち⎵
#_08CCC0: db $F2, $33 ; prewritten text 33
#_08CCC2: db $3D, $CF, $71, $62, $7B, $3A, $CF, $39 ; の⎵ナカマに⎵な
#_08CCCA: db $58, $37 ; って
#_08CCCC: db $F9 ; new line
#_08CCCD: db $38, $47, $3A, $CF, $62, $7C, $3A, $CF ; ともに⎵カミに⎵
#_08CCD5: db $26, $3D, $4C, $43, $30, $57, $27 ; いのりましょう
#_08CCDC: db $FC ; wait for key and new line
#_08CCDD: db $FA ; clear message box
#_08CCDE: db $D3, $02 ; go to message 02

;===================================================================================================

; それは よいことです
; あなたも わたしたち «メシアきょう»の
; ナカマですね
Message_00_0A_01:
#_08CCE0: db $D4, $03 ; set text box size to 3
#_08CCE2: db $33, $4E, $3E, $CF, $4A, $26, $2E, $38 ; それは⎵よいこと
#_08CCEA: db $A9, $31 ; です
#_08CCEC: db $F9 ; new line
#_08CCED: db $25, $39, $34, $47, $CF, $50, $34, $30 ; あなたも⎵わたし
#_08CCF5: db $34, $35, $CF ; たち⎵
#_08CCF8: db $F2, $33 ; prewritten text 33
#_08CCFA: db $3D ; の
#_08CCFB: db $F9 ; new line
#_08CCFC: db $71, $62, $7B, $A9, $31, $3C ; ナカマですね
#_08CD02: db $FC ; wait for key and new line

;===================================================================================================

; みんなが カミへ いのりを ささげれば
; カミは きっと わたしたちを すくうため
; きゅうせいしゅを おつかわしに なるでしょう
Message_00_0A_02:
#_08CD03: db $44, $52, $39, $9C, $CF, $62, $7C, $41 ; みんなが⎵カミへ
#_08CD0B: db $CF, $26, $3D, $4C, $51, $CF, $2F, $2F ; ⎵いのりを⎵ささ
#_08CD13: db $9F, $4E, $AB ; げれば
#_08CD16: db $F9 ; new line
#_08CD17: db $62, $7C, $3E, $CF, $2B, $58, $38, $CF ; カミは⎵きっと⎵
#_08CD1F: db $50, $34, $30, $34, $35, $51, $CF, $31 ; わたしたちを⎵す
#_08CD27: db $2C, $27, $34, $46 ; くうため
#_08CD2B: db $F9 ; new line
#_08CD2C: db $2B, $56, $27, $32, $26, $30, $56, $51 ; きゅうせいしゅを
#_08CD34: db $CF, $29, $36, $2A, $50, $30, $3A, $CF ; ⎵おつかわしに⎵
#_08CD3C: db $39, $4D, $A9, $30, $57, $27 ; なるでしょう
#_08CD42: db $FC ; wait for key and new line
#_08CD43: db $FF ; end of message

;===================================================================================================

; おとこ:
; «・・・»さいごのときは ちかづいています
; いま «われわれ»が おすがりすべき おかたは
; «・・・»«ルシファーさま» なのです
; かつて てんかいにあって もっともうつくしい
; てんしであられた «ルシファーさま»
; «われわれ» じんるいに ちえをさずけるため
; ちじょうに おりたたれた «ルシファーさま»
; それゆえ かみのいかりにふれ
; アクマにされながらも «われわれ» じんるいのため
; かみと おおしくたたかわれた «ルシファーさま»
Message_00_0A_03:
#_08CD44: db $D6, $00, $65, $70, $28 ; place sprite 65 in slot 00 at XY:{70,28}
#_08CD49: db $D2, $2F, $2B ; test progress bit 2F for message 2B
#_08CD4C: db $29, $38, $2E, $9A ; おとこ:
#_08CD50: db $F9 ; new line
#_08CD51: db $F2, $0B ; prewritten text 0B
#_08CD53: db $2F, $26, $A0, $3D, $38, $2B, $3E, $CF ; さいごのときは⎵
#_08CD5B: db $35, $2A, $A8, $26, $37, $26, $43, $31 ; ちかづいています
#_08CD63: db $F9 ; new line
#_08CD64: db $26, $43, $CF ; いま⎵
#_08CD67: db $F2, $02 ; prewritten text 02
#_08CD69: db $9C, $CF, $29, $31, $9C, $4C, $31, $AE ; が⎵おすがりすべ
#_08CD71: db $2B, $CF, $29, $2A, $34, $3E ; き⎵おかたは
#_08CD77: db $FC ; wait for key and new line
#_08CD78: db $FA ; clear message box
#_08CD79: db $F2, $0B ; prewritten text 0B
#_08CD7B: db $F2, $23 ; prewritten text 23
#_08CD7D: db $CF, $39, $3D, $A9, $31 ; ⎵なのです
#_08CD82: db $FC ; wait for key and new line
#_08CD83: db $2A, $36, $37, $CF, $37, $52, $2A, $26 ; かつて⎵てんかい
#_08CD8B: db $3A, $25, $58, $37, $CF, $47, $58, $38 ; にあって⎵もっと
#_08CD93: db $47, $27, $36, $2C, $30, $26 ; もうつくしい
#_08CD99: db $F9 ; new line
#_08CD9A: db $37, $52, $30, $A9, $25, $4B, $4E, $34 ; てんしであられた
#_08CDA2: db $CF ; ⎵
#_08CDA3: db $F2, $23 ; prewritten text 23
#_08CDA5: db $FC ; wait for key and new line
#_08CDA6: db $FA ; clear message box
#_08CDA7: db $F2, $02 ; prewritten text 02
#_08CDA9: db $CF, $A2, $52, $4D, $26, $3A, $CF, $35 ; ⎵じんるいに⎵ち
#_08CDB1: db $28, $51, $2F, $A3, $2D, $4D, $34, $46 ; えをさずけるため
#_08CDB9: db $F9 ; new line
#_08CDBA: db $35, $A2, $57, $27, $3A, $CF, $29, $4C ; ちじょうに⎵おり
#_08CDC2: db $34, $34, $4E, $34, $CF ; たたれた⎵
#_08CDC7: db $F2, $23 ; prewritten text 23
#_08CDC9: db $FC ; wait for key and new line
#_08CDCA: db $FA ; clear message box
#_08CDCB: db $33, $4E, $49, $28, $CF, $2A, $44, $3D ; それゆえ⎵かみの
#_08CDD3: db $26, $2A, $4C, $3A, $40, $4E ; いかりにふれ
#_08CDD9: db $F9 ; new line
#_08CDDA: db $5D, $64, $7B, $3A, $2F, $4E, $39, $9C ; アクマにされなが
#_08CDE2: db $4B, $47, $CF ; らも⎵
#_08CDE5: db $F2, $02 ; prewritten text 02
#_08CDE7: db $CF, $A2, $52, $4D, $26, $3D, $34, $46 ; ⎵じんるいのため
#_08CDEF: db $F9 ; new line
#_08CDF0: db $2A, $44, $38, $CF, $29, $29, $30, $2C ; かみと⎵おおしく
#_08CDF8: db $34, $34, $2A, $50, $4E, $34, $CF ; たたかわれた⎵
#_08CDFF: db $F2, $23 ; prewritten text 23
#_08CE01: db $FC ; wait for key and new line
#_08CE02: db $FA ; clear message box

;===================================================================================================

; いまこそ «われわれ»は «ルシファーさま»を
; あがめたてまつりて«・・・»
Message_00_0A_04:
#_08CE03: db $26, $43, $2E, $33, $CF ; いまこそ⎵
#_08CE08: db $F2, $02 ; prewritten text 02
#_08CE0A: db $3E, $CF ; は⎵
#_08CE0C: db $F2, $23 ; prewritten text 23
#_08CE0E: db $51 ; を
#_08CE0F: db $F9 ; new line
#_08CE10: db $25, $9C, $46, $34, $37, $43, $36, $4C ; あがめたてまつり
#_08CE18: db $37 ; て
#_08CE19: db $F2, $0B ; prewritten text 0B
#_08CE1B: db $FC ; wait for key and new line
#_08CE1C: db $FF ; end of message

;===================================================================================================

; けんきゅういん:
; ゴトウの てしたのアクマどもに
; けんきゅうじょを のっとられて しまった
; あぶないところを にげてきたんだ
; くるまいすのおとこが きていたが
; どうなったかな?
Message_00_0A_05:
#_08CE1D: db $D2, $2F, $2C ; test progress bit 2F for message 2C
#_08CE20: db $D6, $01, $56, $48, $38 ; place sprite 56 in slot 01 at XY:{48,38}
#_08CE25: db $D6, $02, $56, $98, $38 ; place sprite 56 in slot 02 at XY:{98,38}
#_08CE2A: db $D6, $00, $4F, $70, $28 ; place sprite 4F in slot 00 at XY:{70,28}
#_08CE2F: db $2D, $52, $2B, $56, $27, $26, $52, $9A ; けんきゅういん:
#_08CE37: db $F9 ; new line
#_08CE38: db $B9, $70, $5F, $3D, $CF, $37, $30, $34 ; ゴトウの⎵てした
#_08CE40: db $3D, $5D, $64, $7B, $AA, $47, $3A ; のアクマどもに
#_08CE47: db $F9 ; new line
#_08CE48: db $2D, $52, $2B, $56, $27, $A2, $57, $51 ; けんきゅうじょを
#_08CE50: db $CF, $3D, $58, $38, $4B, $4E, $37, $CF ; ⎵のっとられて⎵
#_08CE58: db $30, $43, $58, $34 ; しまった
#_08CE5C: db $F9 ; new line
#_08CE5D: db $25, $AD, $39, $26, $38, $2E, $4F, $51 ; あぶないところを
#_08CE65: db $CF, $3A, $9F, $37, $2B, $34, $52, $A6 ; ⎵にげてきたんだ
#_08CE6D: db $FC ; wait for key and new line
#_08CE6E: db $FA ; clear message box
#_08CE6F: db $2C, $4D, $43, $26, $31, $3D, $29, $38 ; くるまいすのおと
#_08CE77: db $2E, $9C, $CF, $2B, $37, $26, $34, $9C ; こが⎵きていたが
#_08CE7F: db $F9 ; new line
#_08CE80: db $AA, $27, $39, $58, $34, $2A, $39, $95 ; どうなったかな?
#_08CE88: db $FC ; wait for key and new line
#_08CE89: db $FF ; end of message

;===================================================================================================

; おんな:
; «かいげんれい»なんて すぐに かいじょされるわ
; «クーデター»だって かってに やらせとけばいいのよ
; «クーデター»ぶたいに さからうなんて
; バカらしいし アブないわよ
Message_00_0A_06:
#_08CE8A: db $D2, $2F, $2D ; test progress bit 2F for message 2D
#_08CE8D: db $D6, $00, $44, $78, $28 ; place sprite 44 in slot 00 at XY:{78,28}
#_08CE92: db $29, $52, $39, $9A ; おんな:
#_08CE96: db $F9 ; new line
#_08CE97: db $F2, $30 ; prewritten text 30
#_08CE99: db $39, $52, $37, $CF, $31, $9E, $3A, $CF ; なんて⎵すぐに⎵
#_08CEA1: db $2A, $26, $A2, $57, $2F, $4E, $4D, $50 ; かいじょされるわ
#_08CEA9: db $F9 ; new line
#_08CEAA: db $F2, $17 ; prewritten text 17
#_08CEAC: db $A6, $58, $37, $CF, $2A, $58, $37, $3A ; だって⎵かってに
#_08CEB4: db $CF, $48, $4B, $32, $38, $2D, $AB, $26 ; ⎵やらせとけばい
#_08CEBC: db $26, $3D, $4A ; いのよ
#_08CEBF: db $FC ; wait for key and new line
#_08CEC0: db $FA ; clear message box
#_08CEC1: db $F2, $17 ; prewritten text 17
#_08CEC3: db $AD, $34, $26, $3A, $CF, $2F, $2A, $4B ; ぶたいに⎵さから
#_08CECB: db $27, $39, $52, $37 ; うなんて
#_08CECF: db $F9 ; new line
#_08CED0: db $C4, $62, $4B, $30, $26, $30, $CF, $5D ; バカらしいし⎵ア
#_08CED8: db $C6, $39, $26, $50, $4A ; ブないわよ
#_08CEDD: db $FC ; wait for key and new line
#_08CEDE: db $FF ; end of message

;===================================================================================================

; おとこ:
; «レジスタンス»かぁ «クーデター»ぶたいや
; «アメリカ»ぐんと たたかうなんて
; すごいよなぁ
; きっと «リーダー»は あたまがよくて
; どきょうもあるひと だろうなぁ
Message_00_0A_07:
#_08CEDF: db $D2, $2F, $2F ; test progress bit 2F for message 2F
#_08CEE2: db $D6, $00, $4A, $78, $28 ; place sprite 4A in slot 00 at XY:{78,28}
#_08CEE7: db $29, $38, $2E, $9A ; おとこ:
#_08CEEB: db $F9 ; new line
#_08CEEC: db $D2, $20, $08 ; test progress bit 20 for message 08
#_08CEEF: db $F2, $15 ; prewritten text 15
#_08CEF1: db $2A, $53, $CF ; かぁ⎵
#_08CEF4: db $F2, $17 ; prewritten text 17
#_08CEF6: db $AD, $34, $26, $48 ; ぶたいや
#_08CEFA: db $F9 ; new line
#_08CEFB: db $F2, $1B ; prewritten text 1B
#_08CEFD: db $9E, $52, $38, $CF, $34, $34, $2A, $27 ; ぐんと⎵たたかう
#_08CF05: db $39, $52, $37 ; なんて
#_08CF08: db $F9 ; new line
#_08CF09: db $31, $A0, $26, $4A, $39, $53 ; すごいよなぁ
#_08CF0F: db $FC ; wait for key and new line
#_08CF10: db $FA ; clear message box
#_08CF11: db $2B, $58, $38, $CF ; きっと⎵
#_08CF15: db $F2, $16 ; prewritten text 16
#_08CF17: db $3E, $CF, $25, $34, $43, $9C, $4A, $2C ; は⎵あたまがよく
#_08CF1F: db $37 ; て
#_08CF20: db $F9 ; new line
#_08CF21: db $AA, $2B, $57, $27, $47, $25, $4D, $3F ; どきょうもあるひ
#_08CF29: db $38, $CF, $A6, $4F, $27, $39, $53 ; と⎵だろうなぁ
#_08CF30: db $FC ; wait for key and new line
#_08CF31: db $FF ; end of message

;===================================================================================================

; «レジスタンス»の «リーダー»が
; おんなのこ だってうわさがあるけど
; しんじられないなぁ
Message_00_0A_08:
#_08CF32: db $F2, $15 ; prewritten text 15
#_08CF34: db $3D, $CF ; の⎵
#_08CF36: db $F2, $16 ; prewritten text 16
#_08CF38: db $9C ; が
#_08CF39: db $F9 ; new line
#_08CF3A: db $29, $52, $39, $3D, $2E, $CF, $A6, $58 ; おんなのこ⎵だっ
#_08CF42: db $37, $27, $50, $2F, $9C, $25, $4D, $2D ; てうわさがあるけ
#_08CF4A: db $AA ; ど
#_08CF4B: db $FC ; wait for key and new line
#_08CF4C: db $30, $52, $A2, $4B, $4E, $39, $26, $39 ; しんじられないな
#_08CF54: db $53 ; ぁ
#_08CF55: db $FC ; wait for key and new line
#_08CF56: db $FF ; end of message

;===================================================================================================

; オカマ:
; さいきん おんなのこが さらわれてるんですって
; あたしだったら おとこのこ さらうわよ
Message_00_0A_09:
#_08CF57: db $D2, $2F, $31 ; test progress bit 2F for message 31
#_08CF5A: db $D6, $00, $69, $70, $28 ; place sprite 69 in slot 00 at XY:{70,28}
#_08CF5F: db $61, $62, $7B, $9A ; オカマ:
#_08CF63: db $F9 ; new line
#_08CF64: db $D2, $26, $0A ; test progress bit 26 for message 0A
#_08CF67: db $2F, $26, $2B, $52, $CF, $29, $52, $39 ; さいきん⎵おんな
#_08CF6F: db $3D, $2E, $9C, $CF, $2F, $4B, $50, $4E ; のこが⎵さらわれ
#_08CF77: db $37, $4D, $52, $A9, $31, $58, $37 ; てるんですって
#_08CF7E: db $F9 ; new line
#_08CF7F: db $25, $34, $30, $A6, $58, $34, $4B, $CF ; あたしだったら⎵
#_08CF87: db $29, $38, $2E, $3D, $2E, $CF, $2F, $4B ; おとこのこ⎵さら
#_08CF8F: db $27, $50, $4A ; うわよ
#_08CF92: db $FC ; wait for key and new line
#_08CF93: db $FF ; end of message

;===================================================================================================

; おんなのこが しけいに なるんだって
; でも おとこのこ じゃなくて よかったわよ
Message_00_0A_0A:
#_08CF94: db $29, $52, $39, $3D, $2E, $9C, $CF, $30 ; おんなのこが⎵し
#_08CF9C: db $2D, $26, $3A, $CF, $39, $4D, $52, $A6 ; けいに⎵なるんだ
#_08CFA4: db $58, $37 ; って
#_08CFA6: db $F9 ; new line
#_08CFA7: db $A9, $47, $CF, $29, $38, $2E, $3D, $2E ; でも⎵おとこのこ
#_08CFAF: db $CF, $A2, $55, $39, $2C, $37, $CF, $4A ; ⎵じゃなくて⎵よ
#_08CFB7: db $2A, $58, $34, $50, $4A ; かったわよ
#_08CFBC: db $FC ; wait for key and new line
#_08CFBD: db $FF ; end of message

;===================================================================================================

; おとこ:
; おまえら おんなを さがしてるのか?
; だったら J.B.に きいてみな
; ヤツなら ディスコで おどってるよ
Message_00_0A_0B:
#_08CFBE: db $D2, $2F, $3C ; test progress bit 2F for message 3C
#_08CFC1: db $D6, $01, $56, $48, $38 ; place sprite 56 in slot 01 at XY:{48,38}
#_08CFC6: db $D6, $02, $56, $98, $38 ; place sprite 56 in slot 02 at XY:{98,38}
#_08CFCB: db $D6, $00, $4A, $78, $28 ; place sprite 4A in slot 00 at XY:{78,28}
#_08CFD0: db $29, $38, $2E, $9A ; おとこ:
#_08CFD4: db $F9 ; new line
#_08CFD5: db $29, $43, $28, $4B, $CF, $29, $52, $39 ; おまえら⎵おんな
#_08CFDD: db $51, $CF, $2F, $9C, $30, $37, $4D, $3D ; を⎵さがしてるの
#_08CFE5: db $2A, $95 ; か?
#_08CFE7: db $F9 ; new line
#_08CFE8: db $A6, $58, $34, $4B, $CF, $14, $9B, $0C ; だったら⎵J.B
#_08CFF0: db $9B, $3A, $CF, $2B, $26, $37, $44, $39 ; .に⎵きいてみな
#_08CFF8: db $F9 ; new line
#_08CFF9: db $80, $6E, $39, $4B, $CF, $C2, $8C, $69 ; ヤツなら⎵ディス
#_08D001: db $66, $A9, $CF, $29, $AA, $58, $37, $4D ; コで⎵おどってる
#_08D009: db $4A ; よ
#_08D00A: db $FC ; wait for key and new line
#_08D00B: db $FF ; end of message

;===================================================================================================

; おとこ:
; «・・・»き きっと «アメリカ»ぐんは
; ミサイルを うってくるぞ たすけてくれ!
Message_00_0A_0C:
#_08D00C: db $D2, $2F, $3A ; test progress bit 2F for message 3A
#_08D00F: db $D6, $00, $29, $70, $28 ; place sprite 29 in slot 00 at XY:{70,28}
#_08D014: db $29, $38, $2E, $9A ; おとこ:
#_08D018: db $F9 ; new line
#_08D019: db $F2, $0B ; prewritten text 0B
#_08D01B: db $2B, $CF, $2B, $58, $38, $CF ; き⎵きっと⎵
#_08D021: db $F2, $1B ; prewritten text 1B
#_08D023: db $9E, $52, $3E ; ぐんは
#_08D026: db $F9 ; new line
#_08D027: db $7C, $67, $5E, $85, $51, $CF, $27, $58 ; ミサイルを⎵うっ
#_08D02F: db $37, $2C, $4D, $A5, $CF, $34, $31, $2D ; てくるぞ⎵たすけ
#_08D037: db $37, $2C, $4E, $94 ; てくれ!
#_08D03B: db $FC ; wait for key and new line
#_08D03C: db $FF ; end of message

;===================================================================================================

; おんな:
; きみわるいバケモノは でてくるし
; «かいげんれい»で どうろは ふさがれるし
; わたし うちに かえれない
; «・・・»どうしたら いいのよ«・・・»
Message_00_0A_0D:
#_08D03D: db $D2, $2F, $33 ; test progress bit 2F for message 33
#_08D040: db $D6, $00, $44, $78, $28 ; place sprite 44 in slot 00 at XY:{78,28}
#_08D045: db $29, $52, $39, $9A ; おんな:
#_08D049: db $F9 ; new line
#_08D04A: db $2B, $44, $50, $4D, $26, $C4, $65, $7F ; きみわるいバケモ
#_08D052: db $75, $3E, $CF, $A9, $37, $2C, $4D, $30 ; ノは⎵でてくるし
#_08D05A: db $F9 ; new line
#_08D05B: db $F2, $30 ; prewritten text 30
#_08D05D: db $A9, $CF, $AA, $27, $4F, $3E, $CF, $40 ; で⎵どうろは⎵ふ
#_08D065: db $2F, $9C, $4E, $4D, $30 ; さがれるし
#_08D06A: db $FC ; wait for key and new line
#_08D06B: db $FA ; clear message box
#_08D06C: db $50, $34, $30, $CF, $27, $35, $3A, $CF ; わたし⎵うちに⎵
#_08D074: db $2A, $28, $4E, $39, $26 ; かえれない
#_08D079: db $F9 ; new line
#_08D07A: db $F2, $0B ; prewritten text 0B
#_08D07C: db $AA, $27, $30, $34, $4B, $CF, $26, $26 ; どうしたら⎵いい
#_08D084: db $3D, $4A ; のよ
#_08D086: db $F2, $0B ; prewritten text 0B
#_08D088: db $FC ; wait for key and new line
#_08D089: db $FF ; end of message

;===================================================================================================

; おんな:
; たくさんの くろいかげが とびまわって«・・・»
; おおきな ひかりが かがやきだして«・・・»
; おおぜいの ひとの うめきごえが きこえ«・・・»
; でも くろいかげは きえない«・・・»
; «・・・»ああ あたまが いたい
Message_00_0A_0E:
#_08D08A: db $D2, $2F, $34 ; test progress bit 2F for message 34
#_08D08D: db $D6, $00, $47, $78, $28 ; place sprite 47 in slot 00 at XY:{78,28}
#_08D092: db $29, $52, $39, $9A ; おんな:
#_08D096: db $F9 ; new line
#_08D097: db $34, $2C, $2F, $52, $3D, $CF, $2C, $4F ; たくさんの⎵くろ
#_08D09F: db $26, $2A, $9F, $9C, $CF, $38, $AC, $43 ; いかげが⎵とびま
#_08D0A7: db $50, $58, $37 ; わって
#_08D0AA: db $F2, $0B ; prewritten text 0B
#_08D0AC: db $F9 ; new line
#_08D0AD: db $29, $29, $2B, $39, $CF, $3F, $2A, $4C ; おおきな⎵ひかり
#_08D0B5: db $9C, $CF, $2A, $9C, $48, $2B, $A6, $30 ; が⎵かがやきだし
#_08D0BD: db $37 ; て
#_08D0BE: db $F2, $0B ; prewritten text 0B
#_08D0C0: db $FC ; wait for key and new line
#_08D0C1: db $FA ; clear message box
#_08D0C2: db $29, $29, $A4, $26, $3D, $CF, $3F, $38 ; おおぜいの⎵ひと
#_08D0CA: db $3D, $CF, $27, $46, $2B, $A0, $28, $9C ; の⎵うめきごえが
#_08D0D2: db $CF, $2B, $2E, $28 ; ⎵きこえ
#_08D0D6: db $F2, $0B ; prewritten text 0B
#_08D0D8: db $F9 ; new line
#_08D0D9: db $A9, $47, $CF, $2C, $4F, $26, $2A, $9F ; でも⎵くろいかげ
#_08D0E1: db $3E, $CF, $2B, $28, $39, $26 ; は⎵きえない
#_08D0E7: db $F2, $0B ; prewritten text 0B
#_08D0E9: db $F9 ; new line
#_08D0EA: db $F2, $0B ; prewritten text 0B
#_08D0EC: db $25, $25, $CF, $25, $34, $43, $9C, $CF ; ああ⎵あたまが⎵
#_08D0F4: db $26, $34, $26 ; いたい
#_08D0F7: db $FC ; wait for key and new line
#_08D0F8: db $FF ; end of message

;===================================================================================================

; おんなのこ:
; あたし へんなやつに こえかけられたの
; おまえは [MOMO] か?って
; ちがうっていったら
; そいつ ほかのこに こえかけてたよ
Message_00_0A_0F:
#_08D0F9: db $D2, $2F, $36 ; test progress bit 2F for message 36
#_08D0FC: db $D6, $00, $48, $78, $28 ; place sprite 48 in slot 00 at XY:{78,28}
#_08D101: db $29, $52, $39, $3D, $2E, $9A ; おんなのこ:
#_08D107: db $F9 ; new line
#_08D108: db $25, $34, $30, $CF, $41, $52, $39, $48 ; あたし⎵へんなや
#_08D110: db $36, $3A, $CF, $2E, $28, $2A, $2D, $4B ; つに⎵こえかけら
#_08D118: db $4E, $34, $3D ; れたの
#_08D11B: db $F9 ; new line
#_08D11C: db $29, $43, $28, $3E, $CF ; おまえは⎵
#_08D121: db $ED ; write female protag name
#_08D122: db $CF, $2A, $95, $58, $37 ; ⎵か?って
#_08D127: db $FC ; wait for key and new line
#_08D128: db $FA ; clear message box
#_08D129: db $35, $9C, $27, $58, $37, $26, $58, $34 ; ちがうっていった
#_08D131: db $4B ; ら
#_08D132: db $F9 ; new line
#_08D133: db $33, $26, $36, $CF, $42, $2A, $3D, $2E ; そいつ⎵ほかのこ
#_08D13B: db $3A, $CF, $2E, $28, $2A, $2D, $37, $34 ; に⎵こえかけてた
#_08D143: db $4A ; よ
#_08D144: db $FC ; wait for key and new line
#_08D145: db $FF ; end of message

;===================================================================================================

; じえいかん:
; ゴトウ«しれいかん»の みぎうで オザワか
; おれは あまり きにいらん
; やつなら «シンジュク»からでて
; ホクセイの ビルに いるよ
Message_00_0A_10:
#_08D146: db $D2, $2F, $47 ; test progress bit 2F for message 47
#_08D149: db $D6, $01, $56, $48, $38 ; place sprite 56 in slot 01 at XY:{48,38}
#_08D14E: db $D6, $02, $56, $98, $38 ; place sprite 56 in slot 02 at XY:{98,38}
#_08D153: db $D6, $00, $5C, $70, $28 ; place sprite 5C in slot 00 at XY:{70,28}
#_08D158: db $A2, $28, $26, $2A, $52, $9A ; じえいかん:
#_08D15E: db $F9 ; new line
#_08D15F: db $D2, $26, $11 ; test progress bit 26 for message 11
#_08D162: db $B9, $70, $5F ; ゴトウ
#_08D165: db $F2, $20 ; prewritten text 20
#_08D167: db $3D, $CF, $44, $9D, $27, $A9, $CF, $61 ; の⎵みぎうで⎵オ
#_08D16F: db $BA, $88, $2A ; ザワか
#_08D172: db $F9 ; new line
#_08D173: db $29, $4E, $3E, $CF, $25, $43, $4C, $CF ; おれは⎵あまり⎵
#_08D17B: db $2B, $3A, $26, $4B, $52 ; きにいらん
#_08D180: db $F9 ; new line
#_08D181: db $48, $36, $39, $4B, $CF ; やつなら⎵
#_08D186: db $F2, $18 ; prewritten text 18
#_08D188: db $2A, $4B, $A9, $37 ; からでて
#_08D18C: db $F9 ; new line
#_08D18D: db $7A, $64, $6A, $5E, $3D, $CF, $C5, $85 ; ホクセイの⎵ビル
#_08D195: db $3A, $CF, $26, $4D, $4A ; に⎵いるよ
#_08D19A: db $FC ; wait for key and new line
#_08D19B: db $FF ; end of message

;===================================================================================================

; ついに «レジスタンス»の «リーダー»が
; つかまったらしい
; おれたちを さんざん なやませたんだ
; しけいに なってしまうだろう
Message_00_0A_11:
#_08D19C: db $36, $26, $3A, $CF ; ついに⎵
#_08D1A0: db $F2, $15 ; prewritten text 15
#_08D1A2: db $3D, $CF ; の⎵
#_08D1A4: db $F2, $16 ; prewritten text 16
#_08D1A6: db $9C ; が
#_08D1A7: db $F9 ; new line
#_08D1A8: db $36, $2A, $43, $58, $34, $4B, $30, $26 ; つかまったらしい
#_08D1B0: db $F9 ; new line
#_08D1B1: db $29, $4E, $34, $35, $51, $CF, $2F, $52 ; おれたちを⎵さん
#_08D1B9: db $A1, $52, $CF, $39, $48, $43, $32, $34 ; ざん⎵なやませた
#_08D1C1: db $52, $A6 ; んだ
#_08D1C3: db $F9 ; new line
#_08D1C4: db $30, $2D, $26, $3A, $CF, $39, $58, $37 ; しけいに⎵なって
#_08D1CC: db $30, $43, $27, $A6, $4F, $27 ; しまうだろう
#_08D1D2: db $FC ; wait for key and new line
#_08D1D3: db $FF ; end of message

;===================================================================================================

; じえいかん:
; «アメリカ»たいしは ゴトウ«しれいかん»の
; かんがえを りかい しようともせず
; ぐんを だしてきた
Message_00_0A_12:
#_08D1D4: db $D2, $2F, $4A ; test progress bit 2F for message 4A
#_08D1D7: db $D6, $01, $56, $48, $38 ; place sprite 56 in slot 01 at XY:{48,38}
#_08D1DC: db $D6, $02, $56, $98, $38 ; place sprite 56 in slot 02 at XY:{98,38}
#_08D1E1: db $D6, $00, $5C, $70, $28 ; place sprite 5C in slot 00 at XY:{70,28}
#_08D1E6: db $A2, $28, $26, $2A, $52, $9A ; じえいかん:
#_08D1EC: db $F9 ; new line
#_08D1ED: db $F2, $1B ; prewritten text 1B
#_08D1EF: db $34, $26, $30, $3E, $CF, $B9, $70, $5F ; たいしは⎵ゴトウ
#_08D1F7: db $F2, $20 ; prewritten text 20
#_08D1F9: db $3D ; の
#_08D1FA: db $F9 ; new line
#_08D1FB: db $2A, $52, $9C, $28, $51, $CF, $4C, $2A ; かんがえを⎵りか
#_08D203: db $26, $CF, $30, $4A, $27, $38, $47, $32 ; い⎵しようともせ
#_08D20B: db $A3 ; ず
#_08D20C: db $F9 ; new line
#_08D20D: db $9E, $52, $51, $CF, $A6, $30, $37, $2B ; ぐんを⎵だしてき
#_08D215: db $34 ; た
#_08D216: db $FC ; wait for key and new line
#_08D217: db $FF ; end of message

;===================================================================================================

; じえいかん:
; このまま ぶんめいが しんぽしても
; じんるいには はめつの みちしか のこっていない
; それを しんぱいした ゴトウ«しれいかん»は
; こうどうを おこしたのだ
Message_00_0A_13:
#_08D218: db $D2, $2F, $3E ; test progress bit 2F for message 3E
#_08D21B: db $D6, $01, $56, $48, $38 ; place sprite 56 in slot 01 at XY:{48,38}
#_08D220: db $D6, $02, $56, $98, $38 ; place sprite 56 in slot 02 at XY:{98,38}
#_08D225: db $D6, $00, $5C, $70, $28 ; place sprite 5C in slot 00 at XY:{70,28}
#_08D22A: db $A2, $28, $26, $2A, $52, $9A ; じえいかん:
#_08D230: db $F9 ; new line
#_08D231: db $2E, $3D, $43, $43, $CF, $AD, $52, $46 ; このまま⎵ぶんめ
#_08D239: db $26, $9C, $CF, $30, $52, $B4, $30, $37 ; いが⎵しんぽして
#_08D241: db $47 ; も
#_08D242: db $F9 ; new line
#_08D243: db $A2, $52, $4D, $26, $3A, $3E, $CF, $3E ; じんるいには⎵は
#_08D24B: db $46, $36, $3D, $CF, $44, $35, $30, $2A ; めつの⎵みちしか
#_08D253: db $CF, $3D, $2E, $58, $37, $26, $39, $26 ; ⎵のこっていない
#_08D25B: db $F9 ; new line
#_08D25C: db $33, $4E, $51, $CF, $30, $52, $B0, $26 ; それを⎵しんぱい
#_08D264: db $30, $34, $CF, $B9, $70, $5F ; した⎵ゴトウ
#_08D26A: db $F2, $20 ; prewritten text 20
#_08D26C: db $3E ; は
#_08D26D: db $F9 ; new line
#_08D26E: db $2E, $27, $AA, $27, $51, $CF, $29, $2E ; こうどうを⎵おこ
#_08D276: db $30, $34, $3D, $A6 ; したのだ
#_08D27A: db $FC ; wait for key and new line
#_08D27B: db $FF ; end of message

;===================================================================================================

; «アメリカ»へい:
; ワガ «アメリカ»タイシ MR.トールマンハ
; «トウキョウ»ノ コンランミカネテ
; タチアガリマシタ カレコソ セイギデス
Message_00_0A_14:
#_08D27C: db $D2, $2F, $43 ; test progress bit 2F for message 43
#_08D27F: db $D6, $01, $56, $48, $38 ; place sprite 56 in slot 01 at XY:{48,38}
#_08D284: db $D6, $02, $56, $98, $38 ; place sprite 56 in slot 02 at XY:{98,38}
#_08D289: db $D6, $00, $5E, $70, $28 ; place sprite 5E in slot 00 at XY:{70,28}
#_08D28E: db $F2, $1B ; prewritten text 1B
#_08D290: db $41, $26, $9A ; へい:
#_08D293: db $F9 ; new line
#_08D294: db $88, $B5, $CF ; ワガ⎵
#_08D297: db $F2, $1B ; prewritten text 1B
#_08D299: db $6C, $5E, $68, $CF, $17, $1C, $9B, $70 ; タイシ⎵MR.ト
#_08D2A1: db $5A, $85, $7B, $8A, $76 ; ールマンハ
#_08D2A6: db $F9 ; new line
#_08D2A7: db $F2, $1C ; prewritten text 1C
#_08D2A9: db $75, $CF, $66, $8A, $83, $8A, $7C, $62 ; ノ⎵コンランミカ
#_08D2B1: db $74, $6F ; ネテ
#_08D2B3: db $F9 ; new line
#_08D2B4: db $6C, $6D, $5D, $B5, $84, $7B, $68, $6C ; タチアガリマシタ
#_08D2BC: db $CF, $62, $86, $66, $6B, $CF, $6A, $5E ; ⎵カレコソ⎵セイ
#_08D2C4: db $B6, $C2, $69 ; ギデス
#_08D2C7: db $FC ; wait for key and new line
#_08D2C8: db $FF ; end of message

;===================================================================================================

; «アメリカ»へい:
; ゴトウハ アクマ ヨビダシ リソウコッカ
; ツクルトカ イッテマス
; ソレヲ フセグタメ ワガグンハ ウゴキマシタ
Message_00_0A_15:
#_08D2C9: db $D2, $2F, $45 ; test progress bit 2F for message 45
#_08D2CC: db $D6, $01, $56, $48, $38 ; place sprite 56 in slot 01 at XY:{48,38}
#_08D2D1: db $D6, $02, $56, $98, $38 ; place sprite 56 in slot 02 at XY:{98,38}
#_08D2D6: db $D6, $00, $5E, $70, $28 ; place sprite 5E in slot 00 at XY:{70,28}
#_08D2DB: db $F2, $1B ; prewritten text 1B
#_08D2DD: db $41, $26, $9A ; へい:
#_08D2E0: db $F9 ; new line
#_08D2E1: db $B9, $70, $5F, $76, $CF, $5D, $64, $7B ; ゴトウハ⎵アクマ
#_08D2E9: db $CF, $82, $C5, $BF, $68, $CF, $84, $6B ; ⎵ヨビダシ⎵リソ
#_08D2F1: db $5F, $66, $92, $62 ; ウコッカ
#_08D2F5: db $F9 ; new line
#_08D2F6: db $6E, $64, $85, $70, $62, $CF, $5E, $92 ; ツクルトカ⎵イッ
#_08D2FE: db $6F, $7B, $69 ; テマス
#_08D301: db $F9 ; new line
#_08D302: db $6B, $86, $89, $CF, $78, $6A, $B7, $6C ; ソレヲ⎵フセグタ
#_08D30A: db $7E, $CF, $88, $B5, $B7, $8A, $76, $CF ; メ⎵ワガグンハ⎵
#_08D312: db $5F, $B9, $63, $7B, $68, $6C ; ウゴキマシタ
#_08D318: db $FC ; wait for key and new line
#_08D319: db $FF ; end of message

;===================================================================================================

; «アメリカ»へい:
; トールマンタイシ スバラシイヒトデース
; カレノイウコト ナンデモ キキマース
Message_00_0A_16:
#_08D31A: db $D2, $2F, $4B ; test progress bit 2F for message 4B
#_08D31D: db $D6, $01, $56, $48, $38 ; place sprite 56 in slot 01 at XY:{48,38}
#_08D322: db $D6, $02, $56, $98, $38 ; place sprite 56 in slot 02 at XY:{98,38}
#_08D327: db $D6, $00, $5E, $70, $28 ; place sprite 5E in slot 00 at XY:{70,28}
#_08D32C: db $F2, $1B ; prewritten text 1B
#_08D32E: db $41, $26, $9A ; へい:
#_08D331: db $F9 ; new line
#_08D332: db $70, $5A, $85, $7B, $8A, $6C, $5E, $68 ; トールマンタイシ
#_08D33A: db $CF, $69, $C4, $83, $68, $5E, $77, $70 ; ⎵スバラシイヒト
#_08D342: db $C2, $5A, $69 ; デース
#_08D345: db $F9 ; new line
#_08D346: db $62, $86, $75, $5E, $5F, $66, $70, $CF ; カレノイウコト⎵
#_08D34E: db $71, $8A, $C2, $7F, $CF, $63, $63, $7B ; ナンデモ⎵キキマ
#_08D356: db $5A, $69 ; ース
#_08D358: db $FC ; wait for key and new line
#_08D359: db $FF ; end of message

;===================================================================================================

; ゆりこ:
; あら また あったわね
; あたし こういう しずかなみせが すきなの
Message_00_0A_17:
#_08D35A: db $D2, $2F, $38 ; test progress bit 2F for message 38
#_08D35D: db $D2, $28, $19 ; test progress bit 28 for message 19
#_08D360: db $D6, $01, $56, $48, $38 ; place sprite 56 in slot 01 at XY:{48,38}
#_08D365: db $D6, $02, $56, $98, $38 ; place sprite 56 in slot 02 at XY:{98,38}
#_08D36A: db $D2, $22, $18 ; test progress bit 22 for message 18
#_08D36D: db $D6, $00, $2C, $70, $28 ; place sprite 2C in slot 00 at XY:{70,28}
#_08D372: db $49, $4C, $2E, $9A ; ゆりこ:
#_08D376: db $F9 ; new line
#_08D377: db $25, $4B, $CF, $43, $34, $CF, $25, $58 ; あら⎵また⎵あっ
#_08D37F: db $34, $50, $3C ; たわね
#_08D382: db $F9 ; new line
#_08D383: db $25, $34, $30, $CF, $2E, $27, $26, $27 ; あたし⎵こういう
#_08D38B: db $CF, $30, $A3, $2A, $39, $44, $32, $9C ; ⎵しずかなみせが
#_08D393: db $CF, $31, $2B, $39, $3D ; ⎵すきなの
#_08D398: db $FC ; wait for key and new line
#_08D399: db $D0, $22 ; set progress bit 22
#_08D39B: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
Message_00_0A_18:
#_08D39C: db $97 ; >
#_08D39D: db $F2, $2C ; prewritten text 2C
#_08D39F: db $FC ; wait for key and new line
#_08D3A0: db $FF ; end of message

;===================================================================================================

; «レジスタンス»のおとこ:
; たいへんな ことに なった
; «われわれ»の «リーダー»が
; しょけい されてしまう!
; «とちょうまえひろば»で こうかいしょけいに
; されてしまうんだ!
; たのむ たすけてくれ«・・・»
Message_00_0A_19:
#_08D3A1: db $D2, $0A, $18 ; test progress bit 0A for message 18
#_08D3A4: db $D6, $00, $82, $70, $28 ; place sprite 82 in slot 00 at XY:{70,28}
#_08D3A9: db $F2, $15 ; prewritten text 15
#_08D3AB: db $3D, $29, $38, $2E, $9A ; のおとこ:
#_08D3B0: db $F9 ; new line
#_08D3B1: db $D2, $27, $1A ; test progress bit 27 for message 1A
#_08D3B4: db $34, $26, $41, $52, $39, $CF, $2E, $38 ; たいへんな⎵こと
#_08D3BC: db $3A, $CF, $39, $58, $34 ; に⎵なった
#_08D3C1: db $FC ; wait for key and new line
#_08D3C2: db $FA ; clear message box
#_08D3C3: db $F2, $02 ; prewritten text 02
#_08D3C5: db $3D, $CF ; の⎵
#_08D3C7: db $F2, $16 ; prewritten text 16
#_08D3C9: db $9C ; が
#_08D3CA: db $F9 ; new line
#_08D3CB: db $30, $57, $2D, $26, $CF, $2F, $4E, $37 ; しょけい⎵されて
#_08D3D3: db $30, $43, $27, $94 ; しまう!
#_08D3D7: db $F9 ; new line
#_08D3D8: db $F2, $1F ; prewritten text 1F
#_08D3DA: db $A9, $CF, $2E, $27, $2A, $26, $30, $57 ; で⎵こうかいしょ
#_08D3E2: db $2D, $26, $3A ; けいに
#_08D3E5: db $F9 ; new line
#_08D3E6: db $2F, $4E, $37, $30, $43, $27, $52, $A6 ; されてしまうんだ
#_08D3EE: db $94 ; !
#_08D3EF: db $FC ; wait for key and new line
#_08D3F0: db $FA ; clear message box
#_08D3F1: db $34, $3D, $45, $CF, $34, $31, $2D, $37 ; たのむ⎵たすけて
#_08D3F9: db $2C, $4E ; くれ
#_08D3FB: db $F2, $0B ; prewritten text 0B
#_08D3FD: db $FC ; wait for key and new line
#_08D3FE: db $D0, $26 ; set progress bit 26
#_08D400: db $FF ; end of message

;===================================================================================================

; «リーダー»を たすけてくれて
; ほんとうに ありがとう
; [MOMO]のこえ:
; [CHASE]さんたちが きたのですね?
; «レジスタンス»のおとこ:
; はい そうです
; [MOMO]:
; [CHASE]さん«・・・»
; [JIMMY]さん«・・・»
; [HIM]さん«・・・»
; ほんとうに «ありがとうございました»
; «あなたがた»は わたしの いのち だけではなく
; «トウキョウ»の はめつを かいひする
; さいごの きぼうも すくってくれたのです
; おれいに わたしたちが つかんだじょうほうを
; おおしえしましょう
; [JIMMY]さん あなたが おさがしの
; [MOMO]さんは «イチガヤ»の
; «クーデター»ぶたい しれいぶに
; つれさられたようです
; [JIMMY]:
; そうだったのか«・・・»
; [MOMO]:
; [HIM]さん
; あなたも よくごぞんじの オザワ
; かれと そのグループの かくれがを
; «われわれ»は つきとめました
; そこを おそって オザワたちを とらえる
; さくせんを まもなくはじめます
; [JIMMY]:
; [CHASE]くん ぼくは
; [MOMO]を たすけにいきます
; はやく しないと まにあわない かもしれません
; [HIM]:
; [CHASE] わるいが おれも
; «レジスタンス»の さくせんに いくぜ
; オザワは どうしても ほうっておけないんだ
; [MOMO]:
; あなた ひとりに なってしまいましたね«・・・»
; おねがいします
; わたしと こうどうを ともに してください
; «イチガヤ»の ゴトウと
; «アメリカ»たいしに あわなければ なりません
; «トウキョウ»を はめつから すくうために
; >[MOMO]が «ナカマに くわわった»
; [MOMO]:
; «イチガヤ»の «クーデター»ぶたい しれいぶは
; «シンジュク»から ヒガシへ いったところです
; «アメリカ»たいしかんは «ロッポンギ»に ありますが
; «イチガヤ»のミナミの ヨツヤから
; ちかを とおらなければ いけないでしょう
; わたしたちが よういした
; この [ITEM]が あれば
; どちらの なかにも はいれます
; >[CHASE]は [ITEM]を
; «てにいれた»
; [MOMO]:
; さあ いきましょう
Message_00_0A_1A:
#_08D401: db $F2, $16 ; prewritten text 16
#_08D403: db $51, $CF, $34, $31, $2D, $37, $2C, $4E ; を⎵たすけてくれ
#_08D40B: db $37 ; て
#_08D40C: db $F9 ; new line
#_08D40D: db $42, $52, $38, $27, $3A, $CF, $25, $4C ; ほんとうに⎵あり
#_08D415: db $9C, $38, $27 ; がとう
#_08D418: db $FC ; wait for key and new line
#_08D419: db $E9, $0C, $1B ; go to message 1B maybe TODO
#_08D41C: db $FA ; clear message box
#_08D41D: db $ED ; write female protag name
#_08D41E: db $3D, $2E, $28, $9A ; のこえ:
#_08D422: db $F9 ; new line
#_08D423: db $F0 ; write player name
#_08D424: db $2F, $52, $34, $35, $9C, $CF, $2B, $34 ; さんたちが⎵きた
#_08D42C: db $3D, $A9, $31, $3C, $95 ; のですね?
#_08D431: db $FC ; wait for key and new line
#_08D432: db $FA ; clear message box
#_08D433: db $F2, $15 ; prewritten text 15
#_08D435: db $3D, $29, $38, $2E, $9A ; のおとこ:
#_08D43A: db $F9 ; new line
#_08D43B: db $3E, $26, $CF, $33, $27, $A9, $31 ; はい⎵そうです
#_08D442: db $FC ; wait for key and new line
#_08D443: db $D6, $00, $00 ; delete sprite in slot 00
#_08D446: db $FA ; clear message box
#_08D447: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08D44A: db $D6, $00, $4C, $78, $28 ; place sprite 4C in slot 00 at XY:{78,28}
#_08D44F: db $ED ; write female protag name
#_08D450: db $9A ; :
#_08D451: db $F9 ; new line
#_08D452: db $F0 ; write player name
#_08D453: db $2F, $52 ; さん
#_08D455: db $F2, $0B ; prewritten text 0B
#_08D457: db $F9 ; new line
#_08D458: db $EE ; write lawful hero name
#_08D459: db $2F, $52 ; さん
#_08D45B: db $F2, $0B ; prewritten text 0B
#_08D45D: db $F9 ; new line
#_08D45E: db $EF ; write chaos hero name
#_08D45F: db $2F, $52 ; さん
#_08D461: db $F2, $0B ; prewritten text 0B
#_08D463: db $F9 ; new line
#_08D464: db $42, $52, $38, $27, $3A, $CF ; ほんとうに⎵
#_08D46A: db $F2, $31 ; prewritten text 31
#_08D46C: db $FC ; wait for key and new line
#_08D46D: db $FA ; clear message box
#_08D46E: db $F2, $03 ; prewritten text 03
#_08D470: db $3E, $CF, $50, $34, $30, $3D, $CF, $26 ; は⎵わたしの⎵い
#_08D478: db $3D, $35, $CF, $A6, $2D, $A9, $3E, $39 ; のち⎵だけではな
#_08D480: db $2C ; く
#_08D481: db $F9 ; new line
#_08D482: db $F2, $1C ; prewritten text 1C
#_08D484: db $3D, $CF, $3E, $46, $36, $51, $CF, $2A ; の⎵はめつを⎵か
#_08D48C: db $26, $3F, $31, $4D ; いひする
#_08D490: db $F9 ; new line
#_08D491: db $2F, $26, $A0, $3D, $CF, $2B, $AF, $27 ; さいごの⎵きぼう
#_08D499: db $47, $CF, $31, $2C, $58, $37, $2C, $4E ; も⎵すくってくれ
#_08D4A1: db $34, $3D, $A9, $31 ; たのです
#_08D4A5: db $FC ; wait for key and new line
#_08D4A6: db $FA ; clear message box
#_08D4A7: db $29, $4E, $26, $3A, $CF, $50, $34, $30 ; おれいに⎵わたし
#_08D4AF: db $34, $35, $9C, $CF, $36, $2A, $52, $A6 ; たちが⎵つかんだ
#_08D4B7: db $A2, $57, $27, $42, $27, $51 ; じょうほうを
#_08D4BD: db $F9 ; new line
#_08D4BE: db $29, $29, $30, $28, $30, $43, $30, $57 ; おおしえしましょ
#_08D4C6: db $27 ; う
#_08D4C7: db $FC ; wait for key and new line
#_08D4C8: db $FA ; clear message box
#_08D4C9: db $EE ; write lawful hero name
#_08D4CA: db $2F, $52, $CF, $25, $39, $34, $9C, $CF ; さん⎵あなたが⎵
#_08D4D2: db $29, $2F, $9C, $30, $3D ; おさがしの
#_08D4D7: db $F9 ; new line
#_08D4D8: db $ED ; write female protag name
#_08D4D9: db $2F, $52, $3E, $CF ; さんは⎵
#_08D4DD: db $F2, $19 ; prewritten text 19
#_08D4DF: db $3D ; の
#_08D4E0: db $F9 ; new line
#_08D4E1: db $F2, $17 ; prewritten text 17
#_08D4E3: db $AD, $34, $26, $CF, $30, $4E, $26, $AD ; ぶたい⎵しれいぶ
#_08D4EB: db $3A ; に
#_08D4EC: db $F9 ; new line
#_08D4ED: db $36, $4E, $2F, $4B, $4E, $34, $4A, $27 ; つれさられたよう
#_08D4F5: db $A9, $31 ; です
#_08D4F7: db $FC ; wait for key and new line
#_08D4F8: db $D4, $03 ; set text box size to 3
#_08D4FA: db $EE ; write lawful hero name
#_08D4FB: db $9A ; :
#_08D4FC: db $F9 ; new line
#_08D4FD: db $33, $27, $A6, $58, $34, $3D, $2A ; そうだったのか
#_08D504: db $F2, $0B ; prewritten text 0B
#_08D506: db $FC ; wait for key and new line
#_08D507: db $FA ; clear message box
#_08D508: db $ED ; write female protag name
#_08D509: db $9A ; :
#_08D50A: db $F9 ; new line
#_08D50B: db $EF ; write chaos hero name
#_08D50C: db $2F, $52 ; さん
#_08D50E: db $F9 ; new line
#_08D50F: db $25, $39, $34, $47, $CF, $4A, $2C, $A0 ; あなたも⎵よくご
#_08D517: db $A5, $52, $A2, $3D, $CF, $61, $BA, $88 ; ぞんじの⎵オザワ
#_08D51F: db $F9 ; new line
#_08D520: db $2A, $4E, $38, $CF, $33, $3D, $B7, $85 ; かれと⎵そのグル
#_08D528: db $5A, $CB, $3D, $CF, $2A, $2C, $4E, $9C ; ープの⎵かくれが
#_08D530: db $51 ; を
#_08D531: db $F9 ; new line
#_08D532: db $F2, $02 ; prewritten text 02
#_08D534: db $3E, $CF, $36, $2B, $38, $46, $43, $30 ; は⎵つきとめまし
#_08D53C: db $34 ; た
#_08D53D: db $FC ; wait for key and new line
#_08D53E: db $FA ; clear message box
#_08D53F: db $33, $2E, $51, $CF, $29, $33, $58, $37 ; そこを⎵おそって
#_08D547: db $CF, $61, $BA, $88, $34, $35, $51, $CF ; ⎵オザワたちを⎵
#_08D54F: db $38, $4B, $28, $4D ; とらえる
#_08D553: db $F9 ; new line
#_08D554: db $2F, $2C, $32, $52, $51, $CF, $43, $47 ; さくせんを⎵まも
#_08D55C: db $39, $2C, $3E, $A2, $46, $43, $31 ; なくはじめます
#_08D563: db $FC ; wait for key and new line
#_08D564: db $D6, $00, $00 ; delete sprite in slot 00
#_08D567: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08D56A: db $D6, $00, $2E, $70, $28 ; place sprite 2E in slot 00 at XY:{70,28}
#_08D56F: db $FA ; clear message box
#_08D570: db $EE ; write lawful hero name
#_08D571: db $9A ; :
#_08D572: db $F9 ; new line
#_08D573: db $F0 ; write player name
#_08D574: db $2C, $52, $CF, $AF, $2C, $3E ; くん⎵ぼくは
#_08D57A: db $F9 ; new line
#_08D57B: db $ED ; write female protag name
#_08D57C: db $51, $CF, $34, $31, $2D, $3A, $26, $2B ; を⎵たすけにいき
#_08D584: db $43, $31 ; ます
#_08D586: db $F9 ; new line
#_08D587: db $3E, $48, $2C, $CF, $30, $39, $26, $38 ; はやく⎵しないと
#_08D58F: db $CF, $43, $3A, $25, $50, $39, $26, $CF ; ⎵まにあわない⎵
#_08D597: db $2A, $47, $30, $4E, $43, $32, $52 ; かもしれません
#_08D59E: db $FC ; wait for key and new line
#_08D59F: db $FA ; clear message box
#_08D5A0: db $D6, $00, $00 ; delete sprite in slot 00
#_08D5A3: db $FE, $27, $02 ; ext command 27: something 02 TODO
#_08D5A6: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08D5A9: db $DE, $01, $00, $35, $01 ; load 1x demon 0135
#_08D5AE: db $E4, $00 ; load demon $00
#_08D5B0: db $EF ; write chaos hero name
#_08D5B1: db $9A ; :
#_08D5B2: db $F9 ; new line
#_08D5B3: db $F0 ; write player name
#_08D5B4: db $CF, $50, $4D, $26, $9C, $CF, $29, $4E ; ⎵わるいが⎵おれ
#_08D5BC: db $47 ; も
#_08D5BD: db $F9 ; new line
#_08D5BE: db $F2, $15 ; prewritten text 15
#_08D5C0: db $3D, $CF, $2F, $2C, $32, $52, $3A, $CF ; の⎵さくせんに⎵
#_08D5C8: db $26, $2C, $A4 ; いくぜ
#_08D5CB: db $F9 ; new line
#_08D5CC: db $61, $BA, $88, $3E, $CF, $AA, $27, $30 ; オザワは⎵どうし
#_08D5D4: db $37, $47, $CF, $42, $27, $58, $37, $29 ; ても⎵ほうってお
#_08D5DC: db $2D, $39, $26, $52, $A6 ; けないんだ
#_08D5E1: db $FC ; wait for key and new line
#_08D5E2: db $FA ; clear message box
#_08D5E3: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08D5E5: db $FE, $27, $03 ; ext command 27: something 03 TODO
#_08D5E8: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08D5EB: db $D6, $00, $4C, $78, $28 ; place sprite 4C in slot 00 at XY:{78,28}
#_08D5F0: db $ED ; write female protag name
#_08D5F1: db $9A ; :
#_08D5F2: db $F9 ; new line
#_08D5F3: db $25, $39, $34, $CF, $3F, $38, $4C, $3A ; あなた⎵ひとりに
#_08D5FB: db $CF, $39, $58, $37, $30, $43, $26, $43 ; ⎵なってしまいま
#_08D603: db $30, $34, $3C ; したね
#_08D606: db $F2, $0B ; prewritten text 0B
#_08D608: db $F9 ; new line
#_08D609: db $29, $3C, $9C, $26, $30, $43, $31 ; おねがいします
#_08D610: db $F9 ; new line
#_08D611: db $50, $34, $30, $38, $CF, $2E, $27, $AA ; わたしと⎵こうど
#_08D619: db $27, $51, $CF, $38, $47, $3A, $CF, $30 ; うを⎵ともに⎵し
#_08D621: db $37, $2C, $A6, $2F, $26 ; てください
#_08D626: db $FC ; wait for key and new line
#_08D627: db $FA ; clear message box
#_08D628: db $F2, $19 ; prewritten text 19
#_08D62A: db $3D, $CF, $B9, $70, $5F, $38 ; の⎵ゴトウと
#_08D630: db $F9 ; new line
#_08D631: db $F2, $1B ; prewritten text 1B
#_08D633: db $34, $26, $30, $3A, $CF, $25, $50, $39 ; たいしに⎵あわな
#_08D63B: db $2D, $4E, $AB, $CF, $39, $4C, $43, $32 ; ければ⎵なりませ
#_08D643: db $52 ; ん
#_08D644: db $F9 ; new line
#_08D645: db $F2, $1C ; prewritten text 1C
#_08D647: db $51, $CF, $3E, $46, $36, $2A, $4B, $CF ; を⎵はめつから⎵
#_08D64F: db $31, $2C, $27, $34, $46, $3A ; すくうために
#_08D655: db $FC ; wait for key and new line
#_08D656: db $D4, $03 ; set text box size to 3
#_08D658: db $97 ; >
#_08D659: db $ED ; write female protag name
#_08D65A: db $9C, $CF ; が⎵
#_08D65C: db $F2, $2F ; prewritten text 2F
#_08D65E: db $FC ; wait for key and new line
#_08D65F: db $FE, $26, $01 ; ext command 26: something 01 TODO
#_08D662: db $FA ; clear message box
#_08D663: db $ED ; write female protag name
#_08D664: db $9A ; :
#_08D665: db $F9 ; new line
#_08D666: db $F2, $19 ; prewritten text 19
#_08D668: db $3D, $CF ; の⎵
#_08D66A: db $F2, $17 ; prewritten text 17
#_08D66C: db $AD, $34, $26, $CF, $30, $4E, $26, $AD ; ぶたい⎵しれいぶ
#_08D674: db $3E ; は
#_08D675: db $F9 ; new line
#_08D676: db $F2, $18 ; prewritten text 18
#_08D678: db $2A, $4B, $CF, $77, $B5, $68, $41, $CF ; から⎵ヒガシへ⎵
#_08D680: db $26, $58, $34, $38, $2E, $4F, $A9, $31 ; いったところです
#_08D688: db $FC ; wait for key and new line
#_08D689: db $FA ; clear message box
#_08D68A: db $F2, $1B ; prewritten text 1B
#_08D68C: db $34, $26, $30, $2A, $52, $3E, $CF ; たいしかんは⎵
#_08D693: db $F2, $4C ; prewritten text 4C
#_08D695: db $3A, $CF, $25, $4C, $43, $31, $9C ; に⎵ありますが
#_08D69C: db $F9 ; new line
#_08D69D: db $F2, $19 ; prewritten text 19
#_08D69F: db $3D, $7C, $71, $7C, $3D, $CF, $82, $6E ; のミナミの⎵ヨツ
#_08D6A7: db $80, $2A, $4B ; ヤから
#_08D6AA: db $F9 ; new line
#_08D6AB: db $35, $2A, $51, $CF, $38, $29, $4B, $39 ; ちかを⎵とおらな
#_08D6B3: db $2D, $4E, $AB, $CF, $26, $2D, $39, $26 ; ければ⎵いけない
#_08D6BB: db $A9, $30, $57, $27 ; でしょう
#_08D6BF: db $FC ; wait for key and new line
#_08D6C0: db $FA ; clear message box
#_08D6C1: db $E1, $F2 ; set $0A50 to item F2
#_08D6C3: db $50, $34, $30, $34, $35, $9C, $CF, $4A ; わたしたちが⎵よ
#_08D6CB: db $27, $26, $30, $34 ; ういした
#_08D6CF: db $F9 ; new line
#_08D6D0: db $2E, $3D, $CF ; この⎵
#_08D6D3: db $F3 ; write item name from $0A50
#_08D6D4: db $9C, $CF, $25, $4E, $AB ; が⎵あれば
#_08D6D9: db $F9 ; new line
#_08D6DA: db $AA, $35, $4B, $3D, $CF, $39, $2A, $3A ; どちらの⎵なかに
#_08D6E2: db $47, $CF, $3E, $26, $4E, $43, $31 ; も⎵はいれます
#_08D6E9: db $FC ; wait for key and new line
#_08D6EA: db $FA ; clear message box
#_08D6EB: db $97 ; >
#_08D6EC: db $F0 ; write player name
#_08D6ED: db $3E, $CF ; は⎵
#_08D6EF: db $F3 ; write item name from $0A50
#_08D6F0: db $51 ; を
#_08D6F1: db $F9 ; new line
#_08D6F2: db $F2, $2D ; prewritten text 2D
#_08D6F4: db $FC ; wait for key and new line
#_08D6F5: db $FE, $28 ; ext command 28: add item to inventory from $0A50
#_08D6F7: db $FA ; clear message box
#_08D6F8: db $ED ; write female protag name
#_08D6F9: db $9A ; :
#_08D6FA: db $F9 ; new line
#_08D6FB: db $2F, $25, $CF, $26, $2B, $43, $30, $57 ; さあ⎵いきましょ
#_08D703: db $27 ; う
#_08D704: db $FC ; wait for key and new line
#_08D705: db $D0, $0A ; set progress bit 0A
#_08D707: db $FF ; end of message

;===================================================================================================

; [MOMO]さんは いま きずのてあてを
; しているところだ
; きみたちも てあてを してきたほうが いい
Message_00_0A_1B:
#_08D708: db $FA ; clear message box
#_08D709: db $ED ; write female protag name
#_08D70A: db $2F, $52, $3E, $CF, $26, $43, $CF, $2B ; さんは⎵いま⎵き
#_08D712: db $A3, $3D, $37, $25, $37, $51 ; ずのてあてを
#_08D718: db $F9 ; new line
#_08D719: db $30, $37, $26, $4D, $38, $2E, $4F, $A6 ; しているところだ
#_08D721: db $F9 ; new line
#_08D722: db $2B, $44, $34, $35, $47, $CF, $37, $25 ; きみたちも⎵てあ
#_08D72A: db $37, $51, $CF, $30, $37, $2B, $34, $42 ; てを⎵してきたほ
#_08D732: db $27, $9C, $CF, $26, $26 ; うが⎵いい
#_08D737: db $FC ; wait for key and new line
#_08D738: db $FF ; end of message

;===================================================================================================

; おとこ:
; «アメリカ»ぐんは いざとなったら
; どんな しゅだんを つかうか わからんぞ
Message_00_0A_1C:
#_08D739: db $D2, $2F, $4D ; test progress bit 2F for message 4D
#_08D73C: db $D6, $01, $56, $48, $38 ; place sprite 56 in slot 01 at XY:{48,38}
#_08D741: db $D6, $02, $56, $98, $38 ; place sprite 56 in slot 02 at XY:{98,38}
#_08D746: db $D6, $00, $69, $70, $28 ; place sprite 69 in slot 00 at XY:{70,28}
#_08D74B: db $29, $38, $2E, $9A ; おとこ:
#_08D74F: db $F9 ; new line
#_08D750: db $F2, $1B ; prewritten text 1B
#_08D752: db $9E, $52, $3E, $CF, $26, $A1, $38, $39 ; ぐんは⎵いざとな
#_08D75A: db $58, $34, $4B ; ったら
#_08D75D: db $F9 ; new line
#_08D75E: db $AA, $52, $39, $CF, $30, $56, $A6, $52 ; どんな⎵しゅだん
#_08D766: db $51, $CF, $36, $2A, $27, $2A, $CF, $50 ; を⎵つかうか⎵わ
#_08D76E: db $2A, $4B, $52, $A5 ; からんぞ
#_08D772: db $FC ; wait for key and new line
#_08D773: db $FF ; end of message

;===================================================================================================

; おんな:
; なんで わたしたちが ゴトウなんて おとこの
; いいなりに ならなきゃいけないのよ
Message_00_0A_1D:
#_08D774: db $D2, $2F, $4E ; test progress bit 2F for message 4E
#_08D777: db $D6, $01, $56, $48, $38 ; place sprite 56 in slot 01 at XY:{48,38}
#_08D77C: db $D6, $02, $56, $98, $38 ; place sprite 56 in slot 02 at XY:{98,38}
#_08D781: db $D6, $00, $47, $78, $28 ; place sprite 47 in slot 00 at XY:{78,28}
#_08D786: db $29, $52, $39, $9A ; おんな:
#_08D78A: db $F9 ; new line
#_08D78B: db $39, $52, $A9, $CF, $50, $34, $30, $34 ; なんで⎵わたした
#_08D793: db $35, $9C, $CF, $B9, $70, $5F, $39, $52 ; ちが⎵ゴトウなん
#_08D79B: db $37, $CF, $29, $38, $2E, $3D ; て⎵おとこの
#_08D7A1: db $F9 ; new line
#_08D7A2: db $26, $26, $39, $4C, $3A, $CF, $39, $4B ; いいなりに⎵なら
#_08D7AA: db $39, $2B, $55, $26, $2D, $39, $26, $3D ; なきゃいけないの
#_08D7B2: db $4A ; よ
#_08D7B3: db $FC ; wait for key and new line
#_08D7B4: db $FF ; end of message

;===================================================================================================

; おんな:
; «アメリカ»へいが おおぜい あつまってる
; BARが あるわよ
; なにしに きてるんだか
Message_00_0A_1E:
#_08D7B5: db $D2, $2F, $50 ; test progress bit 2F for message 50
#_08D7B8: db $D6, $01, $56, $48, $38 ; place sprite 56 in slot 01 at XY:{48,38}
#_08D7BD: db $D6, $02, $56, $98, $38 ; place sprite 56 in slot 02 at XY:{98,38}
#_08D7C2: db $D6, $00, $44, $78, $28 ; place sprite 44 in slot 00 at XY:{78,28}
#_08D7C7: db $29, $52, $39, $9A ; おんな:
#_08D7CB: db $F9 ; new line
#_08D7CC: db $F2, $1B ; prewritten text 1B
#_08D7CE: db $41, $26, $9C, $CF, $29, $29, $A4, $26 ; へいが⎵おおぜい
#_08D7D6: db $CF, $25, $36, $43, $58, $37, $4D ; ⎵あつまってる
#_08D7DD: db $F9 ; new line
#_08D7DE: db $0C, $0B, $1C, $9C, $CF, $25, $4D, $50 ; BARが⎵あるわ
#_08D7E6: db $4A ; よ
#_08D7E7: db $F9 ; new line
#_08D7E8: db $39, $3A, $30, $3A, $CF, $2B, $37, $4D ; なにしに⎵きてる
#_08D7F0: db $52, $A6, $2A ; んだか
#_08D7F3: db $FC ; wait for key and new line
#_08D7F4: db $FF ; end of message

;===================================================================================================

; J.B.:
; ゴトウの てした オザワが
; «レジスタンス»の«リーダー» [MOMO]を
; さがしてるらしいよ
; でも かおが わかんないんで
; おなじなまえの おんなを
; てあたりしだい さらってるらしいよ
Message_00_0A_1F:
#_08D7F5: db $D2, $2F, $3C ; test progress bit 2F for message 3C
#_08D7F8: db $D6, $01, $56, $48, $38 ; place sprite 56 in slot 01 at XY:{48,38}
#_08D7FD: db $D6, $02, $56, $98, $38 ; place sprite 56 in slot 02 at XY:{98,38}
#_08D802: db $D6, $00, $36, $70, $28 ; place sprite 36 in slot 00 at XY:{70,28}
#_08D807: db $14, $9B, $0C, $9B, $9A ; J.B.:
#_08D80C: db $F9 ; new line
#_08D80D: db $B9, $70, $5F, $3D, $CF, $37, $30, $34 ; ゴトウの⎵てした
#_08D815: db $CF, $61, $BA, $88, $9C ; ⎵オザワが
#_08D81A: db $F9 ; new line
#_08D81B: db $F2, $15 ; prewritten text 15
#_08D81D: db $3D ; の
#_08D81E: db $F2, $16 ; prewritten text 16
#_08D820: db $CF ; ⎵
#_08D821: db $ED ; write female protag name
#_08D822: db $51 ; を
#_08D823: db $F9 ; new line
#_08D824: db $2F, $9C, $30, $37, $4D, $4B, $30, $26 ; さがしてるらしい
#_08D82C: db $4A ; よ
#_08D82D: db $FC ; wait for key and new line
#_08D82E: db $FA ; clear message box
#_08D82F: db $A9, $47, $CF, $2A, $29, $9C, $CF, $50 ; でも⎵かおが⎵わ
#_08D837: db $2A, $52, $39, $26, $52, $A9 ; かんないんで
#_08D83D: db $F9 ; new line
#_08D83E: db $29, $39, $A2, $39, $43, $28, $3D, $CF ; おなじなまえの⎵
#_08D846: db $29, $52, $39, $51 ; おんなを
#_08D84A: db $F9 ; new line
#_08D84B: db $37, $25, $34, $4C, $30, $A6, $26, $CF ; てあたりしだい⎵
#_08D853: db $2F, $4B, $58, $37, $4D, $4B, $30, $26 ; さらってるらしい
#_08D85B: db $4A ; よ
#_08D85C: db $FC ; wait for key and new line
#_08D85D: db $FF ; end of message

;===================================================================================================

; «アメリカ»へい:
; «クーデター»ガ セイコウシテ アクマガ
; «トウキョウ»ジュウヲ シハイスルヨウナラ
; トールマンタイシハ «トウキョウ»ニ
; ミサイルヲ オトスト イッテマス
; ワタシ ニゲテキマシタ
Message_00_0A_20:
#_08D85E: db $D2, $2F, $52 ; test progress bit 2F for message 52
#_08D861: db $D6, $00, $5E, $70, $28 ; place sprite 5E in slot 00 at XY:{70,28}
#_08D866: db $F2, $1B ; prewritten text 1B
#_08D868: db $41, $26, $9A ; へい:
#_08D86B: db $F9 ; new line
#_08D86C: db $F2, $17 ; prewritten text 17
#_08D86E: db $B5, $CF, $6A, $5E, $66, $5F, $68, $6F ; ガ⎵セイコウシテ
#_08D876: db $CF, $5D, $64, $7B, $B5 ; ⎵アクマガ
#_08D87B: db $F9 ; new line
#_08D87C: db $F2, $1C ; prewritten text 1C
#_08D87E: db $BB, $90, $5F, $89, $CF, $68, $76, $5E ; ジュウヲ⎵シハイ
#_08D886: db $69, $85, $82, $5F, $71, $83 ; スルヨウナラ
#_08D88C: db $F9 ; new line
#_08D88D: db $70, $5A, $85, $7B, $8A, $6C, $5E, $68 ; トールマンタイシ
#_08D895: db $76, $CF ; ハ⎵
#_08D897: db $F2, $1C ; prewritten text 1C
#_08D899: db $72 ; ニ
#_08D89A: db $F9 ; new line
#_08D89B: db $7C, $67, $5E, $85, $89, $CF, $61, $70 ; ミサイルヲ⎵オト
#_08D8A3: db $69, $70, $CF, $5E, $92, $6F, $7B, $69 ; スト⎵イッテマス
#_08D8AB: db $FC ; wait for key and new line
#_08D8AC: db $FA ; clear message box
#_08D8AD: db $88, $6C, $68, $CF, $72, $B8, $6F, $63 ; ワタシ⎵ニゲテキ
#_08D8B5: db $7B, $68, $6C ; マシタ
#_08D8B8: db $FC ; wait for key and new line
#_08D8B9: db $FF ; end of message

;===================================================================================================

; ホステス:
; «いらっしゃいませ»
Message_00_0A_21:
#_08D8BA: db $D2, $2F, $57 ; test progress bit 2F for message 57
#_08D8BD: db $D7, $16 ; load scene 16
#_08D8BF: db $D6, $00, $42, $68, $28 ; place sprite 42 in slot 00 at XY:{68,28}
#_08D8C4: db $7A, $69, $6F, $69, $9A ; ホステス:
#_08D8C9: db $F9 ; new line
#_08D8CA: db $F2, $32 ; prewritten text 32
#_08D8CC: db $FC ; wait for key and new line
#_08D8CD: db $D0, $0C ; set progress bit 0C
#_08D8CF: db $FF ; end of message

;===================================================================================================

; ホステス:
; «ありがとうございました»
Message_00_0A_22:
#_08D8D0: db $D2, $2F, $58 ; test progress bit 2F for message 58
#_08D8D3: db $D7, $16 ; load scene 16
#_08D8D5: db $D6, $00, $42, $68, $28 ; place sprite 42 in slot 00 at XY:{68,28}
#_08D8DA: db $7A, $69, $6F, $69, $9A ; ホステス:
#_08D8DF: db $F9 ; new line
#_08D8E0: db $F2, $31 ; prewritten text 31
#_08D8E2: db $FC ; wait for key and new line
#_08D8E3: db $D1, $0C ; clear progress bit 0C
#_08D8E5: db $FF ; end of message

;===================================================================================================

; ホステス:
; «いらっしゃいませ»
Message_00_0A_23:
#_08D8E6: db $D2, $2F, $59 ; test progress bit 2F for message 59
#_08D8E9: db $D7, $16 ; load scene 16
#_08D8EB: db $D6, $00, $42, $68, $28 ; place sprite 42 in slot 00 at XY:{68,28}
#_08D8F0: db $7A, $69, $6F, $69, $9A ; ホステス:
#_08D8F5: db $F9 ; new line
#_08D8F6: db $F2, $32 ; prewritten text 32
#_08D8F8: db $FC ; wait for key and new line
#_08D8F9: db $D0, $0C ; set progress bit 0C
#_08D8FB: db $FF ; end of message

;===================================================================================================

; ホステス:
; «ありがとうございました»
Message_00_0A_24:
#_08D8FC: db $D2, $2F, $5A ; test progress bit 2F for message 5A
#_08D8FF: db $D7, $16 ; load scene 16
#_08D901: db $D6, $00, $42, $68, $28 ; place sprite 42 in slot 00 at XY:{68,28}
#_08D906: db $7A, $69, $6F, $69, $9A ; ホステス:
#_08D90B: db $F9 ; new line
#_08D90C: db $F2, $31 ; prewritten text 31
#_08D90E: db $FC ; wait for key and new line
#_08D90F: db $D1, $0C ; clear progress bit 0C
#_08D911: db $FF ; end of message

;===================================================================================================

; くろふく:
Message_00_0A_25:
#_08D912: db $D2, $2F, $5B ; test progress bit 2F for message 5B
#_08D915: db $D7, $15 ; load scene 15
#_08D917: db $D6, $00, $64, $70, $28 ; place sprite 64 in slot 00 at XY:{70,28}
#_08D91C: db $2C, $4F, $40, $2C, $9A ; くろふく:
#_08D921: db $F9 ; new line
#_08D922: db $FE, $13, $27 ; ext command 13: goto message 27 if there's a dying demon

;===================================================================================================

; «いらっしゃいませ»
Message_00_0A_26:
#_08D925: db $F2, $32 ; prewritten text 32
#_08D927: db $FC ; wait for key and new line
#_08D928: db $D0, $0C ; set progress bit 0C
#_08D92A: db $FF ; end of message

;===================================================================================================

Message_00_0A_27:
#_08D92B: db $FE, $13, $28 ; ext command 13: goto message 28 if there's a dying demon
#_08D92E: db $D3, $26 ; go to message 26

;===================================================================================================

; ただいま こみあっていますので
; ごにゅうてんを おことわりしています
; «・・・»2・3めいさまなら なんとか«・・・»
Message_00_0A_28:
#_08D930: db $34, $A6, $26, $43, $CF, $2E, $44, $25 ; ただいま⎵こみあ
#_08D938: db $58, $37, $26, $43, $31, $3D, $A9 ; っていますので
#_08D93F: db $F9 ; new line
#_08D940: db $A0, $3A, $56, $27, $37, $52, $51, $CF ; ごにゅうてんを⎵
#_08D948: db $29, $2E, $38, $50, $4C, $30, $37, $26 ; おことわりしてい
#_08D950: db $43, $31 ; ます
#_08D952: db $FC ; wait for key and new line
#_08D953: db $FA ; clear message box
#_08D954: db $F2, $0B ; prewritten text 0B
#_08D956: db $03, $93, $04, $46, $26, $2F, $43, $39 ; 2・3めいさまな
#_08D95E: db $4B, $CF, $39, $52, $38, $2A ; ら⎵なんとか
#_08D964: db $F2, $0B ; prewritten text 0B
#_08D966: db $FC ; wait for key and new line
#_08D967: db $FE, $1A, $3E, $8E, $08, $00, $04, $07 ; ext command 1A: 3E,8E,08,00,04,07
#_08D96F: db $FF ; end of message

;===================================================================================================

; くろふく:
; «ありがとうございました»
; またのごらいてんを おまちしております
Message_00_0A_29:
#_08D970: db $D2, $2F, $5D ; test progress bit 2F for message 5D
#_08D973: db $D7, $15 ; load scene 15
#_08D975: db $D6, $00, $64, $70, $28 ; place sprite 64 in slot 00 at XY:{70,28}
#_08D97A: db $2C, $4F, $40, $2C, $9A ; くろふく:
#_08D97F: db $F9 ; new line
#_08D980: db $F2, $31 ; prewritten text 31
#_08D982: db $F9 ; new line
#_08D983: db $43, $34, $3D, $A0, $4B, $26, $37, $52 ; またのごらいてん
#_08D98B: db $51, $CF, $29, $43, $35, $30, $37, $29 ; を⎵おまちしてお
#_08D993: db $4C, $43, $31 ; ります
#_08D996: db $FC ; wait for key and new line
#_08D997: db $D1, $0C ; clear progress bit 0C
#_08D999: db $FF ; end of message

;===================================================================================================

; «メシアきょう»と:
; よあけが ちかづいてきました
; しれんのときは おわろうとしています
; わたしたちの せいち
; ちじょうにおりたつ かみのぎょくざ
; «カテドラル»が できあがるのです
; «カテドラル»が できあがれば
; かみの おさめる «せんねんおうこく»が
; げんじつのものに なるでしょう
Message_00_0A_2A:
#_08D99A: db $F2, $33 ; prewritten text 33
#_08D99C: db $38, $9A ; と:
#_08D99E: db $F9 ; new line
#_08D99F: db $4A, $25, $2D, $9C, $CF, $35, $2A, $A8 ; よあけが⎵ちかづ
#_08D9A7: db $26, $37, $2B, $43, $30, $34 ; いてきました
#_08D9AD: db $F9 ; new line
#_08D9AE: db $30, $4E, $52, $3D, $38, $2B, $3E, $CF ; しれんのときは⎵
#_08D9B6: db $29, $50, $4F, $27, $38, $30, $37, $26 ; おわろうとしてい
#_08D9BE: db $43, $31 ; ます
#_08D9C0: db $FC ; wait for key and new line
#_08D9C1: db $FA ; clear message box
#_08D9C2: db $50, $34, $30, $34, $35, $3D, $CF, $32 ; わたしたちの⎵せ
#_08D9CA: db $26, $35 ; いち
#_08D9CC: db $F9 ; new line
#_08D9CD: db $35, $A2, $57, $27, $3A, $29, $4C, $34 ; ちじょうにおりた
#_08D9D5: db $36, $CF, $2A, $44, $3D, $9D, $57, $2C ; つ⎵かみのぎょく
#_08D9DD: db $A1 ; ざ
#_08D9DE: db $F9 ; new line
#_08D9DF: db $F2, $5C ; prewritten text 5C
#_08D9E1: db $9C, $CF, $A9, $2B, $25, $9C, $4D, $3D ; が⎵できあがるの
#_08D9E9: db $A9, $31 ; です
#_08D9EB: db $FC ; wait for key and new line
#_08D9EC: db $FA ; clear message box
#_08D9ED: db $F2, $5C ; prewritten text 5C
#_08D9EF: db $9C, $CF, $A9, $2B, $25, $9C, $4E, $AB ; が⎵できあがれば
#_08D9F7: db $F9 ; new line
#_08D9F8: db $2A, $44, $3D, $CF, $29, $2F, $46, $4D ; かみの⎵おさめる
#_08DA00: db $CF ; ⎵
#_08DA01: db $F2, $21 ; prewritten text 21
#_08DA03: db $9C ; が
#_08DA04: db $F9 ; new line
#_08DA05: db $9F, $52, $A2, $36, $3D, $47, $3D, $3A ; げんじつのものに
#_08DA0D: db $CF, $39, $4D, $A9, $30, $57, $27 ; ⎵なるでしょう
#_08DA14: db $FC ; wait for key and new line
#_08DA15: db $FF ; end of message

;===================================================================================================

; «ガイアきょう»と:
; いまや きょうふと ぼうりょくが
; しはいする せかいとなった!
; ちからこそ すべてなのだ!
; だが かみには そんなちからなど ない!
; そのちからを もつのは
; ゆいいつ «ルシファーさま»のみ!
Message_00_0A_2B:
#_08DA16: db $F2, $34 ; prewritten text 34
#_08DA18: db $38, $9A ; と:
#_08DA1A: db $F9 ; new line
#_08DA1B: db $26, $43, $48, $CF, $2B, $57, $27, $40 ; いまや⎵きょうふ
#_08DA23: db $38, $CF, $AF, $27, $4C, $57, $2C, $9C ; と⎵ぼうりょくが
#_08DA2B: db $F9 ; new line
#_08DA2C: db $30, $3E, $26, $31, $4D, $CF, $32, $2A ; しはいする⎵せか
#_08DA34: db $26, $38, $39, $58, $34, $94 ; いとなった!
#_08DA3A: db $FC ; wait for key and new line
#_08DA3B: db $FA ; clear message box
#_08DA3C: db $35, $2A, $4B, $2E, $33, $CF, $31, $AE ; ちからこそ⎵すべ
#_08DA44: db $37, $39, $3D, $A6, $94 ; てなのだ!
#_08DA49: db $F9 ; new line
#_08DA4A: db $A6, $9C, $CF, $2A, $44, $3A, $3E, $CF ; だが⎵かみには⎵
#_08DA52: db $33, $52, $39, $35, $2A, $4B, $39, $AA ; そんなちからなど
#_08DA5A: db $CF, $39, $26, $94 ; ⎵ない!
#_08DA5E: db $FC ; wait for key and new line
#_08DA5F: db $FA ; clear message box
#_08DA60: db $33, $3D, $35, $2A, $4B, $51, $CF, $47 ; そのちからを⎵も
#_08DA68: db $36, $3D, $3E ; つのは
#_08DA6B: db $F9 ; new line
#_08DA6C: db $49, $26, $26, $36, $CF ; ゆいいつ⎵
#_08DA71: db $F2, $23 ; prewritten text 23
#_08DA73: db $3D, $44, $94 ; のみ!
#_08DA76: db $FC ; wait for key and new line
#_08DA77: db $FF ; end of message

;===================================================================================================

; おとこ:
; うわさによると «ロッポンギ»は
; むかしどおりに にぎやからしい
Message_00_0A_2C:
#_08DA78: db $D6, $00, $87, $70, $28 ; place sprite 87 in slot 00 at XY:{70,28}
#_08DA7D: db $29, $38, $2E, $9A ; おとこ:
#_08DA81: db $F9 ; new line
#_08DA82: db $27, $50, $2F, $3A, $4A, $4D, $38, $CF ; うわさによると⎵
#_08DA8A: db $F2, $4C ; prewritten text 4C
#_08DA8C: db $3E ; は
#_08DA8D: db $F9 ; new line
#_08DA8E: db $45, $2A, $30, $AA, $29, $4C, $3A, $CF ; むかしどおりに⎵
#_08DA96: db $3A, $9D, $48, $2A, $4B, $30, $26 ; にぎやからしい
#_08DA9D: db $FC ; wait for key and new line
#_08DA9E: db $FF ; end of message

;===================================================================================================

; おんな:
; オザワは アクマと けいやくを むすんでいるの
; だから «シンジュク»には
; アクマが はいってこないのよ
Message_00_0A_2D:
#_08DA9F: db $D6, $00, $88, $70, $28 ; place sprite 88 in slot 00 at XY:{70,28}
#_08DAA4: db $29, $52, $39, $9A ; おんな:
#_08DAA8: db $F9 ; new line
#_08DAA9: db $D2, $47, $2E ; test progress bit 47 for message 2E
#_08DAAC: db $61, $BA, $88, $3E, $CF, $5D, $64, $7B ; オザワは⎵アクマ
#_08DAB4: db $38, $CF, $2D, $26, $48, $2C, $51, $CF ; と⎵けいやくを⎵
#_08DABC: db $45, $31, $52, $A9, $26, $4D, $3D ; むすんでいるの
#_08DAC3: db $F9 ; new line
#_08DAC4: db $A6, $2A, $4B, $CF ; だから⎵
#_08DAC8: db $F2, $18 ; prewritten text 18
#_08DACA: db $3A, $3E ; には
#_08DACC: db $F9 ; new line
#_08DACD: db $5D, $64, $7B, $9C, $CF, $3E, $26, $58 ; アクマが⎵はいっ
#_08DAD5: db $37, $2E, $39, $26, $3D, $4A ; てこないのよ
#_08DADB: db $FC ; wait for key and new line
#_08DADC: db $FF ; end of message

;===================================================================================================

; オザワが しんだから «シンジュク»にも
; アクマが くるのね
Message_00_0A_2E:
#_08DADD: db $61, $BA, $88, $9C, $CF, $30, $52, $A6 ; オザワが⎵しんだ
#_08DAE5: db $2A, $4B, $CF ; から⎵
#_08DAE8: db $F2, $18 ; prewritten text 18
#_08DAEA: db $3A, $47 ; にも
#_08DAEC: db $F9 ; new line
#_08DAED: db $5D, $64, $7B, $9C, $CF, $2C, $4D, $3D ; アクマが⎵くるの
#_08DAF5: db $3C ; ね
#_08DAF6: db $FC ; wait for key and new line
#_08DAF7: db $FF ; end of message

;===================================================================================================

; おとこ:
; たしかに オザワのいいなりに なっていれば
; あくまに おそわれることはない
; だが それでいいのか
Message_00_0A_2F:
#_08DAF8: db $D6, $00, $89, $70, $28 ; place sprite 89 in slot 00 at XY:{70,28}
#_08DAFD: db $29, $38, $2E, $9A ; おとこ:
#_08DB01: db $F9 ; new line
#_08DB02: db $D2, $47, $30 ; test progress bit 47 for message 30
#_08DB05: db $34, $30, $2A, $3A, $CF, $61, $BA, $88 ; たしかに⎵オザワ
#_08DB0D: db $3D, $26, $26, $39, $4C, $3A, $CF, $39 ; のいいなりに⎵な
#_08DB15: db $58, $37, $26, $4E, $AB ; っていれば
#_08DB1A: db $F9 ; new line
#_08DB1B: db $25, $2C, $43, $3A, $CF, $29, $33, $50 ; あくまに⎵おそわ
#_08DB23: db $4E, $4D, $2E, $38, $3E, $39, $26 ; れることはない
#_08DB2A: db $FC ; wait for key and new line
#_08DB2B: db $FA ; clear message box
#_08DB2C: db $A6, $9C, $CF, $33, $4E, $A9, $26, $26 ; だが⎵それでいい
#_08DB34: db $3D, $2A ; のか
#_08DB36: db $FC ; wait for key and new line
#_08DB37: db $FF ; end of message

;===================================================================================================

; オザワが いなくなったら
; だれが «シンジュク»を
; アクマのてから まもるんだ?
Message_00_0A_30:
#_08DB38: db $61, $BA, $88, $9C, $CF, $26, $39, $2C ; オザワが⎵いなく
#_08DB40: db $39, $58, $34, $4B ; なったら
#_08DB44: db $F9 ; new line
#_08DB45: db $A6, $4E, $9C, $CF ; だれが⎵
#_08DB49: db $F2, $18 ; prewritten text 18
#_08DB4B: db $51 ; を
#_08DB4C: db $F9 ; new line
#_08DB4D: db $5D, $64, $7B, $3D, $37, $2A, $4B, $CF ; アクマのてから⎵
#_08DB55: db $43, $47, $4D, $52, $A6, $95 ; まもるんだ?
#_08DB5B: db $FC ; wait for key and new line
#_08DB5C: db $FF ; end of message

;===================================================================================================

; «メシアきょう»と:
; ああ シブヤの メシアさまの もとへ
; はやく いきたいのですが «・・・»
; «しせつけいさつ»が
; おそろしいので«・・・»
Message_00_0A_31:
#_08DB5D: db $D6, $00, $49, $78, $28 ; place sprite 49 in slot 00 at XY:{78,28}
#_08DB62: db $F2, $33 ; prewritten text 33
#_08DB64: db $38, $9A ; と:
#_08DB66: db $F9 ; new line
#_08DB67: db $D2, $47, $32 ; test progress bit 47 for message 32
#_08DB6A: db $25, $25, $CF, $68, $C6, $80, $3D, $CF ; ああ⎵シブヤの⎵
#_08DB72: db $7E, $68, $5D, $2F, $43, $3D, $CF, $47 ; メシアさまの⎵も
#_08DB7A: db $38, $41 ; とへ
#_08DB7C: db $F9 ; new line
#_08DB7D: db $3E, $48, $2C, $CF, $26, $2B, $34, $26 ; はやく⎵いきたい
#_08DB85: db $3D, $A9, $31, $9C, $CF ; のですが⎵
#_08DB8A: db $F2, $0B ; prewritten text 0B
#_08DB8C: db $FC ; wait for key and new line
#_08DB8D: db $FA ; clear message box
#_08DB8E: db $F2, $42 ; prewritten text 42
#_08DB90: db $9C ; が
#_08DB91: db $F9 ; new line
#_08DB92: db $29, $33, $4F, $30, $26, $3D, $A9 ; おそろしいので
#_08DB99: db $F2, $0B ; prewritten text 0B
#_08DB9B: db $FC ; wait for key and new line
#_08DB9C: db $FF ; end of message

;===================================================================================================

; これで シブヤに いけるかしら«・・・»
Message_00_0A_32:
#_08DB9D: db $2E, $4E, $A9, $CF, $68, $C6, $80, $3A ; これで⎵シブヤに
#_08DBA5: db $CF, $26, $2D, $4D, $2A, $30, $4B ; ⎵いけるかしら
#_08DBAC: db $F2, $0B ; prewritten text 0B
#_08DBAE: db $FC ; wait for key and new line
#_08DBAF: db $FF ; end of message

;===================================================================================================

; おとこ:
; うわさの «ロッポンギ»は よっぽど
; すみやすいらしいな
; «シンジュク»を ぬけだして いったやつあ
; だれも かえっちゃこねえ
Message_00_0A_33:
#_08DBB0: db $D6, $00, $B0, $70, $38 ; place sprite B0 in slot 00 at XY:{70,38}
#_08DBB5: db $29, $38, $2E, $9A ; おとこ:
#_08DBB9: db $F9 ; new line
#_08DBBA: db $27, $50, $2F, $3D, $CF ; うわさの⎵
#_08DBBF: db $F2, $4C ; prewritten text 4C
#_08DBC1: db $3E, $CF, $4A, $58, $B4, $AA ; は⎵よっぽど
#_08DBC7: db $F9 ; new line
#_08DBC8: db $31, $44, $48, $31, $26, $4B, $30, $26 ; すみやすいらしい
#_08DBD0: db $39 ; な
#_08DBD1: db $FC ; wait for key and new line
#_08DBD2: db $FA ; clear message box
#_08DBD3: db $F2, $18 ; prewritten text 18
#_08DBD5: db $51, $CF, $3B, $2D, $A6, $30, $37, $CF ; を⎵ぬけだして⎵
#_08DBDD: db $26, $58, $34, $48, $36, $25 ; いったやつあ
#_08DBE3: db $F9 ; new line
#_08DBE4: db $A6, $4E, $47, $CF, $2A, $28, $58, $35 ; だれも⎵かえっち
#_08DBEC: db $55, $2E, $3C, $28 ; ゃこねえ
#_08DBF0: db $FC ; wait for key and new line
#_08DBF1: db $FF ; end of message

;===================================================================================================

; こども:
; せっかく おいらが かせいだ ℏを
; ぜいきんだって ねこそぎ もってきやがって
; オザワの バカヤロー!
; «・・・»おっと «しせつけいさつ»は
; いねえよな?
; いまのが きかれたら つかまって
; せんのう されちまう
Message_00_0A_34:
#_08DBF2: db $D6, $00, $B2, $70, $38 ; place sprite B2 in slot 00 at XY:{70,38}
#_08DBF7: db $2E, $AA, $47, $9A ; こども:
#_08DBFB: db $F9 ; new line
#_08DBFC: db $D2, $47, $35 ; test progress bit 47 for message 35
#_08DBFF: db $32, $58, $2A, $2C, $CF, $29, $26, $4B ; せっかく⎵おいら
#_08DC07: db $9C, $CF, $2A, $32, $26, $A6, $CF, $5C ; が⎵かせいだ⎵ℏ
#_08DC0F: db $51 ; を
#_08DC10: db $F9 ; new line
#_08DC11: db $A4, $26, $2B, $52, $A6, $58, $37, $CF ; ぜいきんだって⎵
#_08DC19: db $3C, $2E, $33, $9D, $CF, $47, $58, $37 ; ねこそぎ⎵もって
#_08DC21: db $2B, $48, $9C, $58, $37 ; きやがって
#_08DC26: db $FC ; wait for key and new line
#_08DC27: db $FA ; clear message box
#_08DC28: db $61, $BA, $88, $3D, $CF, $C4, $62, $80 ; オザワの⎵バカヤ
#_08DC30: db $87, $5A, $94 ; ロー!
#_08DC33: db $DF, $DF ; delay 7 frames [x2]
#_08DC35: db $F9 ; new line
#_08DC36: db $F2, $0B ; prewritten text 0B
#_08DC38: db $29, $58, $38, $CF ; おっと⎵
#_08DC3C: db $F2, $42 ; prewritten text 42
#_08DC3E: db $3E ; は
#_08DC3F: db $F9 ; new line
#_08DC40: db $26, $3C, $28, $4A, $39, $95 ; いねえよな?
#_08DC46: db $FC ; wait for key and new line
#_08DC47: db $FA ; clear message box
#_08DC48: db $26, $43, $3D, $9C, $CF, $2B, $2A, $4E ; いまのが⎵きかれ
#_08DC50: db $34, $4B, $CF, $36, $2A, $43, $58, $37 ; たら⎵つかまって
#_08DC58: db $F9 ; new line
#_08DC59: db $32, $52, $3D, $27, $CF, $2F, $4E, $35 ; せんのう⎵されち
#_08DC61: db $43, $27 ; まう
#_08DC63: db $FC ; wait for key and new line
#_08DC64: db $FF ; end of message

;===================================================================================================

; そうか もう オザワに
; ビビらなくって いいんだ
Message_00_0A_35:
#_08DC65: db $33, $27, $2A, $CF, $47, $27, $CF, $61 ; そうか⎵もう⎵オ
#_08DC6D: db $BA, $88, $3A ; ザワに
#_08DC70: db $F9 ; new line
#_08DC71: db $C5, $C5, $4B, $39, $2C, $58, $37, $CF ; ビビらなくって⎵
#_08DC79: db $26, $26, $52, $A6 ; いいんだ
#_08DC7D: db $FC ; wait for key and new line
#_08DC7E: db $FF ; end of message

;===================================================================================================

; おんな:
; わたしの ともだちは なんにんも つれてかれたわ
; «しせつけいさつ»の れんちゅうに«・・・»
; ちかで せんのうされてるって うわさよ
Message_00_0A_36:
#_08DC7F: db $D6, $00, $88, $70, $28 ; place sprite 88 in slot 00 at XY:{70,28}
#_08DC84: db $29, $52, $39, $9A ; おんな:
#_08DC88: db $F9 ; new line
#_08DC89: db $D2, $47, $37 ; test progress bit 47 for message 37
#_08DC8C: db $50, $34, $30, $3D, $CF, $38, $47, $A6 ; わたしの⎵ともだ
#_08DC94: db $35, $3E, $CF, $39, $52, $3A, $52, $47 ; ちは⎵なんにんも
#_08DC9C: db $CF, $36, $4E, $37, $2A, $4E, $34, $50 ; ⎵つれてかれたわ
#_08DCA4: db $F9 ; new line
#_08DCA5: db $F2, $42 ; prewritten text 42
#_08DCA7: db $3D, $CF, $4E, $52, $35, $56, $27, $3A ; の⎵れんちゅうに
#_08DCAF: db $F2, $0B ; prewritten text 0B
#_08DCB1: db $F9 ; new line
#_08DCB2: db $35, $2A, $A9, $CF, $32, $52, $3D, $27 ; ちかで⎵せんのう
#_08DCBA: db $2F, $4E, $37, $4D, $58, $37, $CF, $27 ; されてるって⎵う
#_08DCC2: db $50, $2F, $4A ; わさよ
#_08DCC5: db $FC ; wait for key and new line
#_08DCC6: db $FF ; end of message

;===================================================================================================

; «しせつけいさつ»の やつらなんか
; みんな やっつけてやる!
; ともだちの かたきうちよ!
Message_00_0A_37:
#_08DCC7: db $F2, $42 ; prewritten text 42
#_08DCC9: db $3D, $CF, $48, $36, $4B, $39, $52, $2A ; の⎵やつらなんか
#_08DCD1: db $F9 ; new line
#_08DCD2: db $44, $52, $39, $CF, $48, $58, $36, $2D ; みんな⎵やっつけ
#_08DCDA: db $37, $48, $4D, $94 ; てやる!
#_08DCDE: db $FC ; wait for key and new line
#_08DCDF: db $FA ; clear message box
#_08DCE0: db $38, $47, $A6, $35, $3D, $CF, $2A, $34 ; ともだちの⎵かた
#_08DCE8: db $2B, $27, $35, $4A, $94 ; きうちよ!
#_08DCED: db $FC ; wait for key and new line
#_08DCEE: db $FF ; end of message

;===================================================================================================

; ろうじん:
; «ロッポンギ»や シブヤへ にげだした ものが
; ずいぶん いるらしい
; «しせつけいさつ»に みつかると
; そのばで うたれるのにな
Message_00_0A_38:
#_08DCEF: db $D6, $00, $89, $70, $28 ; place sprite 89 in slot 00 at XY:{70,28}
#_08DCF4: db $4F, $27, $A2, $52, $9A ; ろうじん:
#_08DCF9: db $F9 ; new line
#_08DCFA: db $F2, $4C ; prewritten text 4C
#_08DCFC: db $48, $CF, $68, $C6, $80, $41, $CF, $3A ; や⎵シブヤへ⎵に
#_08DD04: db $9F, $A6, $30 ; げだし
#_08DD07: db $D2, $47, $39 ; test progress bit 47 for message 39
#_08DD0A: db $34, $CF, $47, $3D, $9C ; た⎵ものが
#_08DD0F: db $F9 ; new line
#_08DD10: db $A3, $26, $AD, $52, $CF, $26, $4D, $4B ; ずいぶん⎵いるら
#_08DD18: db $30, $26 ; しい
#_08DD1A: db $FC ; wait for key and new line
#_08DD1B: db $FA ; clear message box
#_08DD1C: db $F2, $42 ; prewritten text 42
#_08DD1E: db $3A, $CF, $44, $36, $2A, $4D, $38 ; に⎵みつかると
#_08DD25: db $F9 ; new line
#_08DD26: db $33, $3D, $AB, $A9, $CF, $27, $34, $4E ; そのばで⎵うたれ
#_08DD2E: db $4D, $3D, $3A, $39 ; るのにな
#_08DD32: db $FC ; wait for key and new line
#_08DD33: db $FF ; end of message

;===================================================================================================

; ても
; アクマの えじきに なるのが オチじゃ
Message_00_0A_39:
#_08DD34: db $37, $47 ; ても
#_08DD36: db $F9 ; new line
#_08DD37: db $5D, $64, $7B, $3D, $CF, $28, $A2, $2B ; アクマの⎵えじき
#_08DD3F: db $3A, $CF, $39, $4D, $3D, $9C, $CF, $61 ; に⎵なるのが⎵オ
#_08DD47: db $6D, $A2, $55 ; チじゃ
#_08DD4A: db $FC ; wait for key and new line
#_08DD4B: db $FF ; end of message

;===================================================================================================

; おとこ:
; アクマの はびこる せかいで いきのこるには
; アクマと きょうぞんするしかない
; つまり «オザワさま»は ただしい!
Message_00_0A_3A:
#_08DD4C: db $D6, $00, $87, $70, $28 ; place sprite 87 in slot 00 at XY:{70,28}
#_08DD51: db $29, $38, $2E, $9A ; おとこ:
#_08DD55: db $F9 ; new line
#_08DD56: db $D2, $47, $3B ; test progress bit 47 for message 3B
#_08DD59: db $5D, $64, $7B, $3D, $CF, $3E, $AC, $2E ; アクマの⎵はびこ
#_08DD61: db $4D, $CF, $32, $2A, $26, $A9, $CF, $26 ; る⎵せかいで⎵い
#_08DD69: db $2B, $3D, $2E, $4D, $3A, $3E ; きのこるには
#_08DD6F: db $F9 ; new line
#_08DD70: db $5D, $64, $7B, $38, $CF, $2B, $57, $27 ; アクマと⎵きょう
#_08DD78: db $A5, $52, $31, $4D, $30, $2A, $39, $26 ; ぞんするしかない
#_08DD80: db $FC ; wait for key and new line
#_08DD81: db $FA ; clear message box
#_08DD82: db $36, $43, $4C, $CF ; つまり⎵
#_08DD86: db $F2, $65 ; prewritten text 65
#_08DD88: db $3E, $CF, $34, $A6, $30, $26, $94 ; は⎵ただしい!
#_08DD8F: db $FC ; wait for key and new line
#_08DD90: db $FF ; end of message

;===================================================================================================

; オザワは うまく やってたと おもうが«・・・»
Message_00_0A_3B:
#_08DD91: db $61, $BA, $88, $3E, $CF, $27, $43, $2C ; オザワは⎵うまく
#_08DD99: db $CF, $48, $58, $37, $34, $38, $CF, $29 ; ⎵やってたと⎵お
#_08DDA1: db $47, $27, $9C ; もうが
#_08DDA4: db $F2, $0B ; prewritten text 0B
#_08DDA6: db $FC ; wait for key and new line
#_08DDA7: db $FF ; end of message

;===================================================================================================

; しせつけいかん:
; けいさつだあ!
; あやしいやつ «オザワさま»に さからうやつは
; たいほするぜえ!
; にげだすやつは そのばで しけいだあ!
Message_00_0A_3C:
#_08DDA8: db $D2, $47, $3D ; test progress bit 47 for message 3D
#_08DDAB: db $D6, $00, $A6, $70, $28 ; place sprite A6 in slot 00 at XY:{70,28}
#_08DDB0: db $30, $32, $36, $2D, $26, $2A, $52, $9A ; しせつけいかん:
#_08DDB8: db $F9 ; new line
#_08DDB9: db $2D, $26, $2F, $36, $A6, $25, $94 ; けいさつだあ!
#_08DDC0: db $FC ; wait for key and new line
#_08DDC1: db $FA ; clear message box
#_08DDC2: db $25, $48, $30, $26, $48, $36, $CF ; あやしいやつ⎵
#_08DDC9: db $F2, $65 ; prewritten text 65
#_08DDCB: db $3A, $CF, $2F, $2A, $4B, $27, $48, $36 ; に⎵さからうやつ
#_08DDD3: db $3E ; は
#_08DDD4: db $F9 ; new line
#_08DDD5: db $34, $26, $42, $31, $4D, $A4, $28, $94 ; たいほするぜえ!
#_08DDDD: db $FC ; wait for key and new line
#_08DDDE: db $FA ; clear message box
#_08DDDF: db $3A, $9F, $A6, $31, $48, $36, $3E, $CF ; にげだすやつは⎵
#_08DDE7: db $33, $3D, $AB, $A9, $CF, $30, $2D, $26 ; そのばで⎵しけい
#_08DDEF: db $A6, $25, $94 ; だあ!
#_08DDF2: db $FC ; wait for key and new line
#_08DDF3: db $FF ; end of message

;===================================================================================================

; おとこ:
; おれは «しせつけいさつ»じゃないよ
; た ただの いっぱんピープルさ
Message_00_0A_3D:
#_08DDF4: db $D6, $00, $87, $70, $28 ; place sprite 87 in slot 00 at XY:{70,28}
#_08DDF9: db $29, $38, $2E, $9A ; おとこ:
#_08DDFD: db $F9 ; new line
#_08DDFE: db $29, $4E, $3E, $CF ; おれは⎵
#_08DE02: db $F2, $42 ; prewritten text 42
#_08DE04: db $A2, $55, $39, $26, $4A ; じゃないよ
#_08DE09: db $F9 ; new line
#_08DE0A: db $34, $CF, $34, $A6, $3D, $CF, $26, $58 ; た⎵ただの⎵いっ
#_08DE12: db $B0, $52, $CA, $5A, $CB, $85, $2F ; ぱんピープルさ
#_08DE19: db $FC ; wait for key and new line
#_08DE1A: db $FF ; end of message

;===================================================================================================

; ろうじん:
; なんか ようか?
; おお だいはかいまえに つかわれていた
; ¥ を もってるじゃないか
; わしに ゆずってくれ ただとは いわん
; なっ いいだろ?
; そうか«・・・»
Message_00_0A_3E:
#_08DE1B: db $E1, $FE ; set $0A50 to item FE
#_08DE1D: db $D6, $00, $89, $70, $28 ; place sprite 89 in slot 00 at XY:{70,28}
#_08DE22: db $4F, $27, $A2, $52, $9A ; ろうじん:
#_08DE27: db $F9 ; new line
#_08DE28: db $39, $52, $2A, $CF, $4A, $27, $2A, $95 ; なんか⎵ようか?
#_08DE30: db $FC ; wait for key and new line
#_08DE31: db $FA ; clear message box
#_08DE32: db $DD, $FE, $42 ; go to message 42 if missing item FE
#_08DE35: db $29, $29, $CF, $A6, $26, $3E, $2A, $26 ; おお⎵だいはかい
#_08DE3D: db $43, $28, $3A, $CF, $36, $2A, $50, $4E ; まえに⎵つかわれ
#_08DE45: db $37, $26, $34 ; ていた
#_08DE48: db $F9 ; new line
#_08DE49: db $5B, $CF, $51, $CF, $47, $58, $37, $4D ; ¥⎵を⎵もってる
#_08DE51: db $A2, $55, $39, $26, $2A ; じゃないか
#_08DE56: db $FC ; wait for key and new line
#_08DE57: db $FA ; clear message box
#_08DE58: db $50, $30, $3A, $CF, $49, $A3, $58, $37 ; わしに⎵ゆずって
#_08DE60: db $2C, $4E, $CF, $34, $A6, $38, $3E, $CF ; くれ⎵ただとは⎵
#_08DE68: db $26, $50, $52 ; いわん
#_08DE6B: db $F9 ; new line
#_08DE6C: db $39, $58, $CF, $26, $26, $A6, $4F, $95 ; なっ⎵いいだろ?
#_08DE74: db $F8, $3F ; YES/NO - go to message 3F if YES
#_08DE76: db $D4, $03 ; set text box size to 3
#_08DE78: db $33, $27, $2A ; そうか
#_08DE7B: db $F2, $0B ; prewritten text 0B
#_08DE7D: db $FC ; wait for key and new line
#_08DE7E: db $FF ; end of message

;===================================================================================================

; では ℏを やろう
Message_00_0A_3F:
#_08DE7F: db $D4, $03 ; set text box size to 3
#_08DE81: db $A9, $3E, $CF, $5C, $51, $CF, $48, $4F ; では⎵ℏを⎵やろ
#_08DE89: db $27 ; う
#_08DE8A: db $FC ; wait for key and new line

;===================================================================================================

Message_00_0A_40:
#_08DE8B: db $DD, $FE, $41 ; go to message 41 if missing item FE
#_08DE8E: db $FE, $29 ; ext command 29: take item from $0A51 TODO
#_08DE90: db $DA, $50, $00, $00 ; give 80 money
#_08DE94: db $D3, $40 ; go to message 40

;===================================================================================================

; >[LEADER]は おとこから
; ℏを すこし «てにいれた»
; おとこ:
; これで わしの コレクションが ふえたよ
; もう おまえには ようはない あっちいけ
Message_00_0A_41:
#_08DE96: db $FA ; clear message box
#_08DE97: db $97 ; >
#_08DE98: db $F1 ; write leader's name for team
#_08DE99: db $3E, $CF, $29, $38, $2E, $2A, $4B ; は⎵おとこから
#_08DEA0: db $F9 ; new line
#_08DEA1: db $5C, $51, $CF, $31, $2E, $30, $CF ; ℏを⎵すこし⎵
#_08DEA8: db $F2, $2D ; prewritten text 2D
#_08DEAA: db $FC ; wait for key and new line
#_08DEAB: db $FA ; clear message box
#_08DEAC: db $29, $38, $2E, $9A ; おとこ:
#_08DEB0: db $F9 ; new line
#_08DEB1: db $2E, $4E, $A9, $CF, $50, $30, $3D, $CF ; これで⎵わしの⎵
#_08DEB9: db $66, $86, $64, $68, $91, $8A, $9C, $CF ; コレクションが⎵
#_08DEC1: db $40, $28, $34, $4A ; ふえたよ
#_08DEC5: db $FC ; wait for key and new line
#_08DEC6: db $FA ; clear message box
#_08DEC7: db $47, $27, $CF, $29, $43, $28, $3A, $3E ; もう⎵おまえには
#_08DECF: db $CF, $4A, $27, $3E, $39, $26, $CF, $25 ; ⎵ようはない⎵あ
#_08DED7: db $58, $35, $26, $2D ; っちいけ
#_08DEDB: db $FC ; wait for key and new line

;===================================================================================================

; おまえには ようはない あっちいけ
Message_00_0A_42:
#_08DECA: db $29, $43, $28, $3A, $3E, $CF, $4A, $27 ; おまえには⎵よう
#_08DED2: db $3E, $39, $26, $CF, $25, $58, $35, $26 ; はない⎵あっちい
#_08DEDA: db $2D ; け
#_08DEDB: db $FC ; wait for key and new line
#_08DEDC: db $FF ; end of message

;===================================================================================================

; «しせつけいさつ»:
; «オザワさま»のもとで はたらいている われわれが
; «シンジュク»の へいわを まもっているのだ!
; きさまら ありがたくおもうのが とうぜんだろう
; サケをもってこい!
Message_00_0A_43:
#_08DEDD: db $D2, $47, $44 ; test progress bit 47 for message 44
#_08DEE0: db $D6, $00, $A6, $70, $28 ; place sprite A6 in slot 00 at XY:{70,28}
#_08DEE5: db $F2, $42 ; prewritten text 42
#_08DEE7: db $9A ; :
#_08DEE8: db $F9 ; new line
#_08DEE9: db $F2, $65 ; prewritten text 65
#_08DEEB: db $3D, $47, $38, $A9, $CF, $3E, $34, $4B ; のもとで⎵はたら
#_08DEF3: db $26, $37, $26, $4D, $CF, $50, $4E, $50 ; いている⎵われわ
#_08DEFB: db $4E, $9C ; れが
#_08DEFD: db $F9 ; new line
#_08DEFE: db $F2, $18 ; prewritten text 18
#_08DF00: db $3D, $CF, $41, $26, $50, $51, $CF, $43 ; の⎵へいわを⎵ま
#_08DF08: db $47, $58, $37, $26, $4D, $3D, $A6, $94 ; もっているのだ!
#_08DF10: db $FC ; wait for key and new line
#_08DF11: db $FA ; clear message box
#_08DF12: db $2B, $2F, $43, $4B, $CF, $25, $4C, $9C ; きさまら⎵ありが
#_08DF1A: db $34, $2C, $29, $47, $27, $3D, $9C, $CF ; たくおもうのが⎵
#_08DF22: db $38, $27, $A4, $52, $A6, $4F, $27 ; とうぜんだろう
#_08DF29: db $F9 ; new line
#_08DF2A: db $67, $65, $51, $47, $58, $37, $2E, $26 ; サケをもってこい
#_08DF32: db $94 ; !
#_08DF33: db $FC ; wait for key and new line
#_08DF34: db $FF ; end of message

;===================================================================================================

; おとこ:
; オザワが いなくなりゃ しせつけいかんは
; ここに でいりなんか できねえよ
; いままで ひでえこと
; やりたいほうだい だったからな
Message_00_0A_44:
#_08DF35: db $D6, $00, $87, $70, $28 ; place sprite 87 in slot 00 at XY:{70,28}
#_08DF3A: db $29, $38, $2E, $9A ; おとこ:
#_08DF3E: db $F9 ; new line
#_08DF3F: db $61, $BA, $88, $9C, $CF, $26, $39, $2C ; オザワが⎵いなく
#_08DF47: db $39, $4C, $55, $CF, $30, $32, $36, $2D ; なりゃ⎵しせつけ
#_08DF4F: db $26, $2A, $52, $3E ; いかんは
#_08DF53: db $F9 ; new line
#_08DF54: db $2E, $2E, $3A, $CF, $A9, $26, $4C, $39 ; ここに⎵でいりな
#_08DF5C: db $52, $2A, $CF, $A9, $2B, $3C, $28, $4A ; んか⎵できねえよ
#_08DF64: db $FC ; wait for key and new line
#_08DF65: db $FA ; clear message box
#_08DF66: db $26, $43, $43, $A9, $CF, $3F, $A9, $28 ; いままで⎵ひでえ
#_08DF6E: db $2E, $38 ; こと
#_08DF70: db $F9 ; new line
#_08DF71: db $48, $4C, $34, $26, $42, $27, $A6, $26 ; やりたいほうだい
#_08DF79: db $CF, $A6, $58, $34, $2A, $4B, $39 ; ⎵だったからな
#_08DF80: db $FC ; wait for key and new line
#_08DF81: db $FF ; end of message

;===================================================================================================

; «しせつけいさつ»:
; われわれは しみんを まもる けいさつさまだ!
; かんしゃしろ! かんしゃを!
Message_00_0A_45:
#_08DF82: db $D2, $47, $46 ; test progress bit 47 for message 46
#_08DF85: db $D6, $00, $A6, $70, $28 ; place sprite A6 in slot 00 at XY:{70,28}
#_08DF8A: db $F2, $42 ; prewritten text 42
#_08DF8C: db $9A ; :
#_08DF8D: db $F9 ; new line
#_08DF8E: db $50, $4E, $50, $4E, $3E, $CF, $30, $44 ; われわれは⎵しみ
#_08DF96: db $52, $51, $CF, $43, $47, $4D, $CF, $2D ; んを⎵まもる⎵け
#_08DF9E: db $26, $2F, $36, $2F, $43, $A6, $94 ; いさつさまだ!
#_08DFA5: db $F9 ; new line
#_08DFA6: db $2A, $52, $30, $55, $30, $4F, $94, $CF ; かんしゃしろ!⎵
#_08DFAE: db $2A, $52, $30, $55, $51, $94 ; かんしゃを!
#_08DFB4: db $FC ; wait for key and new line
#_08DFB5: db $FF ; end of message

;===================================================================================================

; おんな:
; わたし あいつらに ひどいめに あったのよ
; こんど あったら いかしちゃおかない!
Message_00_0A_46:
#_08DFB6: db $D6, $00, $88, $70, $28 ; place sprite 88 in slot 00 at XY:{70,28}
#_08DFBB: db $29, $52, $39, $9A ; おんな:
#_08DFBF: db $F9 ; new line
#_08DFC0: db $50, $34, $30, $CF, $25, $26, $36, $4B ; わたし⎵あいつら
#_08DFC8: db $3A, $CF, $3F, $AA, $26, $46, $3A, $CF ; に⎵ひどいめに⎵
#_08DFD0: db $25, $58, $34, $3D, $4A ; あったのよ
#_08DFD5: db $F9 ; new line
#_08DFD6: db $2E, $52, $AA, $CF, $25, $58, $34, $4B ; こんど⎵あったら
#_08DFDE: db $CF, $26, $2A, $30, $35, $55, $29, $2A ; ⎵いかしちゃおか
#_08DFE6: db $39, $26, $94 ; ない!
#_08DFE9: db $FC ; wait for key and new line
#_08DFEA: db $FF ; end of message

;===================================================================================================

Message_00_0A_47:
#_08DFEB: db $D2, $52, $55 ; test progress bit 52 for message 55
#_08DFEE: db $D2, $46, $54 ; test progress bit 46 for message 54

;===================================================================================================

; おとこ:
; «こうやって サケがのめる»
; のも
; «オザワさま»が まちを おさめてくれる おかげだ
Message_00_0A_48:
#_08DFF1: db $D6, $00, $87, $70, $28 ; place sprite 87 in slot 00 at XY:{70,28}
#_08DFF6: db $29, $38, $2E, $9A ; おとこ:
#_08DFFA: db $F9 ; new line
#_08DFFB: db $D2, $47, $49 ; test progress bit 47 for message 49
#_08DFFE: db $F2, $44 ; prewritten text 44
#_08E000: db $3D, $47 ; のも
#_08E002: db $F9 ; new line
#_08E003: db $F2, $65 ; prewritten text 65
#_08E005: db $9C, $CF, $43, $35, $51, $CF, $29, $2F ; が⎵まちを⎵おさ
#_08E00D: db $46, $37, $2C, $4E, $4D, $CF, $29, $2A ; めてくれる⎵おか
#_08E015: db $9F, $A6 ; げだ
#_08E017: db $FC ; wait for key and new line
#_08E018: db $FF ; end of message

;===================================================================================================

; けっきょく オザワが いなくなっても
; «こうやって サケがのめる»
Message_00_0A_49:
#_08E019: db $2D, $58, $2B, $57, $2C, $CF, $61, $BA ; けっきょく⎵オザ
#_08E021: db $88, $9C, $CF, $26, $39, $2C, $39, $58 ; ワが⎵いなくなっ
#_08E029: db $37, $47 ; ても
#_08E02B: db $F9 ; new line
#_08E02C: db $F2, $44 ; prewritten text 44
#_08E02E: db $FC ; wait for key and new line
#_08E02F: db $FF ; end of message

;===================================================================================================

; おとこ:
; シブヤに きゅうせいしゅの しょうじょが
; やってきたって はなし まえに きいたぜ
; さいきん うわさを きかなくなったのは
; どうしたんだろう
Message_00_0A_4A:
#_08E030: db $D6, $00, $87, $70, $28 ; place sprite 87 in slot 00 at XY:{70,28}
#_08E035: db $29, $38, $2E, $9A ; おとこ:
#_08E039: db $F9 ; new line
#_08E03A: db $68, $C6, $80, $3A, $CF, $2B, $56, $27 ; シブヤに⎵きゅう
#_08E042: db $32, $26, $30, $56, $3D, $CF, $30, $57 ; せいしゅの⎵しょ
#_08E04A: db $27, $A2, $57, $9C ; うじょが
#_08E04E: db $F9 ; new line
#_08E04F: db $48, $58, $37, $2B, $34, $58, $37, $CF ; やってきたって⎵
#_08E057: db $3E, $39, $30, $CF, $43, $28, $3A, $CF ; はなし⎵まえに⎵
#_08E05F: db $2B, $26, $34, $A4 ; きいたぜ
#_08E063: db $FC ; wait for key and new line
#_08E064: db $FA ; clear message box
#_08E065: db $2F, $26, $2B, $52, $CF, $27, $50, $2F ; さいきん⎵うわさ
#_08E06D: db $51, $CF, $2B, $2A, $39, $2C, $39, $58 ; を⎵きかなくなっ
#_08E075: db $34, $3D, $3E ; たのは
#_08E078: db $F9 ; new line
#_08E079: db $AA, $27, $30, $34, $52, $A6, $4F, $27 ; どうしたんだろう
#_08E081: db $FC ; wait for key and new line
#_08E082: db $FF ; end of message

;===================================================================================================

; おとこ:
; «オザワさま»の ちからで アクマは ここで
; にんげんを おそわないんだ
; たしょうのことは ガマンしなくっちゃ
Message_00_0A_4B:
#_08E083: db $D6, $00, $B0, $70, $38 ; place sprite B0 in slot 00 at XY:{70,38}
#_08E088: db $29, $38, $2E, $9A ; おとこ:
#_08E08C: db $F9 ; new line
#_08E08D: db $D2, $47, $4C ; test progress bit 47 for message 4C
#_08E090: db $F2, $65 ; prewritten text 65
#_08E092: db $3D, $CF, $35, $2A, $4B, $A9, $CF, $5D ; の⎵ちからで⎵ア
#_08E09A: db $64, $7B, $3E, $CF, $2E, $2E, $A9 ; クマは⎵ここで
#_08E0A1: db $F9 ; new line
#_08E0A2: db $3A, $52, $9F, $52, $51, $CF, $29, $33 ; にんげんを⎵おそ
#_08E0AA: db $50, $39, $26, $52, $A6 ; わないんだ
#_08E0AF: db $FC ; wait for key and new line
#_08E0B0: db $FA ; clear message box
#_08E0B1: db $34, $30, $57, $27, $3D, $2E, $38, $3E ; たしょうのことは
#_08E0B9: db $CF, $B5, $7B, $8A, $30, $39, $2C, $58 ; ⎵ガマンしなくっ
#_08E0C1: db $35, $55 ; ちゃ
#_08E0C3: db $FC ; wait for key and new line
#_08E0C4: db $FF ; end of message

;===================================================================================================

; «オザワさま»が いなけりゃ
; だれが このまちを おさめるんだ?
Message_00_0A_4C:
#_08E0C5: db $F2, $65 ; prewritten text 65
#_08E0C7: db $9C, $CF, $26, $39, $2D, $4C, $55 ; が⎵いなけりゃ
#_08E0CE: db $F9 ; new line
#_08E0CF: db $A6, $4E, $9C, $CF, $2E, $3D, $43, $35 ; だれが⎵このまち
#_08E0D7: db $51, $CF, $29, $2F, $46, $4D, $52, $A6 ; を⎵おさめるんだ
#_08E0DF: db $95 ; ?
#_08E0E0: db $FC ; wait for key and new line
#_08E0E1: db $FF ; end of message

;===================================================================================================

; おとこ:
; うわさに まどわされるんじゃないぞ
; «ロッポンギ»には いくな
; あそこは ゾンビが あふれる しびとの まちだ
Message_00_0A_4D:
#_08E0E2: db $D6, $00, $87, $70, $28 ; place sprite 87 in slot 00 at XY:{70,28}
#_08E0E7: db $29, $38, $2E, $9A ; おとこ:
#_08E0EB: db $F9 ; new line
#_08E0EC: db $27, $50, $2F, $3A, $CF, $43, $AA, $50 ; うわさに⎵まどわ
#_08E0F4: db $2F, $4E, $4D, $52, $A2, $55, $39, $26 ; されるんじゃない
#_08E0FC: db $A5 ; ぞ
#_08E0FD: db $F9 ; new line
#_08E0FE: db $F2, $4C ; prewritten text 4C
#_08E100: db $3A, $3E, $CF, $26, $2C, $39 ; には⎵いくな
#_08E106: db $F9 ; new line
#_08E107: db $25, $33, $2E, $3E, $CF, $BE, $8A, $C5 ; あそこは⎵ゾンビ
#_08E10F: db $9C, $CF, $25, $40, $4E, $4D, $CF, $30 ; が⎵あふれる⎵し
#_08E117: db $AC, $38, $3D, $CF, $43, $35, $A6 ; びとの⎵まちだ
#_08E11E: db $FC ; wait for key and new line
#_08E11F: db $FF ; end of message

;===================================================================================================

; おんな:
; «シンジュク»を しはいしてる
; «オザワさま»って ステキよね
; やっぱり おとこは つよくなくてはね
Message_00_0A_4E:
#_08E120: db $D6, $00, $8A, $70, $28 ; place sprite 8A in slot 00 at XY:{70,28}
#_08E125: db $29, $52, $39, $9A ; おんな:
#_08E129: db $F9 ; new line
#_08E12A: db $D2, $47, $4F ; test progress bit 47 for message 4F
#_08E12D: db $F2, $18 ; prewritten text 18
#_08E12F: db $51, $CF, $30, $3E, $26, $30, $37, $4D ; を⎵しはいしてる
#_08E137: db $F9 ; new line
#_08E138: db $F2, $65 ; prewritten text 65
#_08E13A: db $58, $37, $CF, $69, $6F, $63, $4A, $3C ; って⎵ステキよね
#_08E142: db $F9 ; new line
#_08E143: db $48, $58, $B0, $4C, $CF, $29, $38, $2E ; やっぱり⎵おとこ
#_08E14B: db $3E, $CF, $36, $4A, $2C, $39, $2C, $37 ; は⎵つよくなくて
#_08E153: db $3E, $3C ; はね
#_08E155: db $FC ; wait for key and new line
#_08E156: db $FF ; end of message

;===================================================================================================

; えっ «オザワさま»って しんだの?
Message_00_0A_4F:
#_08E157: db $28, $58, $CF ; えっ⎵
#_08E15A: db $F2, $65 ; prewritten text 65
#_08E15C: db $58, $37, $CF, $30, $52, $A6, $3D, $95 ; って⎵しんだの?
#_08E164: db $FC ; wait for key and new line
#_08E165: db $FF ; end of message

;===================================================================================================

; おんな:
; «ロッポンギ»には もっと おっきなディスコが
; あるんだって
; でも «オザワさま»の おさめてる
; シンジュクが いいわ!
; だって アクマに やられたくないもん
Message_00_0A_50:
#_08E166: db $D6, $00, $8A, $70, $28 ; place sprite 8A in slot 00 at XY:{70,28}
#_08E16B: db $29, $52, $39, $9A ; おんな:
#_08E16F: db $F9 ; new line
#_08E170: db $D2, $47, $51 ; test progress bit 47 for message 51
#_08E173: db $F2, $4C ; prewritten text 4C
#_08E175: db $3A, $3E, $CF, $47, $58, $38, $CF, $29 ; には⎵もっと⎵お
#_08E17D: db $58, $2B, $39, $C2, $8C, $69, $66, $9C ; っきなディスコが
#_08E185: db $F9 ; new line
#_08E186: db $25, $4D, $52, $A6, $58, $37 ; あるんだって
#_08E18C: db $FC ; wait for key and new line
#_08E18D: db $FA ; clear message box
#_08E18E: db $A9, $47, $CF ; でも⎵
#_08E191: db $F2, $65 ; prewritten text 65
#_08E193: db $3D, $CF, $29, $2F, $46, $37, $4D ; の⎵おさめてる
#_08E19A: db $F9 ; new line
#_08E19B: db $68, $8A, $BB, $90, $64, $9C, $CF, $26 ; シンジュクが⎵い
#_08E1A3: db $26, $50, $94 ; いわ!
#_08E1A6: db $FC ; wait for key and new line
#_08E1A7: db $A6, $58, $37, $CF, $5D, $64, $7B, $3A ; だって⎵アクマに
#_08E1AF: db $CF, $48, $4B, $4E, $34, $2C, $39, $26 ; ⎵やられたくない
#_08E1B7: db $47, $52 ; もん
#_08E1B9: db $FC ; wait for key and new line
#_08E1BA: db $FF ; end of message

;===================================================================================================

; やっぱ «ロッポンギ» いってみよっかなー
Message_00_0A_51:
#_08E1BB: db $48, $58, $B0, $CF ; やっぱ⎵
#_08E1BF: db $F2, $4C ; prewritten text 4C
#_08E1C1: db $CF, $26, $58, $37, $44, $4A, $58, $2A ; ⎵いってみよっか
#_08E1C9: db $39, $5A ; なー
#_08E1CB: db $FC ; wait for key and new line
#_08E1CC: db $FF ; end of message

;===================================================================================================

; おとこ:
; «おまえたち» よそから きたらしいな
; このまちの しはいしゃ オザワを しってるか?
; やつの あくどいやりかたを しってるか?
; オザワは アクマと てをむすんで
; そのちからを りようして まちをしはいしている
; まちのやつらは オザワのおかげで
; アクマに おそわれないかわり
; オザワのめいれいには ぜったい さからえない
; もし さからったら オザワの«しせつけいさつ»に
; つれてかれて むりやり せんのうされてしまう
; «しせつけいさつ» といったって
; じつは てしたの チンピラどもだ
; オザワを バックに やりたいほうだい«・・・»
; «・・・»やばい! «しせつけいさつ»だ!
; じゃあな いのちが あったら またあおうぜ
; «しせつけいさつ»:
; おいっ! いまのおとこ なにしゃべってた!?
Message_00_0A_52:
#_08E1CD: db $D2, $48, $53 ; test progress bit 48 for message 53
#_08E1D0: db $D6, $00, $87, $70, $28 ; place sprite 87 in slot 00 at XY:{70,28}
#_08E1D5: db $29, $38, $2E, $9A ; おとこ:
#_08E1D9: db $F9 ; new line
#_08E1DA: db $F2, $04 ; prewritten text 04
#_08E1DC: db $CF, $4A, $33, $2A, $4B, $CF, $2B, $34 ; ⎵よそから⎵きた
#_08E1E4: db $4B, $30, $26, $39 ; らしいな
#_08E1E8: db $FC ; wait for key and new line
#_08E1E9: db $FA ; clear message box
#_08E1EA: db $2E, $3D, $43, $35, $3D, $CF, $30, $3E ; このまちの⎵しは
#_08E1F2: db $26, $30, $55, $CF, $61, $BA, $88, $51 ; いしゃ⎵オザワを
#_08E1FA: db $CF, $30, $58, $37, $4D, $2A, $95 ; ⎵しってるか?
#_08E201: db $F9 ; new line
#_08E202: db $48, $36, $3D, $CF, $25, $2C, $AA, $26 ; やつの⎵あくどい
#_08E20A: db $48, $4C, $2A, $34, $51, $CF, $30, $58 ; やりかたを⎵しっ
#_08E212: db $37, $4D, $2A, $95 ; てるか?
#_08E216: db $FC ; wait for key and new line
#_08E217: db $FA ; clear message box
#_08E218: db $61, $BA, $88, $3E, $CF, $5D, $64, $7B ; オザワは⎵アクマ
#_08E220: db $38, $CF, $37, $51, $45, $31, $52, $A9 ; と⎵てをむすんで
#_08E228: db $F9 ; new line
#_08E229: db $33, $3D, $35, $2A, $4B, $51, $CF, $4C ; そのちからを⎵り
#_08E231: db $4A, $27, $30, $37, $CF, $43, $35, $51 ; ようして⎵まちを
#_08E239: db $30, $3E, $26, $30, $37, $26, $4D ; しはいしている
#_08E240: db $FC ; wait for key and new line
#_08E241: db $FA ; clear message box
#_08E242: db $43, $35, $3D, $48, $36, $4B, $3E, $CF ; まちのやつらは⎵
#_08E24A: db $61, $BA, $88, $3D, $29, $2A, $9F, $A9 ; オザワのおかげで
#_08E252: db $F9 ; new line
#_08E253: db $5D, $64, $7B, $3A, $CF, $29, $33, $50 ; アクマに⎵おそわ
#_08E25B: db $4E, $39, $26, $2A, $50, $4C ; れないかわり
#_08E261: db $F9 ; new line
#_08E262: db $61, $BA, $88, $3D, $46, $26, $4E, $26 ; オザワのめいれい
#_08E26A: db $3A, $3E, $CF, $A4, $58, $34, $26, $CF ; には⎵ぜったい⎵
#_08E272: db $2F, $2A, $4B, $28, $39, $26 ; さからえない
#_08E278: db $FC ; wait for key and new line
#_08E279: db $FA ; clear message box
#_08E27A: db $47, $30, $CF, $2F, $2A, $4B, $58, $34 ; もし⎵さからった
#_08E282: db $4B, $CF, $61, $BA, $88, $3D ; ら⎵オザワの
#_08E288: db $F2, $42 ; prewritten text 42
#_08E28A: db $3A ; に
#_08E28B: db $F9 ; new line
#_08E28C: db $36, $4E, $37, $2A, $4E, $37, $CF, $45 ; つれてかれて⎵む
#_08E294: db $4C, $48, $4C, $CF, $32, $52, $3D, $27 ; りやり⎵せんのう
#_08E29C: db $2F, $4E, $37, $30, $43, $27 ; されてしまう
#_08E2A2: db $FC ; wait for key and new line
#_08E2A3: db $FA ; clear message box
#_08E2A4: db $F2, $42 ; prewritten text 42
#_08E2A6: db $CF, $38, $26, $58, $34, $58, $37 ; ⎵といったって
#_08E2AD: db $F9 ; new line
#_08E2AE: db $A2, $36, $3E, $CF, $37, $30, $34, $3D ; じつは⎵てしたの
#_08E2B6: db $CF, $6D, $8A, $CA, $83, $AA, $47, $A6 ; ⎵チンピラどもだ
#_08E2BE: db $F9 ; new line
#_08E2BF: db $61, $BA, $88, $51, $CF, $C4, $92, $64 ; オザワを⎵バック
#_08E2C7: db $3A, $CF, $48, $4C, $34, $26, $42, $27 ; に⎵やりたいほう
#_08E2CF: db $A6, $26 ; だい
#_08E2D1: db $F2, $0B ; prewritten text 0B
#_08E2D3: db $FC ; wait for key and new line
#_08E2D4: db $FA ; clear message box
#_08E2D5: db $F2, $0B ; prewritten text 0B
#_08E2D7: db $48, $AB, $26, $94, $CF ; やばい!⎵
#_08E2DC: db $F2, $42 ; prewritten text 42
#_08E2DE: db $A6, $94 ; だ!
#_08E2E0: db $F9 ; new line
#_08E2E1: db $A2, $55, $25, $39, $CF, $26, $3D, $35 ; じゃあな⎵いのち
#_08E2E9: db $9C, $CF, $25, $58, $34, $4B, $CF, $43 ; が⎵あったら⎵ま
#_08E2F1: db $34, $25, $29, $27, $A4 ; たあおうぜ
#_08E2F6: db $FC ; wait for key and new line
#_08E2F7: db $FA ; clear message box
#_08E2F8: db $D6, $00, $00 ; delete sprite in slot 00
#_08E2FB: db $FE, $07, $40 ; ext command 07: draw buffered text then wait 63 frames
#_08E2FE: db $D6, $00, $A6, $70, $28 ; place sprite A6 in slot 00 at XY:{70,28}
#_08E303: db $F2, $42 ; prewritten text 42
#_08E305: db $9A ; :
#_08E306: db $F9 ; new line
#_08E307: db $29, $26, $58, $94, $CF, $26, $43, $3D ; おいっ!⎵いまの
#_08E30F: db $29, $38, $2E, $CF, $39, $3A, $30, $55 ; おとこ⎵なにしゃ
#_08E317: db $AE, $58, $37, $34, $94, $95 ; べってた!?
#_08E31D: db $FC ; wait for key and new line
#_08E31E: db $D0, $48 ; set progress bit 48
#_08E320: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
Message_00_0A_53:
#_08E321: db $97 ; >
#_08E322: db $F2, $2C ; prewritten text 2C
#_08E324: db $FC ; wait for key and new line
#_08E325: db $FF ; end of message

;===================================================================================================

Message_00_0A_54:
#_08E326: db $D2, $50, $48 ; test progress bit 50 for message 48

;===================================================================================================

; «サイコダイバー»:
; «こうやって サケがのめる»
; のも
; きみたちの おかげだ
; «・・・»もう せいしんに はいりこむ のうりょくは
; つかわないことにするよ
Message_00_0A_55:
#_08E329: db $D6, $00, $B1, $70, $38 ; place sprite B1 in slot 00 at XY:{70,38}
#_08E32E: db $F2, $46 ; prewritten text 46
#_08E330: db $9A ; :
#_08E331: db $F9 ; new line
#_08E332: db $F2, $44 ; prewritten text 44
#_08E334: db $3D, $47 ; のも
#_08E336: db $F9 ; new line
#_08E337: db $2B, $44, $34, $35, $3D, $CF, $29, $2A ; きみたちの⎵おか
#_08E33F: db $9F, $A6 ; げだ
#_08E341: db $FC ; wait for key and new line
#_08E342: db $D2, $4F, $56 ; test progress bit 4F for message 56
#_08E345: db $FA ; clear message box
#_08E346: db $F2, $0B ; prewritten text 0B
#_08E348: db $47, $27, $CF, $32, $26, $30, $52, $3A ; もう⎵せいしんに
#_08E350: db $CF, $3E, $26, $4C, $2E, $45, $CF, $3D ; ⎵はいりこむ⎵の
#_08E358: db $27, $4C, $57, $2C, $3E ; うりょくは
#_08E35D: db $F9 ; new line
#_08E35E: db $36, $2A, $50, $39, $26, $2E, $38, $3A ; つかわないことに
#_08E366: db $31, $4D, $4A ; するよ
#_08E369: db $FC ; wait for key and new line
#_08E36A: db $FF ; end of message

;===================================================================================================

Message_00_0A_56:
#_08E36B: db $FE, $1D, $60, $C0 ; ext command 1D: load classy message C060

;===================================================================================================

; ホステス:
; いらっしゃい おやすくしとくよ
Message_00_0A_57:
#_08E36F: db $D6, $00, $88, $70, $28 ; place sprite 88 in slot 00 at XY:{70,28}
#_08E374: db $7A, $69, $6F, $69, $9A ; ホステス:
#_08E379: db $F9 ; new line
#_08E37A: db $26, $4B, $58, $30, $55, $26, $CF, $29 ; いらっしゃい⎵お
#_08E382: db $48, $31, $2C, $30, $38, $2C, $4A ; やすくしとくよ
#_08E389: db $FC ; wait for key and new line
#_08E38A: db $D0, $0C ; set progress bit 0C
#_08E38C: db $FF ; end of message

;===================================================================================================

; ホステス:
; また きてね
Message_00_0A_58:
#_08E38D: db $D6, $00, $88, $70, $28 ; place sprite 88 in slot 00 at XY:{70,28}
#_08E392: db $7A, $69, $6F, $69, $9A ; ホステス:
#_08E397: db $F9 ; new line
#_08E398: db $43, $34, $CF, $2B, $37, $3C ; また⎵きてね
#_08E39E: db $FC ; wait for key and new line
#_08E39F: db $D1, $0C ; clear progress bit 0C
#_08E3A1: db $FF ; end of message

;===================================================================================================

; ボーイ:
; さあさあ かねさえだせば
; のみほうだいだよ
Message_00_0A_59:
#_08E3A2: db $D6, $00, $B2, $70, $38 ; place sprite B2 in slot 00 at XY:{70,38}
#_08E3A7: db $C8, $5A, $5E, $9A ; ボーイ:
#_08E3AB: db $F9 ; new line
#_08E3AC: db $2F, $25, $2F, $25, $CF, $2A, $3C, $2F ; さあさあ⎵かねさ
#_08E3B4: db $28, $A6, $32, $AB ; えだせば
#_08E3B8: db $F9 ; new line
#_08E3B9: db $3D, $44, $42, $27, $A6, $26, $A6, $4A ; のみほうだいだよ
#_08E3C1: db $FC ; wait for key and new line
#_08E3C2: db $FF ; end of message

;===================================================================================================

; ボーイ:
; また こいよな
Message_00_0A_5A:
#_08E3C3: db $D6, $00, $B2, $70, $38 ; place sprite B2 in slot 00 at XY:{70,38}
#_08E3C8: db $C8, $5A, $5E, $9A ; ボーイ:
#_08E3CC: db $F9 ; new line
#_08E3CD: db $43, $34, $CF, $2E, $26, $4A, $39 ; また⎵こいよな
#_08E3D4: db $FC ; wait for key and new line
#_08E3D5: db $D1, $0C ; clear progress bit 0C
#_08E3D7: db $FF ; end of message

;===================================================================================================

; おんな:
; にゅうじょうりょうを いただくよ
Message_00_0A_5B:
#_08E3D8: db $D6, $00, $A4, $70, $28 ; place sprite A4 in slot 00 at XY:{70,28}
#_08E3DD: db $DA, $00, $00, $00 ; give 0 money
#_08E3E1: db $29, $52, $39, $9A ; おんな:
#_08E3E5: db $F9 ; new line
#_08E3E6: db $D9, $32, $00, $00, $5C ; go to message 5C if money < 50
#_08E3EB: db $3A, $56, $27, $A2, $57, $27, $4C, $57 ; にゅうじょうりょ
#_08E3F3: db $27, $51, $CF, $26, $34, $A6, $2C, $4A ; うを⎵いただくよ
#_08E3FB: db $FC ; wait for key and new line
#_08E3FC: db $DA, $CE, $FF, $FF ; take 50 money
#_08E400: db $FF ; end of message

;===================================================================================================

; かねの ないやつは おことわりだ
Message_00_0A_5C:
#_08E401: db $2A, $3C, $3D, $CF, $39, $26, $48, $36 ; かねの⎵ないやつ
#_08E409: db $3E, $CF, $29, $2E, $38, $50, $4C, $A6 ; は⎵おことわりだ
#_08E411: db $FC ; wait for key and new line
#_08E412: db $FE, $1A, $3E, $8E, $08, $00, $07, $0E ; ext command 1A: 3E,8E,08,00,07,0E
#_08E41A: db $FE, $37 ; ext command 37: reload dungeon view
#_08E41C: db $FF ; end of message

;===================================================================================================

; おんな:
; また こいよな
Message_00_0A_5D:
#_08E41D: db $D6, $00, $A4, $70, $28 ; place sprite A4 in slot 00 at XY:{70,28}
#_08E422: db $29, $52, $39, $9A ; おんな:
#_08E426: db $F9 ; new line
#_08E427: db $43, $34, $CF, $2E, $26, $4A, $39 ; また⎵こいよな
#_08E42E: db $FC ; wait for key and new line
#_08E42F: db $FF ; end of message

;===================================================================================================

Message_00_0B_00:
#_08E430: db $D5, $57 ; send 57 to APU
#_08E432: db $D7, $04 ; load scene 04

;===================================================================================================

; こちらは 
; COMPつうしんターミナル です
; ごりようのかたは アクセスしてください
Message_00_0B_01:
#_08E434: db $FE, $14, $20 ; ext command 14: set $0A2C to $20 TODO
#_08E437: db $FE, $71 ; ext command 71: Call routine 0380FA TODO
#_08E439: db $FA ; clear message box
#_08E43A: db $2E, $35, $4B, $3E, $CF ; こちらは⎵
#_08E43F: db $FE, $74 ; ext command 74: Write text from $07E1 TODO
#_08E441: db $F9 ; new line
#_08E442: db $0D, $19, $17, $1A, $36, $27, $30, $52 ; COMPつうしん
#_08E44A: db $6C, $5A, $7C, $71, $85, $CF, $A9, $31 ; ターミナル⎵です
#_08E452: db $F9 ; new line
#_08E453: db $A0, $4C, $4A, $27, $3D, $2A, $34, $3E ; ごりようのかたは
#_08E45B: db $CF, $5D, $64, $6A, $69, $30, $37, $2C ; ⎵アクセスしてく
#_08E463: db $A6, $2F, $26 ; ださい
#_08E466: db $FC ; wait for key and new line

;===================================================================================================

; なにを しますか?
Message_00_0B_02:
#_08E467: db $FE, $14, $20 ; ext command 14: set $0A2C to $20 TODO
#_08E46A: db $FA ; clear message box
#_08E46B: db $39, $3A, $51, $CF, $30, $43, $31, $2A ; なにを⎵しますか
#_08E473: db $95 ; ?
#_08E474: db $D8, $02 ; option list with 3 options
#_08E476: db $06, $0A ; option 1 [06]: go to message 0A
#_08E478: db $05, $04 ; option 2 [05]: go to message 04
#_08E47A: db $19, $03 ; option 3 [19]: go to message 03

;===================================================================================================

; またの ごりようをおまちしています
Message_00_0B_03:
#_08E47C: db $FA ; clear message box
#_08E47D: db $43, $34, $3D, $CF, $A0, $4C, $4A, $27 ; またの⎵ごりよう
#_08E485: db $51, $29, $43, $35, $30, $37, $26, $43 ; をおまちしていま
#_08E48D: db $31 ; す
#_08E48E: db $FC ; wait for key and new line
#_08E48F: db $FF ; end of message

;===================================================================================================

; «セーブ かんりょう しました»
Message_00_0B_04:
#_08E490: db $FE, $42 ; ext command 42: go to file select
#_08E492: db $D5, $57 ; send 57 to APU
#_08E494: db $FE, $22, $02 ; ext command 22: go to message 02 if $0A58 flags failure
#_08E497: db $F2, $5A ; prewritten text 5A

;===================================================================================================

; «ゲームを つづけますか?»
Message_00_0B_06:
#_08E499: db $FA ; clear message box
#_08E49A: db $F2, $5B ; prewritten text 5B
#_08E49C: db $F8, $02 ; YES/NO - go to message 02 if YES

;===================================================================================================

; それでは でんげんをきって
; おやすみください
; おやすみのあいだ アクマに にくたいを
; のっとられぬよう おきをつけて«・・・»
Message_00_0B_07:
#_08E49E: db $FA ; clear message box
#_08E49F: db $33, $4E, $A9, $3E, $CF, $A9, $52, $9F ; それでは⎵でんげ
#_08E4A7: db $52, $51, $2B, $58, $37 ; んをきって
#_08E4AC: db $F9 ; new line
#_08E4AD: db $29, $48, $31, $44, $2C, $A6, $2F, $26 ; おやすみください
#_08E4B5: db $FC ; wait for key and new line
#_08E4B6: db $FA ; clear message box
#_08E4B7: db $29, $48, $31, $44, $3D, $25, $26, $A6 ; おやすみのあいだ
#_08E4BF: db $CF, $5D, $64, $7B, $3A, $CF, $3A, $2C ; ⎵アクマに⎵にく
#_08E4C7: db $34, $26, $51 ; たいを
#_08E4CA: db $F9 ; new line
#_08E4CB: db $3D, $58, $38, $4B, $4E, $3B, $4A, $27 ; のっとられぬよう
#_08E4D3: db $CF, $29, $2B, $51, $36, $2D, $37 ; ⎵おきをつけて
#_08E4DA: db $F2, $0B ; prewritten text 0B
#_08E4DC: db $FC ; wait for key and new line
#_08E4DD: db $D5, $FD ; send FD to APU

;===================================================================================================

Message_00_0B_08:
#_08E4DF: db $D3, $08 ; go to message 08

;===================================================================================================

; てんそうするばしょが ありません
Message_00_0B_09:
#_08E4E1: db $37, $52, $33, $27, $31, $4D, $AB, $30 ; てんそうするばし
#_08E4E9: db $57, $9C, $CF, $25, $4C, $43, $32, $52 ; ょが⎵ありません
#_08E4F1: db $FC ; wait for key and new line
#_08E4F2: db $D3, $02 ; go to message 02

;===================================================================================================

; てんそうするばしょを えらんでください
Message_00_0B_0A:
#_08E4F4: db $FA ; clear message box
#_08E4F5: db $FE, $6A, $09 ; ext command 6A: R0FAEF9, maybe go to message 09 TODO
#_08E4F8: db $37, $52, $33, $27, $31, $4D, $AB, $30 ; てんそうするばし
#_08E500: db $57, $51, $CF, $28, $4B, $52, $A9, $2C ; ょを⎵えらんでく
#_08E508: db $A6, $2F, $26 ; ださい
#_08E50B: db $FE, $18, $02 ; ext command 18: $02 TODO

;===================================================================================================

; では  へ
; てんそうします
Message_00_0B_0C:
#_08E50E: db $FA ; clear message box
#_08E50F: db $A9, $3E, $CF ; では⎵
#_08E512: db $FE, $19 ; ext command 19: TODO
#_08E514: db $CF, $41 ; ⎵へ
#_08E516: db $F9 ; new line
#_08E517: db $37, $52, $33, $27, $30, $43, $31 ; てんそうします
#_08E51E: db $FC ; wait for key and new line
#_08E51F: db $FE, $5D ; ext command 5D: teleport to terminal

;===================================================================================================

; てんそう かんりょう しました
Message_00_0B_0D:
#_08E521: db $D5, $57 ; send 57 to APU
#_08E523: db $FA ; clear message box
#_08E524: db $37, $52, $33, $27, $CF, $2A, $52, $4C ; てんそう⎵かんり
#_08E52C: db $57, $27, $CF, $30, $43, $30, $34 ; ょう⎵しました
#_08E533: db $FC ; wait for key and new line
#_08E534: db $D3, $02 ; go to message 02

;===================================================================================================

Message_00_0B_0E:
#_08E536: db $FE, $17, $00 ; ext command 17: set $0BE2 and $07E1 to $00 TODO
#_08E539: db $D3, $00 ; go to message 00

;===================================================================================================

Message_00_0B_0F:
#_08E53B: db $FE, $17, $01 ; ext command 17: set $0BE2 and $07E1 to $01 TODO
#_08E53E: db $D3, $00 ; go to message 00

;===================================================================================================

Message_00_0B_10:
#_08E540: db $FE, $17, $02 ; ext command 17: set $0BE2 and $07E1 to $02 TODO
#_08E543: db $D3, $00 ; go to message 00

;===================================================================================================

Message_00_0B_11:
#_08E545: db $FE, $17, $03 ; ext command 17: set $0BE2 and $07E1 to $03 TODO
#_08E548: db $D3, $00 ; go to message 00

;===================================================================================================

Message_00_0B_12:
#_08E54A: db $FE, $17, $04 ; ext command 17: set $0BE2 and $07E1 to $04 TODO
#_08E54D: db $D3, $00 ; go to message 00

;===================================================================================================

Message_00_0B_13:
#_08E54F: db $FE, $17, $05 ; ext command 17: set $0BE2 and $07E1 to $05 TODO
#_08E552: db $D3, $00 ; go to message 00

;===================================================================================================

Message_00_0B_14:
#_08E554: db $FE, $17, $06 ; ext command 17: set $0BE2 and $07E1 to $06 TODO
#_08E557: db $D3, $00 ; go to message 00

;===================================================================================================

Message_00_0B_15:
#_08E559: db $FE, $17, $07 ; ext command 17: set $0BE2 and $07E1 to $07 TODO
#_08E55C: db $D3, $00 ; go to message 00

;===================================================================================================

Message_00_0B_16:
#_08E55E: db $FE, $17, $08 ; ext command 17: set $0BE2 and $07E1 to $08 TODO
#_08E561: db $D3, $00 ; go to message 00

;===================================================================================================

Message_00_0B_17:
#_08E563: db $FE, $17, $09 ; ext command 17: set $0BE2 and $07E1 to $09 TODO
#_08E566: db $D3, $00 ; go to message 00

;===================================================================================================

Message_00_0B_18:
#_08E568: db $FE, $17, $0A ; ext command 17: set $0BE2 and $07E1 to $0A TODO
#_08E56B: db $D3, $00 ; go to message 00

;===================================================================================================

Message_00_0B_19:
#_08E56D: db $FE, $17, $0B ; ext command 17: set $0BE2 and $07E1 to $0B TODO
#_08E570: db $D3, $00 ; go to message 00

;===================================================================================================

Message_00_0B_1A:
#_08E572: db $FE, $17, $0C ; ext command 17: set $0BE2 and $07E1 to $0C TODO
#_08E575: db $D3, $00 ; go to message 00

;===================================================================================================

Message_00_0B_1B:
#_08E577: db $FE, $17, $0D ; ext command 17: set $0BE2 and $07E1 to $0D TODO
#_08E57A: db $D3, $00 ; go to message 00

;===================================================================================================

Message_00_0B_1C:
#_08E57C: db $FE, $17, $00 ; ext command 17: set $0BE2 and $07E1 to $00 TODO
#_08E57F: db $D3, $23 ; go to message 23

;===================================================================================================

Message_00_0B_1D:
#_08E581: db $FE, $17, $01 ; ext command 17: set $0BE2 and $07E1 to $01 TODO
#_08E584: db $D3, $23 ; go to message 23

;===================================================================================================

Message_00_0B_1E:
#_08E586: db $FE, $17, $02 ; ext command 17: set $0BE2 and $07E1 to $02 TODO
#_08E589: db $D3, $23 ; go to message 23

;===================================================================================================

Message_00_0B_1F:
#_08E58B: db $FE, $17, $03 ; ext command 17: set $0BE2 and $07E1 to $03 TODO
#_08E58E: db $D3, $23 ; go to message 23

;===================================================================================================

Message_00_0B_20:
#_08E590: db $FE, $17, $04 ; ext command 17: set $0BE2 and $07E1 to $04 TODO
#_08E593: db $D3, $23 ; go to message 23

;===================================================================================================

Message_00_0B_21:
#_08E595: db $FE, $17, $05 ; ext command 17: set $0BE2 and $07E1 to $05 TODO
#_08E598: db $D3, $23 ; go to message 23

;===================================================================================================

Message_00_0B_22:
#_08E59A: db $FE, $17, $06 ; ext command 17: set $0BE2 and $07E1 to $06 TODO
#_08E59D: db $D3, $23 ; go to message 23

;===================================================================================================

; じいさま:
; しょうねんたちよ
; まちのものから はなしはきいておる
; ここも むかしのまちなみを とりもどした
; すべては おまえたちの かつやくのおかげ・・・
; みなを だいひょうして おれいがしたい
; このはこの どれかひとつを おまえたちにやろう
; さあ えらぶがよい
Message_00_0B_23:
#_08E59F: db $D7, $24 ; load scene 24
#_08E5A1: db $D6, $00, $89, $70, $28 ; place sprite 89 in slot 00 at XY:{70,28}
#_08E5A6: db $FE, $70, $25 ; ext command 70: R0FA346, maybe go to message 25 TODO
#_08E5A9: db $FA ; clear message box
#_08E5AA: db $A2, $26, $2F, $43, $9A ; じいさま:
#_08E5AF: db $F9 ; new line
#_08E5B0: db $30, $57, $27, $3C, $52, $34, $35, $4A ; しょうねんたちよ
#_08E5B8: db $F9 ; new line
#_08E5B9: db $43, $35, $3D, $47, $3D, $2A, $4B, $CF ; まちのものから⎵
#_08E5C1: db $3E, $39, $30, $3E, $2B, $26, $37, $29 ; はなしはきいてお
#_08E5C9: db $4D ; る
#_08E5CA: db $FC ; wait for key and new line
#_08E5CB: db $2E, $2E, $47, $CF, $45, $2A, $30, $3D ; ここも⎵むかしの
#_08E5D3: db $43, $35, $39, $44, $51, $CF, $38, $4C ; まちなみを⎵とり
#_08E5DB: db $47, $AA, $30, $34 ; もどした
#_08E5DF: db $F9 ; new line
#_08E5E0: db $31, $AE, $37, $3E, $CF, $29, $43, $28 ; すべては⎵おまえ
#_08E5E8: db $34, $35, $3D, $CF, $2A, $36, $48, $2C ; たちの⎵かつやく
#_08E5F0: db $3D, $29, $2A, $9F, $93, $93, $93 ; のおかげ・・・
#_08E5F7: db $FC ; wait for key and new line
#_08E5F8: db $FA ; clear message box
#_08E5F9: db $44, $39, $51, $CF, $A6, $26, $3F, $57 ; みなを⎵だいひょ
#_08E601: db $27, $30, $37, $CF, $29, $4E, $26, $9C ; うして⎵おれいが
#_08E609: db $30, $34, $26 ; したい
#_08E60C: db $F9 ; new line
#_08E60D: db $2E, $3D, $3E, $2E, $3D, $CF, $AA, $4E ; このはこの⎵どれ
#_08E615: db $2A, $3F, $38, $36, $51, $CF, $29, $43 ; かひとつを⎵おま
#_08E61D: db $28, $34, $35, $3A, $48, $4F, $27 ; えたちにやろう
#_08E624: db $FC ; wait for key and new line
#_08E625: db $D6, $00, $B6, $40, $48 ; place sprite B6 in slot 00 at XY:{40,48}
#_08E62A: db $D6, $02, $B6, $70, $48 ; place sprite B6 in slot 02 at XY:{70,48}
#_08E62F: db $D6, $04, $B6, $A0, $48 ; place sprite B6 in slot 04 at XY:{A0,48}
#_08E634: db $FA ; clear message box
#_08E635: db $2F, $25, $CF, $28, $4B, $AD, $9C, $4A ; さあ⎵えらぶがよ
#_08E63D: db $26 ; い
#_08E63E: db $F9 ; new line
#_08E63F: db $D8, $03 ; option list with 4 options
#_08E641: db $1F, $27 ; option 1 [1F]: go to message 27
#_08E643: db $20, $28 ; option 2 [20]: go to message 28
#_08E645: db $21, $29 ; option 3 [21]: go to message 29
#_08E647: db $1E, $24 ; option 4 [1E]: go to message 24

;===================================================================================================

; そうか いらぬのか
Message_00_0B_24:
#_08E649: db $FA ; clear message box
#_08E64A: db $33, $27, $2A, $CF, $26, $4B, $3B, $3D ; そうか⎵いらぬの
#_08E652: db $2A ; か
#_08E653: db $FC ; wait for key and new line

;===================================================================================================

Message_00_0B_25:
#_08E654: db $FE, $6F ; ext command 6F: Call routine 0FA333 TODO

;===================================================================================================

; じいさま:
; しょうねんたちよ これからも みなのために
; そのちからを つかってくれ
; かつやくを きたいしておるぞ・・・
Message_00_0B_26:
#_08E656: db $D6, $02, $00 ; delete sprite in slot 02
#_08E659: db $D6, $04, $00 ; delete sprite in slot 04
#_08E65C: db $D6, $00, $89, $70, $28 ; place sprite 89 in slot 00 at XY:{70,28}
#_08E661: db $FA ; clear message box
#_08E662: db $A2, $26, $2F, $43, $9A ; じいさま:
#_08E667: db $F9 ; new line
#_08E668: db $30, $57, $27, $3C, $52, $34, $35, $4A ; しょうねんたちよ
#_08E670: db $CF, $2E, $4E, $2A, $4B, $47, $CF, $44 ; ⎵これからも⎵み
#_08E678: db $39, $3D, $34, $46, $3A ; なのために
#_08E67D: db $F9 ; new line
#_08E67E: db $33, $3D, $35, $2A, $4B, $51, $CF, $36 ; そのちからを⎵つ
#_08E686: db $2A, $58, $37, $2C, $4E ; かってくれ
#_08E68B: db $F9 ; new line
#_08E68C: db $2A, $36, $48, $2C, $51, $CF, $2B, $34 ; かつやくを⎵きた
#_08E694: db $26, $30, $37, $29, $4D, $A5, $93, $93 ; いしておるぞ・・
#_08E69C: db $93 ; ・
#_08E69D: db $FC ; wait for key and new line
#_08E69E: db $FF ; end of message

;===================================================================================================

Message_00_0B_27:
#_08E69F: db $FE, $3C, $2B ; ext command 3C: go to message 2B if no space for item
#_08E6A2: db $FE, $6E ; ext command 6E: Call routine 0F8FCF TODO
#_08E6A4: db $D6, $00, $B7, $40, $48 ; place sprite B7 in slot 00 at XY:{40,48}
#_08E6A9: db $D3, $2A ; go to message 2A

;===================================================================================================

Message_00_0B_28:
#_08E6AB: db $FE, $3C, $2B ; ext command 3C: go to message 2B if no space for item
#_08E6AE: db $FE, $6E ; ext command 6E: Call routine 0F8FCF TODO
#_08E6B0: db $D6, $02, $B7, $70, $48 ; place sprite B7 in slot 02 at XY:{70,48}
#_08E6B5: db $D3, $2A ; go to message 2A

;===================================================================================================

Message_00_0B_29:
#_08E6B7: db $FE, $3C, $2B ; ext command 3C: go to message 2B if no space for item
#_08E6BA: db $FE, $6E ; ext command 6E: Call routine 0F8FCF TODO
#_08E6BC: db $D6, $04, $B7, $A0, $48 ; place sprite B7 in slot 04 at XY:{A0,48}
#_08E6C1: db $D3, $2A ; go to message 2A

;===================================================================================================

; [ITEM]が はいっていた
; [CHASE]は
; [ITEM]を てにいれた
Message_00_0B_2A:
#_08E6C3: db $FA ; clear message box
#_08E6C4: db $F3 ; write item name from $0A50
#_08E6C5: db $9C, $CF, $3E, $26, $58, $37, $26, $34 ; が⎵はいっていた
#_08E6CD: db $FC ; wait for key and new line
#_08E6CE: db $F0 ; write player name
#_08E6CF: db $3E ; は
#_08E6D0: db $F9 ; new line
#_08E6D1: db $F3 ; write item name from $0A50
#_08E6D2: db $51, $CF, $37, $3A, $26, $4E, $34 ; を⎵てにいれた
#_08E6D9: db $FC ; wait for key and new line
#_08E6DA: db $FE, $28 ; ext command 28: add item to inventory from $0A50
#_08E6DC: db $D3, $25 ; go to message 25

;===================================================================================================

; アイテムが いっぱいのようだな
Message_00_0B_2B:
#_08E6DE: db $FA ; clear message box
#_08E6DF: db $5D, $5E, $6F, $7D, $9C, $CF, $26, $58 ; アイテムが⎵いっ
#_08E6E7: db $B0, $26, $3D, $4A, $27, $A6, $39 ; ぱいのようだな
#_08E6EE: db $FC ; wait for key and new line
#_08E6EF: db $D3, $26 ; go to message 26

;===================================================================================================

Message_00_0C_00:
#_08E6F1: db $FE, $57 ; ext command 57: Call routine 0F9C77 TODO

;===================================================================================================

; おとこ:
; めざめたか
; われは «エンノオヅノ»
; «・・・»さて あと ふたり ながれついてるようだ
; おぬしも よくしっているものだ
; さがしにいって やるがよい
; くわしいはなしは 3にん そろってからだ
; きずついたとき やすみたいときは
; わたしの つかいま ゼンキ ゴキが せわしよう
; りょうどなりにいる あってゆくがよい
Message_00_0C_01:
#_08E6F3: db $D5, $47 ; send 47 to APU
#_08E6F5: db $D6, $00, $83, $70, $28 ; place sprite 83 in slot 00 at XY:{70,28}
#_08E6FA: db $D0, $2F ; set progress bit 2F
#_08E6FC: db $D1, $FF ; clear progress bit FF
#_08E6FE: db $D2, $30, $02 ; test progress bit 30 for message 02
#_08E701: db $29, $38, $2E, $9A ; おとこ:
#_08E705: db $F9 ; new line
#_08E706: db $46, $A1, $46, $34, $2A ; めざめたか
#_08E70B: db $FC ; wait for key and new line
#_08E70C: db $FA ; clear message box
#_08E70D: db $50, $4E, $3E, $CF ; われは⎵
#_08E711: db $F2, $37 ; prewritten text 37
#_08E713: db $FC ; wait for key and new line
#_08E714: db $FA ; clear message box
#_08E715: db $F2, $0B ; prewritten text 0B
#_08E717: db $2F, $37, $CF, $25, $38, $CF, $40, $34 ; さて⎵あと⎵ふた
#_08E71F: db $4C, $CF, $39, $9C, $4E, $36, $26, $37 ; り⎵ながれついて
#_08E727: db $4D, $4A, $27, $A6 ; るようだ
#_08E72B: db $F9 ; new line
#_08E72C: db $29, $3B, $30, $47, $CF, $4A, $2C, $30 ; おぬしも⎵よくし
#_08E734: db $58, $37, $26, $4D, $47, $3D, $A6 ; っているものだ
#_08E73B: db $F9 ; new line
#_08E73C: db $2F, $9C, $30, $3A, $26, $58, $37, $CF ; さがしにいって⎵
#_08E744: db $48, $4D, $9C, $4A, $26 ; やるがよい
#_08E749: db $F9 ; new line
#_08E74A: db $2C, $50, $30, $26, $3E, $39, $30, $3E ; くわしいはなしは
#_08E752: db $CF, $04, $3A, $52, $CF, $33, $4F, $58 ; ⎵3にん⎵そろっ
#_08E75A: db $37, $2A, $4B, $A6 ; てからだ
#_08E75E: db $FC ; wait for key and new line
#_08E75F: db $FA ; clear message box
#_08E760: db $2B, $A3, $36, $26, $34, $38, $2B, $CF ; きずついたとき⎵
#_08E768: db $48, $31, $44, $34, $26, $38, $2B, $3E ; やすみたいときは
#_08E770: db $F9 ; new line
#_08E771: db $50, $34, $30, $3D, $CF, $36, $2A, $26 ; わたしの⎵つかい
#_08E779: db $43, $CF, $BD, $8A, $63, $CF, $B9, $63 ; ま⎵ゼンキ⎵ゴキ
#_08E781: db $9C, $CF, $32, $50, $30, $4A, $27 ; が⎵せわしよう
#_08E788: db $F9 ; new line
#_08E789: db $4C, $57, $27, $AA, $39, $4C, $3A, $26 ; りょうどなりにい
#_08E791: db $4D, $CF, $25, $58, $37, $49, $2C, $9C ; る⎵あってゆくが
#_08E799: db $4A, $26 ; よい
#_08E79B: db $FC ; wait for key and new line
#_08E79C: db $D0, $30 ; set progress bit 30
#_08E79E: db $FE, $1A, $47, $88, $19, $00, $02, $0C ; ext command 1A: 47,88,19,00,02,0C
#_08E7A6: db $FF ; end of message

;===================================================================================================

; «エンノオヅノ»:
Message_00_0C_02:
#_08E7A7: db $E1, $B9 ; set $0A50 to item B9
#_08E7A9: db $F2, $37 ; prewritten text 37
#_08E7AB: db $9A ; :
#_08E7AC: db $F9 ; new line
#_08E7AD: db $D2, $39, $13 ; test progress bit 39 for message 13
#_08E7B0: db $D2, $F1, $12 ; test progress bit F1 for message 12
#_08E7B3: db $D2, $23, $04 ; test progress bit 23 for message 04
#_08E7B6: db $D2, $24, $10 ; test progress bit 24 for message 10
#_08E7B9: db $D2, $4A, $0F ; test progress bit 4A for message 0F
#_08E7BC: db $D2, $38, $0C ; test progress bit 38 for message 0C
#_08E7BF: db $D2, $34, $0A ; test progress bit 34 for message 0A
#_08E7C2: db $D2, $33, $07 ; test progress bit 33 for message 07
#_08E7C5: db $D2, $31, $05 ; test progress bit 31 for message 05

;===================================================================================================

; まだ 3にん そろっとらんな
Message_00_0C_03:
#_08E7C8: db $43, $A6, $CF, $04, $3A, $52, $CF, $33 ; まだ⎵3にん⎵そ
#_08E7D0: db $4F, $58, $38, $4B, $52, $39 ; ろっとらんな
#_08E7D6: db $FC ; wait for key and new line
#_08E7D7: db $FF ; end of message

;===================================================================================================

Message_00_0C_04:
#_08E7D8: db $D2, $24, $11 ; test progress bit 24 for message 11
#_08E7DB: db $D3, $10 ; go to message 10

;===================================================================================================

Message_00_0C_05:
#_08E7DD: db $D2, $32, $06 ; test progress bit 32 for message 06
#_08E7E0: db $D3, $03 ; go to message 03

;===================================================================================================

; どうやら 3にん そろったようだな
; ここは «コンゴウシンカイ»
; おぬしからみれば マカイというところか
; さて おぬしらがいた せかいは
; すっかり あれはててしまった
; [JIMMY]:
; いったい なにが あったんですか?
; ちじょうは どうなったんですか?
; «エンノオヅノ»:
; しんぱいすることはない
; まだ ニンゲンは ほろびておらん
; [HIM]:
; だったら おれたちを もどしてくれよ!
; «エンノオヅノ»:
; もどっても よいことは ないぞ
; あれはてた ちじょうは
; マカイより ひどいところかも しれんぞ
; [JIMMY]:
; それなら よけい もどらなければ
; アクマを たおして へいわなせかいを
; とりもどしましょう!
; «エンノオヅノ»:
Message_00_0C_06:
#_08E7E2: db $E9, $0C, $09 ; go to message 09 maybe TODO
#_08E7E5: db $AA, $27, $48, $4B, $CF, $04, $3A, $52 ; どうやら⎵3にん
#_08E7ED: db $CF, $33, $4F, $58, $34, $4A, $27, $A6 ; ⎵そろったようだ
#_08E7F5: db $39 ; な
#_08E7F6: db $FC ; wait for key and new line
#_08E7F7: db $FA ; clear message box
#_08E7F8: db $2E, $2E, $3E, $CF ; ここは⎵
#_08E7FC: db $F2, $36 ; prewritten text 36
#_08E7FE: db $F9 ; new line
#_08E7FF: db $29, $3B, $30, $2A, $4B, $44, $4E, $AB ; おぬしからみれば
#_08E807: db $CF, $7B, $62, $5E, $38, $26, $27, $38 ; ⎵マカイというと
#_08E80F: db $2E, $4F, $2A ; ころか
#_08E812: db $FC ; wait for key and new line
#_08E813: db $FA ; clear message box
#_08E814: db $2F, $37, $CF, $29, $3B, $30, $4B, $9C ; さて⎵おぬしらが
#_08E81C: db $26, $34, $CF, $32, $2A, $26, $3E ; いた⎵せかいは
#_08E823: db $F9 ; new line
#_08E824: db $31, $58, $2A, $4C, $CF, $25, $4E, $3E ; すっかり⎵あれは
#_08E82C: db $37, $37, $30, $43, $58, $34 ; ててしまった
#_08E832: db $FC ; wait for key and new line
#_08E833: db $FA ; clear message box
#_08E834: db $EE ; write lawful hero name
#_08E835: db $9A ; :
#_08E836: db $F9 ; new line
#_08E837: db $26, $58, $34, $26, $CF, $39, $3A, $9C ; いったい⎵なにが
#_08E83F: db $CF, $25, $58, $34, $52, $A9, $31, $2A ; ⎵あったんですか
#_08E847: db $95 ; ?
#_08E848: db $DF ; delay 7 frames
#_08E849: db $F9 ; new line
#_08E84A: db $35, $A2, $57, $27, $3E, $CF, $AA, $27 ; ちじょうは⎵どう
#_08E852: db $39, $58, $34, $52, $A9, $31, $2A, $95 ; なったんですか?
#_08E85A: db $FC ; wait for key and new line
#_08E85B: db $FA ; clear message box
#_08E85C: db $F2, $37 ; prewritten text 37
#_08E85E: db $9A ; :
#_08E85F: db $F9 ; new line
#_08E860: db $30, $52, $B0, $26, $31, $4D, $2E, $38 ; しんぱいすること
#_08E868: db $3E, $39, $26 ; はない
#_08E86B: db $FC ; wait for key and new line
#_08E86C: db $43, $A6, $CF, $72, $8A, $B8, $8A, $3E ; まだ⎵ニンゲンは
#_08E874: db $CF, $42, $4F, $AC, $37, $29, $4B, $52 ; ⎵ほろびておらん
#_08E87C: db $FC ; wait for key and new line
#_08E87D: db $FA ; clear message box
#_08E87E: db $EF ; write chaos hero name
#_08E87F: db $9A ; :
#_08E880: db $F9 ; new line
#_08E881: db $A6, $58, $34, $4B, $CF, $29, $4E, $34 ; だったら⎵おれた
#_08E889: db $35, $51, $CF, $47, $AA, $30, $37, $2C ; ちを⎵もどしてく
#_08E891: db $4E, $4A, $94 ; れよ!
#_08E894: db $FC ; wait for key and new line
#_08E895: db $FA ; clear message box
#_08E896: db $F2, $37 ; prewritten text 37
#_08E898: db $9A ; :
#_08E899: db $F9 ; new line
#_08E89A: db $47, $AA, $58, $37, $47, $CF, $4A, $26 ; もどっても⎵よい
#_08E8A2: db $2E, $38, $3E, $CF, $39, $26, $A5 ; ことは⎵ないぞ
#_08E8A9: db $F9 ; new line
#_08E8AA: db $25, $4E, $3E, $37, $34, $CF, $35, $A2 ; あれはてた⎵ちじ
#_08E8B2: db $57, $27, $3E ; ょうは
#_08E8B5: db $F9 ; new line
#_08E8B6: db $7B, $62, $5E, $4A, $4C, $CF, $3F, $AA ; マカイより⎵ひど
#_08E8BE: db $26, $38, $2E, $4F, $2A, $47, $CF, $30 ; いところかも⎵し
#_08E8C6: db $4E, $52, $A5 ; れんぞ
#_08E8C9: db $FC ; wait for key and new line
#_08E8CA: db $FA ; clear message box
#_08E8CB: db $EE ; write lawful hero name
#_08E8CC: db $9A ; :
#_08E8CD: db $F9 ; new line
#_08E8CE: db $33, $4E, $39, $4B, $CF, $4A, $2D, $26 ; それなら⎵よけい
#_08E8D6: db $CF, $47, $AA, $4B, $39, $2D, $4E, $AB ; ⎵もどらなければ
#_08E8DE: db $F9 ; new line
#_08E8DF: db $5D, $64, $7B, $51, $CF, $34, $29, $30 ; アクマを⎵たおし
#_08E8E7: db $37, $CF, $41, $26, $50, $39, $32, $2A ; て⎵へいわなせか
#_08E8EF: db $26, $51 ; いを
#_08E8F1: db $F9 ; new line
#_08E8F2: db $38, $4C, $47, $AA, $30, $43, $30, $57 ; とりもどしましょ
#_08E8FA: db $27, $94 ; う!
#_08E8FC: db $FC ; wait for key and new line
#_08E8FD: db $FA ; clear message box
#_08E8FE: db $D0, $33 ; set progress bit 33
#_08E900: db $F2, $37 ; prewritten text 37
#_08E902: db $9A ; :
#_08E903: db $F9 ; new line

;===================================================================================================

; もとのせかいに もどりたいなら
; わたしのたのみ きいてくれるか?
; おぬしらのちからでは ここからでられんぞ
Message_00_0C_07:
#_08E904: db $47, $38, $3D, $32, $2A, $26, $3A, $CF ; もとのせかいに⎵
#_08E90C: db $47, $AA, $4C, $34, $26, $39, $4B ; もどりたいなら
#_08E913: db $F9 ; new line
#_08E914: db $50, $34, $30, $3D, $34, $3D, $44, $CF ; わたしのたのみ⎵
#_08E91C: db $2B, $26, $37, $2C, $4E, $4D, $2A, $95 ; きいてくれるか?
#_08E924: db $F8, $08 ; YES/NO - go to message 08 if YES
#_08E926: db $D4, $03 ; set text box size to 3
#_08E928: db $29, $3B, $30, $4B, $3D, $35, $2A, $4B ; おぬしらのちから
#_08E930: db $A9, $3E, $CF, $2E, $2E, $2A, $4B, $A9 ; では⎵ここからで
#_08E938: db $4B, $4E, $52, $A5 ; られんぞ
#_08E93C: db $FC ; wait for key and new line
#_08E93D: db $FF ; end of message

;===================================================================================================

; «コンゴウシンカイ»のおくに いずみがある
; そこから わきでている [ITEM]を
; とってきてくれ
; いまをのがすと しばらく まつことになる
; ミナミの とびらを あけておいた
; たのんだぞ
Message_00_0C_08:
#_08E93E: db $D4, $03 ; set text box size to 3
#_08E940: db $F2, $36 ; prewritten text 36
#_08E942: db $3D, $29, $2C, $3A, $CF, $26, $A3, $44 ; のおくに⎵いずみ
#_08E94A: db $9C, $25, $4D ; がある
#_08E94D: db $F9 ; new line
#_08E94E: db $33, $2E, $2A, $4B, $CF, $50, $2B, $A9 ; そこから⎵わきで
#_08E956: db $37, $26, $4D, $CF ; ている⎵
#_08E95A: db $F3 ; write item name from $0A50
#_08E95B: db $51 ; を
#_08E95C: db $F9 ; new line
#_08E95D: db $38, $58, $37, $2B, $37, $2C, $4E ; とってきてくれ
#_08E964: db $FC ; wait for key and new line
#_08E965: db $FA ; clear message box
#_08E966: db $26, $43, $51, $3D, $9C, $31, $38, $CF ; いまをのがすと⎵
#_08E96E: db $30, $AB, $4B, $2C, $CF, $43, $36, $2E ; しばらく⎵まつこ
#_08E976: db $38, $3A, $39, $4D ; とになる
#_08E97A: db $F9 ; new line
#_08E97B: db $7C, $71, $7C, $3D, $CF, $38, $AC, $4B ; ミナミの⎵とびら
#_08E983: db $51, $CF, $25, $2D, $37, $29, $26, $34 ; を⎵あけておいた
#_08E98B: db $F9 ; new line
#_08E98C: db $34, $3D, $52, $A6, $A5 ; たのんだぞ
#_08E991: db $FC ; wait for key and new line
#_08E992: db $D0, $34 ; set progress bit 34
#_08E994: db $FF ; end of message

;===================================================================================================

; ひどい じょうたいだな
; はやく ゴキに てあてしてもらってこい
Message_00_0C_09:
#_08E995: db $3F, $AA, $26, $CF, $A2, $57, $27, $34 ; ひどい⎵じょうた
#_08E99D: db $26, $A6, $39 ; いだな
#_08E9A0: db $F9 ; new line
#_08E9A1: db $3E, $48, $2C, $CF, $B9, $63, $3A, $CF ; はやく⎵ゴキに⎵
#_08E9A9: db $37, $25, $37, $30, $37, $47, $4B, $58 ; てあてしてもらっ
#_08E9B1: db $37, $2E, $26 ; てこい
#_08E9B4: db $FC ; wait for key and new line
#_08E9B5: db $FF ; end of message

;===================================================================================================

; おお とってきたか すまんな
; >[LEADER]は
; [ITEM]を わたした
; «エンノオヅノ»は [ITEM]を のみほした
; «エンノオヅノ»:
; «・・・»うーん まだ たりん
; もういちど とってくれ たのんだぞ
Message_00_0C_0A:
#_08E9B6: db $DD, $B9, $14 ; go to message 14 if missing item B9
#_08E9B9: db $29, $29, $CF, $38, $58, $37, $2B, $34 ; おお⎵とってきた
#_08E9C1: db $2A, $CF, $31, $43, $52, $39 ; か⎵すまんな
#_08E9C7: db $FC ; wait for key and new line
#_08E9C8: db $D2, $35, $0B ; test progress bit 35 for message 0B
#_08E9CB: db $FA ; clear message box
#_08E9CC: db $97 ; >
#_08E9CD: db $F1 ; write leader's name for team
#_08E9CE: db $3E ; は
#_08E9CF: db $F9 ; new line
#_08E9D0: db $F3 ; write item name from $0A50
#_08E9D1: db $51, $CF, $50, $34, $30, $34 ; を⎵わたした
#_08E9D7: db $FC ; wait for key and new line
#_08E9D8: db $FA ; clear message box
#_08E9D9: db $F2, $37 ; prewritten text 37
#_08E9DB: db $3E, $CF ; は⎵
#_08E9DD: db $F3 ; write item name from $0A50
#_08E9DE: db $51, $CF, $3D, $44, $42, $30, $34 ; を⎵のみほした
#_08E9E5: db $FC ; wait for key and new line
#_08E9E6: db $FE, $29 ; ext command 29: take item from $0A51 TODO
#_08E9E8: db $FA ; clear message box
#_08E9E9: db $F2, $37 ; prewritten text 37
#_08E9EB: db $9A ; :
#_08E9EC: db $F9 ; new line
#_08E9ED: db $F2, $0B ; prewritten text 0B
#_08E9EF: db $27, $5A, $52, $CF, $43, $A6, $CF, $34 ; うーん⎵まだ⎵た
#_08E9F7: db $4C, $52 ; りん
#_08E9F9: db $F9 ; new line
#_08E9FA: db $47, $27, $26, $35, $AA, $CF, $38, $58 ; もういちど⎵とっ
#_08EA02: db $37, $2C, $4E, $CF, $34, $3D, $52, $A6 ; てくれ⎵たのんだ
#_08EA0A: db $A5 ; ぞ
#_08EA0B: db $FC ; wait for key and new line
#_08EA0C: db $D0, $35 ; set progress bit 35
#_08EA0E: db $FF ; end of message

;===================================================================================================

; ごくろうだった [ITEM]は もういい
; それは おぬしらに やろう
Message_00_0C_0B:
#_08EA0F: db $FA ; clear message box
#_08EA10: db $A0, $2C, $4F, $27, $A6, $58, $34, $CF ; ごくろうだった⎵
#_08EA18: db $F3 ; write item name from $0A50
#_08EA19: db $3E, $CF, $47, $27, $26, $26 ; は⎵もういい
#_08EA1F: db $F9 ; new line
#_08EA20: db $33, $4E, $3E, $CF, $29, $3B, $30, $4B ; それは⎵おぬしら
#_08EA28: db $3A, $CF, $48, $4F, $27 ; に⎵やろう
#_08EA2D: db $FC ; wait for key and new line
#_08EA2E: db $D0, $38 ; set progress bit 38
#_08EA30: db $FA ; clear message box

;===================================================================================================

; ところで この«コンゴウシンカイ»に
; ふたりの かいじんが すみついておる
; かれらは いいぶきを もっているらしい
; それを うけとってこい よいな?
; せっかく おしえて やったのに«・・・»
Message_00_0C_0C:
#_08EA31: db $E9, $0C, $0E ; go to message 0E maybe TODO
#_08EA34: db $38, $2E, $4F, $A9, $CF, $2E, $3D ; ところで⎵この
#_08EA3B: db $F2, $36 ; prewritten text 36
#_08EA3D: db $3A ; に
#_08EA3E: db $F9 ; new line
#_08EA3F: db $40, $34, $4C, $3D, $CF, $2A, $26, $A2 ; ふたりの⎵かいじ
#_08EA47: db $52, $9C, $CF, $31, $44, $36, $26, $37 ; んが⎵すみついて
#_08EA4F: db $29, $4D ; おる
#_08EA51: db $F9 ; new line
#_08EA52: db $2A, $4E, $4B, $3E, $CF, $26, $26, $AD ; かれらは⎵いいぶ
#_08EA5A: db $2B, $51, $CF, $47, $58, $37, $26, $4D ; きを⎵もっている
#_08EA62: db $4B, $30, $26 ; らしい
#_08EA65: db $FC ; wait for key and new line
#_08EA66: db $FA ; clear message box
#_08EA67: db $33, $4E, $51, $CF, $27, $2D, $38, $58 ; それを⎵うけとっ
#_08EA6F: db $37, $2E, $26, $CF, $4A, $26, $39, $95 ; てこい⎵よいな?
#_08EA77: db $F8, $0D ; YES/NO - go to message 0D if YES
#_08EA79: db $D4, $03 ; set text box size to 3
#_08EA7B: db $32, $58, $2A, $2C, $CF, $29, $30, $28 ; せっかく⎵おしえ
#_08EA83: db $37, $CF, $48, $58, $34, $3D, $3A ; て⎵やったのに
#_08EA8A: db $F2, $0B ; prewritten text 0B
#_08EA8C: db $FC ; wait for key and new line
#_08EA8D: db $FF ; end of message

;===================================================================================================

; キタの とびらを あけておいた
; いくのは [CHASE]だけだ
; [JIMMY]と [HIM]には
; ほかに やることが ある
Message_00_0C_0D:
#_08EA8E: db $D4, $03 ; set text box size to 3
#_08EA90: db $63, $6C, $3D, $CF, $38, $AC, $4B, $51 ; キタの⎵とびらを
#_08EA98: db $CF, $25, $2D, $37, $29, $26, $34 ; ⎵あけておいた
#_08EA9F: db $F9 ; new line
#_08EAA0: db $26, $2C, $3D, $3E, $CF ; いくのは⎵
#_08EAA5: db $F0 ; write player name
#_08EAA6: db $A6, $2D, $A6 ; だけだ
#_08EAA9: db $FC ; wait for key and new line
#_08EAAA: db $FA ; clear message box
#_08EAAB: db $EE ; write lawful hero name
#_08EAAC: db $38, $CF ; と⎵
#_08EAAE: db $EF ; write chaos hero name
#_08EAAF: db $3A, $3E ; には
#_08EAB1: db $F9 ; new line
#_08EAB2: db $42, $2A, $3A, $CF, $48, $4D, $2E, $38 ; ほかに⎵やること
#_08EABA: db $9C, $CF, $25, $4D ; が⎵ある
#_08EABE: db $FC ; wait for key and new line
#_08EABF: db $D0, $4A ; set progress bit 4A
#_08EAC1: db $FE, $27, $02 ; ext command 27: something 02 TODO
#_08EAC4: db $FE, $27, $03 ; ext command 27: something 03 TODO
#_08EAC7: db $FF ; end of message

;===================================================================================================

; これは ひどいな
; すぐ ゴキに てあてしてもらえ
Message_00_0C_0E:
#_08EAC8: db $2E, $4E, $3E, $CF, $3F, $AA, $26, $39 ; これは⎵ひどいな
#_08EAD0: db $F9 ; new line
#_08EAD1: db $31, $9E, $CF, $B9, $63, $3A, $CF, $37 ; すぐ⎵ゴキに⎵て
#_08EAD9: db $25, $37, $30, $37, $47, $4B, $28 ; あてしてもらえ
#_08EAE0: db $FC ; wait for key and new line
#_08EAE1: db $FF ; end of message

;===================================================================================================

; なにを ぐずぐずしておる
; [JIMMY]も [HIM]も
; それぞれの もくひょうに むかったぞ
; はやく いってこい
Message_00_0C_0F:
#_08EAE2: db $39, $3A, $51, $CF, $9E, $A3, $9E, $A3 ; なにを⎵ぐずぐず
#_08EAEA: db $30, $37, $29, $4D ; しておる
#_08EAEE: db $F9 ; new line
#_08EAEF: db $EE ; write lawful hero name
#_08EAF0: db $47, $CF ; も⎵
#_08EAF2: db $EF ; write chaos hero name
#_08EAF3: db $47 ; も
#_08EAF4: db $F9 ; new line
#_08EAF5: db $33, $4E, $A5, $4E, $3D, $CF, $47, $2C ; それぞれの⎵もく
#_08EAFD: db $3F, $57, $27, $3A, $CF, $45, $2A, $58 ; ひょうに⎵むかっ
#_08EB05: db $34, $A5 ; たぞ
#_08EB07: db $F9 ; new line
#_08EB08: db $3E, $48, $2C, $CF, $26, $58, $37, $2E ; はやく⎵いってこ
#_08EB10: db $26 ; い
#_08EB11: db $FC ; wait for key and new line
#_08EB12: db $FF ; end of message

;===================================================================================================

; まだ かたほうにしか いっとらんな
Message_00_0C_10:
#_08EB13: db $43, $A6, $CF, $2A, $34, $42, $27, $3A ; まだ⎵かたほうに
#_08EB1B: db $30, $2A, $CF, $26, $58, $38, $4B, $52 ; しか⎵いっとらん
#_08EB23: db $39 ; な
#_08EB24: db $FC ; wait for key and new line
#_08EB25: db $FF ; end of message

;===================================================================================================

; かえってきたな [CHASE]よ
; [JIMMY]:
; ぶじで なによりです
; [HIM]:
; おそかったじゃねえか
; «エンノオヅノ»:
Message_00_0C_11:
#_08EB26: db $2A, $28, $58, $37, $2B, $34, $39, $CF ; かえってきたな⎵
#_08EB2E: db $F0 ; write player name
#_08EB2F: db $4A ; よ
#_08EB30: db $FC ; wait for key and new line
#_08EB31: db $FA ; clear message box
#_08EB32: db $D6, $00, $00 ; delete sprite in slot 00
#_08EB35: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08EB38: db $D6, $00, $2E, $70, $28 ; place sprite 2E in slot 00 at XY:{70,28}
#_08EB3D: db $EE ; write lawful hero name
#_08EB3E: db $9A ; :
#_08EB3F: db $F9 ; new line
#_08EB40: db $AD, $A2, $A9, $CF, $39, $3A, $4A, $4C ; ぶじで⎵なにより
#_08EB48: db $A9, $31 ; です
#_08EB4A: db $FC ; wait for key and new line
#_08EB4B: db $FA ; clear message box
#_08EB4C: db $D6, $00, $00 ; delete sprite in slot 00
#_08EB4F: db $FE, $26, $02 ; ext command 26: something 02 TODO
#_08EB52: db $DE, $01, $00, $35, $01 ; load 1x demon 0135
#_08EB57: db $E4, $00 ; load demon $00
#_08EB59: db $EF ; write chaos hero name
#_08EB5A: db $9A ; :
#_08EB5B: db $F9 ; new line
#_08EB5C: db $29, $33, $2A, $58, $34, $A2, $55, $3C ; おそかったじゃね
#_08EB64: db $28, $2A ; えか
#_08EB66: db $FC ; wait for key and new line
#_08EB67: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08EB69: db $FA ; clear message box
#_08EB6A: db $FE, $26, $03 ; ext command 26: something 03 TODO
#_08EB6D: db $FE, $07, $3C ; ext command 07: draw buffered text then wait 59 frames
#_08EB70: db $D6, $00, $83, $70, $28 ; place sprite 83 in slot 00 at XY:{70,28}
#_08EB75: db $F2, $37 ; prewritten text 37
#_08EB77: db $9A ; :
#_08EB78: db $F9 ; new line

;===================================================================================================

; ごくろうだったな
; [CHASE]には これを やろう
; >[CHASE]は [ITEM]を
; «てにいれた»
; «エンノオヅノ»:
; そろそろ おぬしらを もとのせかいに
; もどしてやるときが きたようだ
Message_00_0C_12:
#_08EB79: db $A0, $2C, $4F, $27, $A6, $58, $34, $39 ; ごくろうだったな
#_08EB81: db $F9 ; new line
#_08EB82: db $D0, $F1 ; set progress bit F1
#_08EB84: db $E1, $10 ; set $0A50 to item 10
#_08EB86: db $FE, $28 ; ext command 28: add item to inventory from $0A50
#_08EB88: db $F0 ; write player name
#_08EB89: db $3A, $3E, $CF, $2E, $4E, $51, $CF, $48 ; には⎵これを⎵や
#_08EB91: db $4F, $27 ; ろう
#_08EB93: db $FC ; wait for key and new line
#_08EB94: db $FA ; clear message box
#_08EB95: db $FE, $3C, $15 ; ext command 3C: go to message 15 if no space for item
#_08EB98: db $97 ; >
#_08EB99: db $F0 ; write player name
#_08EB9A: db $3E, $CF ; は⎵
#_08EB9C: db $F3 ; write item name from $0A50
#_08EB9D: db $51 ; を
#_08EB9E: db $F9 ; new line
#_08EB9F: db $F2, $2D ; prewritten text 2D
#_08EBA1: db $FC ; wait for key and new line
#_08EBA2: db $FA ; clear message box
#_08EBA3: db $F2, $37 ; prewritten text 37
#_08EBA5: db $9A ; :
#_08EBA6: db $F9 ; new line
#_08EBA7: db $33, $4F, $33, $4F, $CF, $29, $3B, $30 ; そろそろ⎵おぬし
#_08EBAF: db $4B, $51, $CF, $47, $38, $3D, $32, $2A ; らを⎵もとのせか
#_08EBB7: db $26, $3A ; いに
#_08EBB9: db $F9 ; new line
#_08EBBA: db $47, $AA, $30, $37, $48, $4D, $38, $2B ; もどしてやるとき
#_08EBC2: db $9C, $CF, $2B, $34, $4A, $27, $A6 ; が⎵きたようだ
#_08EBC9: db $FC ; wait for key and new line
#_08EBCA: db $FA ; clear message box

;===================================================================================================

; ヒガシのとびらを あけておいた
; いつでも とおってゆくがよい
Message_00_0C_13:
#_08EBCB: db $77, $B5, $68, $3D, $38, $AC, $4B, $51 ; ヒガシのとびらを
#_08EBD3: db $CF, $25, $2D, $37, $29, $26, $34 ; ⎵あけておいた
#_08EBDA: db $F9 ; new line
#_08EBDB: db $26, $36, $A9, $47, $CF, $38, $29, $58 ; いつでも⎵とおっ
#_08EBE3: db $37, $49, $2C, $9C, $4A, $26 ; てゆくがよい
#_08EBE9: db $FC ; wait for key and new line
#_08EBEA: db $D0, $39 ; set progress bit 39
#_08EBEC: db $FF ; end of message

;===================================================================================================

; なんだ とってきとらんのか
Message_00_0C_14:
#_08EBED: db $39, $52, $A6, $CF, $38, $58, $37, $2B ; なんだ⎵とってき
#_08EBF5: db $38, $4B, $52, $3D, $2A ; とらんのか
#_08EBFA: db $FC ; wait for key and new line
#_08EBFB: db $FF ; end of message

;===================================================================================================

; «・・・»と おもったが もちものが いっぱいだな
; «では もちものを へらしてこい»
Message_00_0C_15:
#_08EBFC: db $F2, $0B ; prewritten text 0B
#_08EBFE: db $38, $CF, $29, $47, $58, $34, $9C, $CF ; と⎵おもったが⎵
#_08EC06: db $47, $35, $47, $3D, $9C, $CF, $26, $58 ; もちものが⎵いっ
#_08EC0E: db $B0, $26, $A6, $39 ; ぱいだな
#_08EC12: db $F9 ; new line
#_08EC13: db $F2, $79 ; prewritten text 79
#_08EC15: db $FC ; wait for key and new line
#_08EC16: db $FF ; end of message

;===================================================================================================

; [DEMON1]:
; «エンノオヅノ»さまより «おまえたち»の
; こうどうのきろくを おおせつかっているぞ
Message_00_0C_16:
#_08EC17: db $D5, $47 ; send 47 to APU
#_08EC19: db $DE, $01, $00, $21, $01 ; load 1x demon 0121
#_08EC1E: db $E4, $00 ; load demon $00
#_08EC20: db $F5 ; write demon name from $050A
#_08EC21: db $9A ; :
#_08EC22: db $F9 ; new line
#_08EC23: db $D2, $3A, $1B ; test progress bit 3A for message 1B
#_08EC26: db $F2, $37 ; prewritten text 37
#_08EC28: db $2F, $43, $4A, $4C, $CF ; さまより⎵
#_08EC2D: db $F2, $04 ; prewritten text 04
#_08EC2F: db $3D ; の
#_08EC30: db $F9 ; new line
#_08EC31: db $2E, $27, $AA, $27, $3D, $2B, $4F, $2C ; こうどうのきろく
#_08EC39: db $51, $CF, $29, $29, $32, $36, $2A, $58 ; を⎵おおせつかっ
#_08EC41: db $37, $26, $4D, $A5 ; ているぞ
#_08EC45: db $FC ; wait for key and new line

;===================================================================================================

; こうどうを きろくするのか?
; きろくしないのか
Message_00_0C_17:
#_08EC46: db $FA ; clear message box
#_08EC47: db $2E, $27, $AA, $27, $51, $CF, $2B, $4F ; こうどうを⎵きろ
#_08EC4F: db $2C, $31, $4D, $3D, $2A, $95 ; くするのか?
#_08EC55: db $F8, $18 ; YES/NO - go to message 18 if YES
#_08EC57: db $D4, $03 ; set text box size to 3
#_08EC59: db $2B, $4F, $2C, $30, $39, $26, $3D, $2A ; きろくしないのか
#_08EC61: db $FC ; wait for key and new line
#_08EC62: db $D3, $1A ; go to message 1A

;===================================================================================================

; きろくしたぞ
; では つづけるのか?
Message_00_0C_18:
#_08EC64: db $FE, $42 ; ext command 42: go to file select
#_08EC66: db $D5, $47 ; send 47 to APU
#_08EC68: db $E4, $00 ; load demon $00
#_08EC6A: db $FE, $22, $1A ; ext command 22: go to message 1A if $0A58 flags failure
#_08EC6D: db $FA ; clear message box
#_08EC6E: db $2B, $4F, $2C, $30, $34, $A5 ; きろくしたぞ
#_08EC74: db $FC ; wait for key and new line
#_08EC75: db $A9, $3E, $CF, $36, $A8, $2D, $4D, $3D ; では⎵つづけるの
#_08EC7D: db $2A, $95 ; か?
#_08EC7F: db $F8, $1A ; YES/NO - go to message 1A if YES

;===================================================================================================

; «はやく・・・でんげんを・きって・・・くれ・・・»
Message_00_0C_19:
#_08EC81: db $D4, $03 ; set text box size to 3
#_08EC83: db $F2, $5D ; prewritten text 5D

;===================================================================================================

; まあ どうするかは «おまえたち»のかってだ
Message_00_0C_1A:
#_08EC85: db $D4, $03 ; set text box size to 3
#_08EC87: db $43, $25, $CF, $AA, $27, $31, $4D, $2A ; まあ⎵どうするか
#_08EC8F: db $3E, $CF ; は⎵
#_08EC91: db $F2, $04 ; prewritten text 04
#_08EC93: db $3D, $2A, $58, $37, $A6 ; のかってだ
#_08EC98: db $FC ; wait for key and new line
#_08EC99: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08EC9B: db $FF ; end of message

;===================================================================================================

; おれたちに かてなければ
; もとのせかいへは かえれないぞ
Message_00_0C_1B:
#_08EC9C: db $29, $4E, $34, $35, $3A, $CF, $2A, $37 ; おれたちに⎵かて
#_08ECA4: db $39, $2D, $4E, $AB ; なければ
#_08ECA8: db $F9 ; new line
#_08ECA9: db $47, $38, $3D, $32, $2A, $26, $41, $3E ; もとのせかいへは
#_08ECB1: db $CF, $2A, $28, $4E, $39, $26, $A5 ; ⎵かえれないぞ
#_08ECB8: db $FC ; wait for key and new line
#_08ECB9: db $D3, $17 ; go to message 17

;===================================================================================================

; [DEMON1]:
; «エンノオヅノ»さまより «おまえたち»の
; かいふくと ちりょうを おおせつかっているぞ
Message_00_0C_1C:
#_08ECBB: db $D5, $47 ; send 47 to APU
#_08ECBD: db $DE, $01, $00, $22, $01 ; load 1x demon 0122
#_08ECC2: db $E4, $00 ; load demon $00
#_08ECC4: db $F5 ; write demon name from $050A
#_08ECC5: db $9A ; :
#_08ECC6: db $F9 ; new line
#_08ECC7: db $D2, $3A, $1E ; test progress bit 3A for message 1E
#_08ECCA: db $F2, $37 ; prewritten text 37
#_08ECCC: db $2F, $43, $4A, $4C, $CF ; さまより⎵
#_08ECD1: db $F2, $04 ; prewritten text 04
#_08ECD3: db $3D ; の
#_08ECD4: db $F9 ; new line
#_08ECD5: db $2A, $26, $40, $2C, $38, $CF, $35, $4C ; かいふくと⎵ちり
#_08ECDD: db $57, $27, $51, $CF, $29, $29, $32, $36 ; ょうを⎵おおせつ
#_08ECE5: db $2A, $58, $37, $26, $4D, $A5 ; かっているぞ
#_08ECEB: db $FC ; wait for key and new line

;===================================================================================================

; せいぜい がんばってくれや
Message_00_0C_1D:
#_08ECEC: db $FE, $25, $FE ; ext command 25: something FE TODO
#_08ECEF: db $FE, $23, $FE ; ext command 23: something FE TODO
#_08ECF2: db $FE, $24, $FE ; ext command 24: something FE TODO
#_08ECF5: db $FA ; clear message box
#_08ECF6: db $32, $26, $A4, $26, $CF, $9C, $52, $AB ; せいぜい⎵がんば
#_08ECFE: db $58, $37, $2C, $4E, $48 ; ってくれや
#_08ED03: db $FC ; wait for key and new line
#_08ED04: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08ED06: db $FF ; end of message

;===================================================================================================

; べつに «おまえたち»が にくくて
; たたかってるわけじゃないんだ
Message_00_0C_1E:
#_08ED07: db $AE, $36, $3A, $CF ; べつに⎵
#_08ED0B: db $F2, $04 ; prewritten text 04
#_08ED0D: db $9C, $CF, $3A, $2C, $2C, $37 ; が⎵にくくて
#_08ED13: db $F9 ; new line
#_08ED14: db $34, $34, $2A, $58, $37, $4D, $50, $2D ; たたかってるわけ
#_08ED1C: db $A2, $55, $39, $26, $52, $A6 ; じゃないんだ
#_08ED22: db $FC ; wait for key and new line
#_08ED23: db $D3, $1D ; go to message 1D

;===================================================================================================

; [JIMMY]:
; «・・・»«・・・»«・・・»
; だれだ!
; «・・・»[CHASE]くん!
; ここへ きていたんですか
; ここは いったい«・・・»
; ぼくは [MOMO]を さがしているときに
; きゅうに しろいひかりに つつまれて«・・・»
; きが ついたら ここに いたんです
; とにかく ここから でなければ いけませんね
; >[JIMMY]が «ナカマに くわわった»
Message_00_0C_1F:
#_08ED25: db $D2, $31, $20 ; test progress bit 31 for message 20
#_08ED28: db $D5, $45 ; send 45 to APU
#_08ED2A: db $D6, $00, $2B, $70, $48 ; place sprite 2B in slot 00 at XY:{70,48}
#_08ED2F: db $EE ; write lawful hero name
#_08ED30: db $9A ; :
#_08ED31: db $F9 ; new line
#_08ED32: db $F2, $0B ; prewritten text 0B
#_08ED34: db $F2, $0B ; prewritten text 0B
#_08ED36: db $F2, $0B ; prewritten text 0B
#_08ED38: db $FC ; wait for key and new line
#_08ED39: db $A6, $4E, $A6, $94 ; だれだ!
#_08ED3D: db $DF, $DF, $DF ; delay 7 frames [x3]
#_08ED40: db $FC ; wait for key and new line
#_08ED41: db $D6, $00, $2E, $70, $28 ; place sprite 2E in slot 00 at XY:{70,28}
#_08ED46: db $F2, $0B ; prewritten text 0B
#_08ED48: db $F0 ; write player name
#_08ED49: db $2C, $52, $94 ; くん!
#_08ED4C: db $DF ; delay 7 frames
#_08ED4D: db $F9 ; new line
#_08ED4E: db $2E, $2E, $41, $CF, $2B, $37, $26, $34 ; ここへ⎵きていた
#_08ED56: db $52, $A9, $31, $2A ; んですか
#_08ED5A: db $FC ; wait for key and new line
#_08ED5B: db $FA ; clear message box
#_08ED5C: db $2E, $2E, $3E, $CF, $26, $58, $34, $26 ; ここは⎵いったい
#_08ED64: db $F2, $0B ; prewritten text 0B
#_08ED66: db $F9 ; new line
#_08ED67: db $AF, $2C, $3E, $CF ; ぼくは⎵
#_08ED6B: db $ED ; write female protag name
#_08ED6C: db $51, $CF, $2F, $9C, $30, $37, $26, $4D ; を⎵さがしている
#_08ED74: db $38, $2B, $3A ; ときに
#_08ED77: db $F9 ; new line
#_08ED78: db $2B, $56, $27, $3A, $CF, $30, $4F, $26 ; きゅうに⎵しろい
#_08ED80: db $3F, $2A, $4C, $3A, $CF, $36, $36, $43 ; ひかりに⎵つつま
#_08ED88: db $4E, $37 ; れて
#_08ED8A: db $F2, $0B ; prewritten text 0B
#_08ED8C: db $F9 ; new line
#_08ED8D: db $2B, $9C, $CF, $36, $26, $34, $4B, $CF ; きが⎵ついたら⎵
#_08ED95: db $2E, $2E, $3A, $CF, $26, $34, $52, $A9 ; ここに⎵いたんで
#_08ED9D: db $31 ; す
#_08ED9E: db $F9 ; new line
#_08ED9F: db $38, $3A, $2A, $2C, $CF, $2E, $2E, $2A ; とにかく⎵ここか
#_08EDA7: db $4B, $CF, $A9, $39, $2D, $4E, $AB, $CF ; ら⎵でなければ⎵
#_08EDAF: db $26, $2D, $43, $32, $52, $3C ; いけませんね
#_08EDB5: db $FC ; wait for key and new line
#_08EDB6: db $D4, $03 ; set text box size to 3
#_08EDB8: db $97 ; >
#_08EDB9: db $EE ; write lawful hero name
#_08EDBA: db $9C, $CF ; が⎵
#_08EDBC: db $F2, $2F ; prewritten text 2F
#_08EDBE: db $FC ; wait for key and new line
#_08EDBF: db $FE, $26, $02 ; ext command 26: something 02 TODO
#_08EDC2: db $D0, $31 ; set progress bit 31
#_08EDC4: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
Message_00_0C_20:
#_08EDC5: db $97 ; >
#_08EDC6: db $F2, $2C ; prewritten text 2C
#_08EDC8: db $FC ; wait for key and new line
#_08EDC9: db $FF ; end of message

;===================================================================================================

; [HIM]:
; «・・・»た たすけてくれ
; だれか たすけてくれ
; [CHASE]か!? たすかったぜ
; オザワのやつも とりにがしちまったし
; こんなところに ふっとばされて
; ちくしょう ひどいめにあったぜ
; とにかく ここのアクマは
; おれひとりじゃ きついんだ
; また ついてかせてもらうぜ
; >[HIM]が «ナカマに くわわった»
Message_00_0C_21:
#_08EDCA: db $D2, $32, $22 ; test progress bit 32 for message 22
#_08EDCD: db $D5, $46 ; send 46 to APU
#_08EDCF: db $D6, $00, $2A, $70, $48 ; place sprite 2A in slot 00 at XY:{70,48}
#_08EDD4: db $EF ; write chaos hero name
#_08EDD5: db $9A ; :
#_08EDD6: db $F9 ; new line
#_08EDD7: db $F2, $0B ; prewritten text 0B
#_08EDD9: db $34, $CF, $34, $31, $2D, $37, $2C, $4E ; た⎵たすけてくれ
#_08EDE1: db $F9 ; new line
#_08EDE2: db $A6, $4E, $2A, $CF, $34, $31, $2D, $37 ; だれか⎵たすけて
#_08EDEA: db $2C, $4E ; くれ
#_08EDEC: db $FC ; wait for key and new line
#_08EDED: db $FA ; clear message box
#_08EDEE: db $F0 ; write player name
#_08EDEF: db $2A, $94, $95 ; か!?
#_08EDF2: db $DF ; delay 7 frames
#_08EDF3: db $CF, $34, $31, $2A, $58, $34, $A4 ; ⎵たすかったぜ
#_08EDFA: db $FC ; wait for key and new line
#_08EDFB: db $D6, $00, $00 ; delete sprite in slot 00
#_08EDFE: db $DE, $01, $00, $35, $01 ; load 1x demon 0135
#_08EE03: db $E4, $00 ; load demon $00
#_08EE05: db $61, $BA, $88, $3D, $48, $36, $47, $CF ; オザワのやつも⎵
#_08EE0D: db $38, $4C, $3A, $9C, $30, $35, $43, $58 ; とりにがしちまっ
#_08EE15: db $34, $30 ; たし
#_08EE17: db $F9 ; new line
#_08EE18: db $2E, $52, $39, $38, $2E, $4F, $3A, $CF ; こんなところに⎵
#_08EE20: db $40, $58, $38, $AB, $2F, $4E, $37 ; ふっとばされて
#_08EE27: db $F9 ; new line
#_08EE28: db $35, $2C, $30, $57, $27, $CF, $3F, $AA ; ちくしょう⎵ひど
#_08EE30: db $26, $46, $3A, $25, $58, $34, $A4 ; いめにあったぜ
#_08EE37: db $FC ; wait for key and new line
#_08EE38: db $FA ; clear message box
#_08EE39: db $38, $3A, $2A, $2C, $CF, $2E, $2E, $3D ; とにかく⎵ここの
#_08EE41: db $5D, $64, $7B, $3E ; アクマは
#_08EE45: db $F9 ; new line
#_08EE46: db $29, $4E, $3F, $38, $4C, $A2, $55, $CF ; おれひとりじゃ⎵
#_08EE4E: db $2B, $36, $26, $52, $A6 ; きついんだ
#_08EE53: db $F9 ; new line
#_08EE54: db $43, $34, $CF, $36, $26, $37, $2A, $32 ; また⎵ついてかせ
#_08EE5C: db $37, $47, $4B, $27, $A4 ; てもらうぜ
#_08EE61: db $FC ; wait for key and new line
#_08EE62: db $D4, $03 ; set text box size to 3
#_08EE64: db $97 ; >
#_08EE65: db $EF ; write chaos hero name
#_08EE66: db $9C, $CF ; が⎵
#_08EE68: db $F2, $2F ; prewritten text 2F
#_08EE6A: db $FC ; wait for key and new line
#_08EE6B: db $FE, $26, $03 ; ext command 26: something 03 TODO
#_08EE6E: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08EE70: db $D0, $32 ; set progress bit 32
#_08EE72: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
Message_00_0C_22:
#_08EE73: db $97 ; >
#_08EE74: db $F2, $2C ; prewritten text 2C
#_08EE76: db $FC ; wait for key and new line
#_08EE77: db $FF ; end of message

;===================================================================================================

; >[ITEM]のいずみ
Message_00_0C_23:
#_08EE78: db $D7, $12 ; load scene 12
#_08EE7A: db $D5, $47 ; send 47 to APU
#_08EE7C: db $E1, $B9 ; set $0A50 to item B9
#_08EE7E: db $97 ; >
#_08EE7F: db $F3 ; write item name from $0A50
#_08EE80: db $3D, $26, $A3, $44 ; のいずみ
#_08EE84: db $FC ; wait for key and new line
#_08EE85: db $D2, $34, $24 ; test progress bit 34 for message 24
#_08EE88: db $D3, $25 ; go to message 25

;===================================================================================================

Message_00_0C_24:
#_08EE8A: db $DD, $B9, $26 ; go to message 26 if missing item B9

;===================================================================================================

; [ITEM]は まだ わきでていない
Message_00_0C_25:
#_08EE8D: db $FA ; clear message box
#_08EE8E: db $F3 ; write item name from $0A50
#_08EE8F: db $3E, $CF, $43, $A6, $CF, $50, $2B, $A9 ; は⎵まだ⎵わきで
#_08EE97: db $37, $26, $39, $26 ; ていない
#_08EE9B: db $FC ; wait for key and new line
#_08EE9C: db $FF ; end of message

;===================================================================================================

; [ITEM]が わきでている
; くみますか?
Message_00_0C_26:
#_08EE9D: db $FA ; clear message box
#_08EE9E: db $F3 ; write item name from $0A50
#_08EE9F: db $9C, $CF, $50, $2B, $A9, $37, $26, $4D ; が⎵わきでている
#_08EEA7: db $F9 ; new line
#_08EEA8: db $2C, $44, $43, $31, $2A, $95 ; くみますか?
#_08EEAE: db $F8, $27 ; YES/NO - go to message 27 if YES
#_08EEB0: db $FF ; end of message

;===================================================================================================

; [LEADER]は [ITEM]を
; «てにいれた»
Message_00_0C_27:
#_08EEB1: db $D4, $03 ; set text box size to 3
#_08EEB3: db $F1 ; write leader's name for team
#_08EEB4: db $3E, $CF ; は⎵
#_08EEB6: db $F3 ; write item name from $0A50
#_08EEB7: db $51 ; を
#_08EEB8: db $F9 ; new line
#_08EEB9: db $FE, $3C, $28 ; ext command 3C: go to message 28 if no space for item
#_08EEBC: db $F2, $2D ; prewritten text 2D
#_08EEBE: db $FC ; wait for key and new line
#_08EEBF: db $FE, $28 ; ext command 28: add item to inventory from $0A50
#_08EEC1: db $FF ; end of message

;===================================================================================================

; «みつけたが もちきれなかった»
Message_00_0C_28:
#_08EEC2: db $F2, $72 ; prewritten text 72
#_08EEC4: db $FC ; wait for key and new line
#_08EEC5: db $FF ; end of message

;===================================================================================================

; >«とびらは とざされている»
Message_00_0C_29:
#_08EEC6: db $D2, $39, $2A ; test progress bit 39 for message 2A
#_08EEC9: db $D6, $00, $6F, $60, $28 ; place sprite 6F in slot 00 at XY:{60,28}
#_08EECE: db $97 ; >
#_08EECF: db $F2, $69 ; prewritten text 69
#_08EED1: db $FC ; wait for key and new line
#_08EED2: db $FF ; end of message

;===================================================================================================

; [DEMON1]:
; ごくろうだったな ここをとおれば
; もとのせかいへもどれる«・・・»
; [DEMON2]:
; «・・・»だが おれたちに かてねば
; ここは とおさん!
Message_00_0C_2A:
#_08EED3: db $DE, $01, $00, $21, $01 ; load 1x demon 0121
#_08EED8: db $EB, $01, $00, $22, $01 ; load 1x demon 0122
#_08EEDD: db $E4, $00 ; load demon $00
#_08EEDF: db $E4, $01 ; load demon $01
#_08EEE1: db $D0, $3A ; set progress bit 3A
#_08EEE3: db $F5 ; write demon name from $050A
#_08EEE4: db $9A ; :
#_08EEE5: db $F9 ; new line
#_08EEE6: db $A0, $2C, $4F, $27, $A6, $58, $34, $39 ; ごくろうだったな
#_08EEEE: db $CF, $2E, $2E, $51, $38, $29, $4E, $AB ; ⎵ここをとおれば
#_08EEF6: db $F9 ; new line
#_08EEF7: db $47, $38, $3D, $32, $2A, $26, $41, $47 ; もとのせかいへも
#_08EEFF: db $AA, $4E, $4D ; どれる
#_08EF02: db $F2, $0B ; prewritten text 0B
#_08EF04: db $FC ; wait for key and new line
#_08EF05: db $FA ; clear message box
#_08EF06: db $E8 ; write demon name from $050C
#_08EF07: db $9A ; :
#_08EF08: db $F9 ; new line
#_08EF09: db $F2, $0B ; prewritten text 0B
#_08EF0B: db $A6, $9C, $CF, $29, $4E, $34, $35, $3A ; だが⎵おれたちに
#_08EF13: db $CF, $2A, $37, $3C, $AB ; ⎵かてねば
#_08EF18: db $F9 ; new line
#_08EF19: db $2E, $2E, $3E, $CF, $38, $29, $2F, $52 ; ここは⎵とおさん
#_08EF21: db $94 ; !
#_08EF22: db $FC ; wait for key and new line
#_08EF23: db $D5, $39 ; send 39 to APU
#_08EF25: db $E5, $81, $2C ; [COMMAND E5:81,2C]

;===================================================================================================

Message_00_0C_2B:
#_08EF28: db $E5, $80, $2C ; [COMMAND E5:80,2C]
#_08EF2B: db $D3, $2B ; go to message 2B

;===================================================================================================

Message_00_0C_2C:
#_08EF2D: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08EF2F: db $E7, $01 ; call routine 01E5CD with value 02 TODO
#_08EF31: db $FA ; clear message box
#_08EF32: db $D6, $00, $6F, $60, $28 ; place sprite 6F in slot 00 at XY:{60,28}
#_08EF37: db $FE, $07, $78 ; ext command 07: draw buffered text then wait 119 frames
#_08EF3A: db $D6, $00, $78, $60, $28 ; place sprite 78 in slot 00 at XY:{60,28}
#_08EF3F: db $FE, $07, $03 ; ext command 07: draw buffered text then wait 2 frames
#_08EF42: db $D6, $00, $00 ; delete sprite in slot 00
#_08EF45: db $FE, $1A, $4F, $87, $19, $00, $00, $00 ; ext command 1A: 4F,87,19,00,00,00
#_08EF4D: db $FE, $37 ; ext command 37: reload dungeon view

;===================================================================================================

; «エンノオヅノ»:
; ゼンキとゴキに かったか«・・・»
; もうよいだろう もとのせかいへ もどれ
; «・・・»せかいが どうかわりはてていようと
; おどろくでないぞ«・・・»
Message_00_0C_2D:
#_08EF4F: db $D5, $47 ; send 47 to APU
#_08EF51: db $D6, $02, $83, $70, $28 ; place sprite 83 in slot 02 at XY:{70,28}
#_08EF56: db $FE, $2D, $03 ; ext command 2D: call routine 00B99C with value 03 TODO
#_08EF59: db $F2, $37 ; prewritten text 37
#_08EF5B: db $9A ; :
#_08EF5C: db $F9 ; new line
#_08EF5D: db $BD, $8A, $63, $38, $B9, $63, $3A, $CF ; ゼンキとゴキに⎵
#_08EF65: db $2A, $58, $34, $2A ; かったか
#_08EF69: db $F2, $0B ; prewritten text 0B
#_08EF6B: db $F9 ; new line
#_08EF6C: db $47, $27, $4A, $26, $A6, $4F, $27, $CF ; もうよいだろう⎵
#_08EF74: db $47, $38, $3D, $32, $2A, $26, $41, $CF ; もとのせかいへ⎵
#_08EF7C: db $47, $AA, $4E ; もどれ
#_08EF7F: db $F9 ; new line
#_08EF80: db $F2, $0B ; prewritten text 0B
#_08EF82: db $32, $2A, $26, $9C, $CF, $AA, $27, $2A ; せかいが⎵どうか
#_08EF8A: db $50, $4C, $3E, $37, $37, $26, $4A, $27 ; わりはてていよう
#_08EF92: db $38 ; と
#_08EF93: db $F9 ; new line
#_08EF94: db $29, $AA, $4F, $2C, $A9, $39, $26, $A5 ; おどろくでないぞ
#_08EF9C: db $F2, $0B ; prewritten text 0B
#_08EF9E: db $FC ; wait for key and new line
#_08EF9F: db $FE, $25, $FF ; ext command 25: something FF TODO
#_08EFA2: db $FE, $23, $FF ; ext command 23: something FF TODO
#_08EFA5: db $FE, $24, $FF ; ext command 24: something FF TODO
#_08EFA8: db $D6, $02, $00 ; delete sprite in slot 02
#_08EFAB: db $D1, $34 ; clear progress bit 34
#_08EFAD: db $D1, $35 ; clear progress bit 35
#_08EFAF: db $D1, $36 ; clear progress bit 36
#_08EFB1: db $D1, $37 ; clear progress bit 37
#_08EFB3: db $D1, $38 ; clear progress bit 38
#_08EFB5: db $D1, $0C ; clear progress bit 0C
#_08EFB7: db $D1, $0B ; clear progress bit 0B
#_08EFB9: db $D0, $FF ; set progress bit FF
#_08EFBB: db $FE, $07, $7F ; ext command 07: draw buffered text then wait 126 frames
#_08EFBE: db $FE, $1B, $96, $35, $00, $00, $06, $0F ; ext command 1B: 96,35,00,00,06,0F
#_08EFC6: db $FF ; end of message

;===================================================================================================

; «>ナカマだった [DEMON1]が いる»
Message_00_0C_2E:
#_08EFC7: db $D2, $3B, $46 ; test progress bit 3B for message 46
#_08EFCA: db $FE, $41, $00, $30 ; ext command 41: 00 30 TODO
#_08EFCE: db $F2, $3A ; prewritten text 3A
#_08EFD0: db $D2, $EB, $2F ; test progress bit EB for message 2F
#_08EFD3: db $D0, $3B ; set progress bit 3B

;===================================================================================================

Message_00_0C_2F:
#_08EFD5: db $FF ; end of message

;===================================================================================================

; «>なにか おちている»
; «10mag を てにいれた»
Message_00_0C_30:
#_08EFD6: db $F2, $39 ; prewritten text 39
#_08EFD8: db $D0, $3B ; set progress bit 3B
#_08EFDA: db $FF ; end of message

;===================================================================================================

; «>ナカマだった [DEMON1]が いる»
Message_00_0C_31:
#_08EFDB: db $D2, $3C, $46 ; test progress bit 3C for message 46
#_08EFDE: db $FE, $41, $01, $33 ; ext command 41: 01 33 TODO
#_08EFE2: db $F2, $3A ; prewritten text 3A
#_08EFE4: db $D2, $EB, $32 ; test progress bit EB for message 32
#_08EFE7: db $D0, $3C ; set progress bit 3C

;===================================================================================================

Message_00_0C_32:
#_08EFE9: db $FF ; end of message

;===================================================================================================

; «>なにか おちている»
; «10mag を てにいれた»
Message_00_0C_33:
#_08EFEA: db $F2, $39 ; prewritten text 39
#_08EFEC: db $D0, $3C ; set progress bit 3C
#_08EFEE: db $FF ; end of message

;===================================================================================================

; «>ナカマだった [DEMON1]が いる»
Message_00_0C_34:
#_08EFEF: db $D2, $3D, $46 ; test progress bit 3D for message 46
#_08EFF2: db $FE, $41, $02, $36 ; ext command 41: 02 36 TODO
#_08EFF6: db $F2, $3A ; prewritten text 3A
#_08EFF8: db $D2, $EB, $35 ; test progress bit EB for message 35
#_08EFFB: db $D0, $3D ; set progress bit 3D

;===================================================================================================

Message_00_0C_35:
#_08EFFD: db $FF ; end of message

;===================================================================================================

; «>なにか おちている»
; «10mag を てにいれた»
Message_00_0C_36:
#_08EFFE: db $F2, $39 ; prewritten text 39
#_08F000: db $D0, $3D ; set progress bit 3D
#_08F002: db $FF ; end of message

;===================================================================================================

; «>ナカマだった [DEMON1]が いる»
Message_00_0C_37:
#_08F003: db $D2, $3E, $46 ; test progress bit 3E for message 46
#_08F006: db $FE, $41, $03, $39 ; ext command 41: 03 39 TODO
#_08F00A: db $F2, $3A ; prewritten text 3A
#_08F00C: db $D2, $EB, $38 ; test progress bit EB for message 38
#_08F00F: db $D0, $3E ; set progress bit 3E

;===================================================================================================

Message_00_0C_38:
#_08F011: db $FF ; end of message

;===================================================================================================

; «>なにか おちている»
; «10mag を てにいれた»
Message_00_0C_39:
#_08F012: db $F2, $39 ; prewritten text 39
#_08F014: db $D0, $3E ; set progress bit 3E
#_08F016: db $FF ; end of message

;===================================================================================================

; ね«>ナカマだった [DEMON1]が いる»
Message_00_0C_3A:
#_08F017: db $D2, $3F, $46 ; test progress bit 3F for message 46
#_08F01A: db $FE, $41, $04, $3C ; ext command 41: 04 3C TODO
#_08F01E: db $F2, $3A ; prewritten text 3A
#_08F020: db $D2, $EB, $3B ; test progress bit EB for message 3B
#_08F023: db $D0, $3F ; set progress bit 3F

;===================================================================================================

Message_00_0C_3B:
#_08F025: db $FF ; end of message

;===================================================================================================

; «>なにか おちている»
; «10mag を てにいれた»
Message_00_0C_3C:
#_08F026: db $F2, $39 ; prewritten text 39
#_08F028: db $D0, $3F ; set progress bit 3F
#_08F02A: db $FF ; end of message

;===================================================================================================

; «>ナカマだった [DEMON1]が いる»
Message_00_0C_3D:
#_08F02B: db $D2, $40, $46 ; test progress bit 40 for message 46
#_08F02E: db $FE, $41, $05, $3F ; ext command 41: 05 3F TODO
#_08F032: db $F2, $3A ; prewritten text 3A
#_08F034: db $D2, $EB, $3E ; test progress bit EB for message 3E
#_08F037: db $D0, $40 ; set progress bit 40

;===================================================================================================

Message_00_0C_3E:
#_08F039: db $FF ; end of message

;===================================================================================================

; «>なにか おちている»
; «10mag を てにいれた»
Message_00_0C_3F:
#_08F03A: db $F2, $39 ; prewritten text 39
#_08F03C: db $D0, $40 ; set progress bit 40
#_08F03E: db $FF ; end of message

;===================================================================================================

; «>ナカマだった [DEMON1]が いる»
Message_00_0C_40:
#_08F03F: db $D2, $41, $46 ; test progress bit 41 for message 46
#_08F042: db $FE, $41, $06, $42 ; ext command 41: 06 42 TODO
#_08F046: db $F2, $3A ; prewritten text 3A
#_08F048: db $D2, $EB, $41 ; test progress bit EB for message 41
#_08F04B: db $D0, $41 ; set progress bit 41

;===================================================================================================

Message_00_0C_41:
#_08F04D: db $FF ; end of message

;===================================================================================================

; «>なにか おちている»
; «10mag を てにいれた»
Message_00_0C_42:
#_08F04E: db $F2, $39 ; prewritten text 39
#_08F050: db $D0, $41 ; set progress bit 41
#_08F052: db $FF ; end of message

;===================================================================================================

; «>ナカマだった [DEMON1]が いる»
Message_00_0C_43:
#_08F053: db $D2, $42, $46 ; test progress bit 42 for message 46
#_08F056: db $FE, $41, $07, $45 ; ext command 41: 07 TODO
#_08F05A: db $F2, $3A ; prewritten text 3A
#_08F05C: db $D2, $EB, $44 ; test progress bit EB for message 44
#_08F05F: db $D0, $42 ; set progress bit 42

;===================================================================================================

Message_00_0C_44:
#_08F061: db $FF ; end of message

;===================================================================================================

; «>なにか おちている»
; «10mag を てにいれた»
Message_00_0C_45:
#_08F062: db $F2, $39 ; prewritten text 39
#_08F064: db $D0, $42 ; set progress bit 42
#_08F066: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
Message_00_0C_46:
#_08F067: db $97 ; >
#_08F068: db $F2, $2C ; prewritten text 2C
#_08F06A: db $FC ; wait for key and new line
#_08F06B: db $FF ; end of message

;===================================================================================================

; «エンノオヅノ»:
; みちは じぶんできりひらくしかない
; なにが ただしく ただしくないか
; きめるのは じぶんのいしだ
; そして ぞくせいは いしにしたがう
Message_00_0C_47:
#_08F06C: db $D6, $00, $83, $70, $28 ; place sprite 83 in slot 00 at XY:{70,28}
#_08F071: db $FE, $45, $00, $01 ; ext command 45: something 00, 01 TODO
#_08F075: db $F2, $37 ; prewritten text 37
#_08F077: db $9A ; :
#_08F078: db $F9 ; new line
#_08F079: db $44, $35, $3E, $CF, $A2, $AD, $52, $A9 ; みちは⎵じぶんで
#_08F081: db $2B, $4C, $3F, $4B, $2C, $30, $2A, $39 ; きりひらくしかな
#_08F089: db $26 ; い
#_08F08A: db $F9 ; new line
#_08F08B: db $39, $3A, $9C, $CF, $34, $A6, $30, $2C ; なにが⎵ただしく
#_08F093: db $CF, $34, $A6, $30, $2C, $39, $26, $2A ; ⎵ただしくないか
#_08F09B: db $F9 ; new line
#_08F09C: db $2B, $46, $4D, $3D, $3E, $CF, $A2, $AD ; きめるのは⎵じぶ
#_08F0A4: db $52, $3D, $26, $30, $A6 ; んのいしだ
#_08F0A9: db $FC ; wait for key and new line
#_08F0AA: db $33, $30, $37, $CF, $A5, $2C, $32, $26 ; そして⎵ぞくせい
#_08F0B2: db $3E, $CF, $26, $30, $3A, $30, $34, $9C ; は⎵いしにしたが
#_08F0BA: db $27 ; う
#_08F0BB: db $FC ; wait for key and new line
#_08F0BC: db $D6, $00, $00 ; delete sprite in slot 00
#_08F0BF: db $FF ; end of message

;===================================================================================================

; «エンノオヅノ»:
; アクマを ころして へいきなの?
; と きかれたら なんと こたえる?
; ころしたアクマに きをつけろ
Message_00_0C_48:
#_08F0C0: db $D6, $00, $83, $70, $28 ; place sprite 83 in slot 00 at XY:{70,28}
#_08F0C5: db $FE, $45, $00, $01 ; ext command 45: something 00, 01 TODO
#_08F0C9: db $F2, $37 ; prewritten text 37
#_08F0CB: db $9A ; :
#_08F0CC: db $F9 ; new line
#_08F0CD: db $5D, $64, $7B, $51, $CF, $2E, $4F, $30 ; アクマを⎵ころし
#_08F0D5: db $37, $CF, $41, $26, $2B, $39, $3D, $95 ; て⎵へいきなの?
#_08F0DD: db $F9 ; new line
#_08F0DE: db $38, $CF, $2B, $2A, $4E, $34, $4B, $CF ; と⎵きかれたら⎵
#_08F0E6: db $39, $52, $38, $CF, $2E, $34, $28, $4D ; なんと⎵こたえる
#_08F0EE: db $95 ; ?
#_08F0EF: db $FC ; wait for key and new line
#_08F0F0: db $2E, $4F, $30, $34, $5D, $64, $7B, $3A ; ころしたアクマに
#_08F0F8: db $CF, $2B, $51, $36, $2D, $4F ; ⎵きをつけろ
#_08F0FE: db $FC ; wait for key and new line
#_08F0FF: db $D6, $00, $00 ; delete sprite in slot 00
#_08F102: db $FF ; end of message

;===================================================================================================

; «エンノオヅノ»:
; アクマを つかいしものよ
; みずからのいしで アクマをあやつっていても
; ぞくせいは アクマのえいきょうを うける
Message_00_0C_49:
#_08F103: db $D6, $00, $83, $70, $28 ; place sprite 83 in slot 00 at XY:{70,28}
#_08F108: db $FE, $45, $00, $01 ; ext command 45: something 00, 01 TODO
#_08F10C: db $F2, $37 ; prewritten text 37
#_08F10E: db $9A ; :
#_08F10F: db $F9 ; new line
#_08F110: db $5D, $64, $7B, $51, $CF, $36, $2A, $26 ; アクマを⎵つかい
#_08F118: db $30, $47, $3D, $4A ; しものよ
#_08F11C: db $F9 ; new line
#_08F11D: db $44, $A3, $2A, $4B, $3D, $26, $30, $A9 ; みずからのいしで
#_08F125: db $CF, $5D, $64, $7B, $51, $25, $48, $36 ; ⎵アクマをあやつ
#_08F12D: db $58, $37, $26, $37, $47 ; っていても
#_08F132: db $F9 ; new line
#_08F133: db $A5, $2C, $32, $26, $3E, $CF, $5D, $64 ; ぞくせいは⎵アク
#_08F13B: db $7B, $3D, $28, $26, $2B, $57, $27, $51 ; マのえいきょうを
#_08F143: db $CF, $27, $2D, $4D ; ⎵うける
#_08F147: db $FC ; wait for key and new line
#_08F148: db $D6, $00, $00 ; delete sprite in slot 00
#_08F14B: db $FF ; end of message

;===================================================================================================

; [MOMO]:
Message_00_0C_4A:
#_08F14C: db $D6, $00, $4B, $78, $28 ; place sprite 4B in slot 00 at XY:{78,28}
#_08F151: db $FE, $45, $00, $01 ; ext command 45: something 00, 01 TODO
#_08F155: db $ED ; write female protag name
#_08F156: db $9A ; :
#_08F157: db $F9 ; new line
#_08F158: db $FE, $1D, $E8, $02 ; ext command 1D: load classy message 02E8

;===================================================================================================

; おんな:
Message_00_0C_4B:
#_08F15C: db $D6, $00, $49, $78, $28 ; place sprite 49 in slot 00 at XY:{78,28}
#_08F161: db $FE, $45, $00, $01 ; ext command 45: something 00, 01 TODO
#_08F165: db $29, $52, $39, $9A ; おんな:
#_08F169: db $F9 ; new line
#_08F16A: db $FE, $1D, $02, $03 ; ext command 1D: load classy message 0302

;===================================================================================================

; おとこ:
Message_00_0C_4C:
#_08F16E: db $D6, $00, $65, $70, $28 ; place sprite 65 in slot 00 at XY:{70,28}
#_08F173: db $FE, $45, $00, $01 ; ext command 45: something 00, 01 TODO
#_08F177: db $29, $38, $2E, $9A ; おとこ:
#_08F17B: db $F9 ; new line
#_08F17C: db $FE, $1D, $04, $03 ; ext command 1D: load classy message 0304

;===================================================================================================

Message_00_0C_4D:
#_08F180: db $D6, $00, $4D, $78, $28 ; place sprite 4D in slot 00 at XY:{78,28}
#_08F185: db $FE, $45, $00, $01 ; ext command 45: something 00, 01 TODO
#_08F189: db $FE, $1D, $E3, $02 ; ext command 1D: load classy message 02E3

;===================================================================================================

Message_00_0C_4E:
#_08F18D: db $D6, $00, $4C, $78, $28 ; place sprite 4C in slot 00 at XY:{78,28}
#_08F192: db $FE, $45, $00, $01 ; ext command 45: something 00, 01 TODO
#_08F196: db $D3, $74 ; go to message 74

;===================================================================================================

Message_00_0C_4F:
#_08F198: db $FF ; end of message

;===================================================================================================

; >«なかに はいりますか?»
Message_00_0C_50:
#_08F199: db $D6, $00, $6F, $60, $28 ; place sprite 6F in slot 00 at XY:{60,28}
#_08F19E: db $97 ; >
#_08F19F: db $F2, $68 ; prewritten text 68
#_08F1A1: db $F8, $51 ; YES/NO - go to message 51 if YES
#_08F1A3: db $FF ; end of message

;===================================================================================================

Message_00_0C_51:
#_08F1A4: db $D6, $00, $78, $60, $28 ; place sprite 78 in slot 00 at XY:{60,28}
#_08F1A9: db $FE, $07, $03 ; ext command 07: draw buffered text then wait 2 frames
#_08F1AC: db $D6, $00, $00 ; delete sprite in slot 00
#_08F1AF: db $FE, $1A, $41, $CB, $19, $00, $00, $00 ; ext command 1A: 41,CB,19,00,00,00
#_08F1B7: db $FE, $37 ; ext command 37: reload dungeon view

;===================================================================================================

Message_00_0C_52:
#_08F1B9: db $D5, $45 ; send 45 to APU
#_08F1BB: db $D2, $6B, $53 ; test progress bit 6B for message 53
#_08F1BE: db $D3, $54 ; go to message 54

;===================================================================================================

Message_00_0C_53:
#_08F1C0: db $D2, $23, $5C ; test progress bit 23 for message 5C
#_08F1C3: db $D3, $59 ; go to message 59

;===================================================================================================

; [DEMON1]:
; あなたは なにものだ?
; どうやら あなたは
Message_00_0C_54:
#_08F1C5: db $DE, $01, $00, $05, $01 ; load 1x demon 0105
#_08F1CA: db $E4, $00 ; load demon $00
#_08F1CC: db $F5 ; write demon name from $050A
#_08F1CD: db $9A ; :
#_08F1CE: db $F9 ; new line
#_08F1CF: db $25, $39, $34, $3E, $CF, $39, $3A, $47 ; あなたは⎵なにも
#_08F1D7: db $3D, $A6, $95 ; のだ?
#_08F1DA: db $FC ; wait for key and new line
#_08F1DB: db $FA ; clear message box
#_08F1DC: db $AA, $27, $48, $4B, $CF, $25, $39, $34 ; どうやら⎵あなた
#_08F1E4: db $3E ; は
#_08F1E5: db $F9 ; new line
#_08F1E6: db $FE, $04, $58, $55 ; ext command 04: message 58 if alignment >= 112; 55 if >= 144

;===================================================================================================

; わたしと ことなる ぞくせい
; いかしては おけない!
Message_00_0C_55:
#_08F1EA: db $50, $34, $30, $38, $CF, $2E, $38, $39 ; わたしと⎵ことな
#_08F1F2: db $4D, $CF, $A5, $2C, $32, $26 ; る⎵ぞくせい
#_08F1F8: db $F9 ; new line
#_08F1F9: db $26, $2A, $30, $37, $3E, $CF, $29, $2D ; いかしては⎵おけ
#_08F201: db $39, $26, $94 ; ない!
#_08F204: db $FC ; wait for key and new line
#_08F205: db $E5, $01, $57 ; [COMMAND E5:01,57]

;===================================================================================================

Message_00_0C_56:
#_08F208: db $E5, $00, $57 ; [COMMAND E5:00,57]
#_08F20B: db $D3, $56 ; go to message 56

;===================================================================================================

Message_00_0C_57:
#_08F20D: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08F20F: db $FA ; clear message box
#_08F210: db $D3, $59 ; go to message 59

;===================================================================================================

; わたしと おなじ ぞくせい
; ともに ちつじょ ただしきみちを すすみましょう
; あなたには これを さしあげます
Message_00_0C_58:
#_08F212: db $50, $34, $30, $38, $CF, $29, $39, $A2 ; わたしと⎵おなじ
#_08F21A: db $CF, $A5, $2C, $32, $26 ; ⎵ぞくせい
#_08F21F: db $F9 ; new line
#_08F220: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08F222: db $D6, $00, $9D, $78, $30 ; place sprite 9D in slot 00 at XY:{78,30}
#_08F227: db $FE, $07, $13 ; ext command 07: draw buffered text then wait 18 frames
#_08F22A: db $D6, $00, $00 ; delete sprite in slot 00
#_08F22D: db $DE, $01, $00, $1B, $01 ; load 1x demon 011B
#_08F232: db $E4, $00 ; load demon $00
#_08F234: db $38, $47, $3A, $CF, $35, $36, $A2, $57 ; ともに⎵ちつじょ
#_08F23C: db $CF, $34, $A6, $30, $2B, $44, $35, $51 ; ⎵ただしきみちを
#_08F244: db $CF, $31, $31, $44, $43, $30, $57, $27 ; ⎵すすみましょう
#_08F24C: db $F9 ; new line
#_08F24D: db $25, $39, $34, $3A, $3E, $CF, $2E, $4E ; あなたには⎵これ
#_08F255: db $51, $CF, $2F, $30, $25, $9F, $43, $31 ; を⎵さしあげます
#_08F25D: db $FC ; wait for key and new line
#_08F25E: db $FA ; clear message box

;===================================================================================================

; >[CHASE]は [ITEM]を
; «てにいれた»
Message_00_0C_59:
#_08F25F: db $E1, $11 ; set $0A50 to item 11
#_08F261: db $97 ; >
#_08F262: db $F0 ; write player name
#_08F263: db $3E, $CF ; は⎵
#_08F265: db $F3 ; write item name from $0A50
#_08F266: db $51 ; を
#_08F267: db $F9 ; new line
#_08F268: db $FE, $3C, $5A ; ext command 3C: go to message 5A if no space for item
#_08F26B: db $F2, $2D ; prewritten text 2D
#_08F26D: db $FC ; wait for key and new line
#_08F26E: db $FE, $28 ; ext command 28: add item to inventory from $0A50
#_08F270: db $D0, $23 ; set progress bit 23
#_08F272: db $D3, $5B ; go to message 5B

;===================================================================================================

; «みつけたが もちきれなかった»
Message_00_0C_5A:
#_08F274: db $F2, $72 ; prewritten text 72
#_08F276: db $FC ; wait for key and new line

;===================================================================================================

Message_00_0C_5B:
#_08F277: db $D0, $6B ; set progress bit 6B
#_08F279: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08F27B: db $FE, $1A, $42, $4B, $19, $00, $00, $00 ; ext command 1A: 42,4B,19,00,00,00
#_08F283: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
Message_00_0C_5C:
#_08F284: db $97 ; >
#_08F285: db $F2, $2C ; prewritten text 2C
#_08F287: db $FC ; wait for key and new line
#_08F288: db $D3, $5B ; go to message 5B

;===================================================================================================

; >«なかに はいりますか?»
Message_00_0C_5D:
#_08F28A: db $D6, $00, $6F, $60, $28 ; place sprite 6F in slot 00 at XY:{60,28}
#_08F28F: db $97 ; >
#_08F290: db $F2, $68 ; prewritten text 68
#_08F292: db $F8, $5E ; YES/NO - go to message 5E if YES
#_08F294: db $FF ; end of message

;===================================================================================================

Message_00_0C_5E:
#_08F295: db $D6, $00, $78, $60, $28 ; place sprite 78 in slot 00 at XY:{60,28}
#_08F29A: db $FE, $07, $03 ; ext command 07: draw buffered text then wait 2 frames
#_08F29D: db $D6, $00, $00 ; delete sprite in slot 00
#_08F2A0: db $FE, $1A, $4E, $4B, $19, $00, $00, $00 ; ext command 1A: 4E,4B,19,00,00,00
#_08F2A8: db $FE, $37 ; ext command 37: reload dungeon view

;===================================================================================================

Message_00_0C_5F:
#_08F2AA: db $D5, $46 ; send 46 to APU
#_08F2AC: db $D2, $6C, $60 ; test progress bit 6C for message 60
#_08F2AF: db $D3, $61 ; go to message 61

;===================================================================================================

Message_00_0C_60:
#_08F2B1: db $D2, $24, $69 ; test progress bit 24 for message 69
#_08F2B4: db $D3, $66 ; go to message 66

;===================================================================================================

; [DEMON1]:
; おまえは なにものだ?
; おまえは
Message_00_0C_61:
#_08F2B6: db $DE, $01, $00, $06, $01 ; load 1x demon 0106
#_08F2BB: db $E4, $00 ; load demon $00
#_08F2BD: db $F5 ; write demon name from $050A
#_08F2BE: db $9A ; :
#_08F2BF: db $F9 ; new line
#_08F2C0: db $29, $43, $28, $3E, $CF, $39, $3A, $47 ; おまえは⎵なにも
#_08F2C8: db $3D, $A6, $95 ; のだ?
#_08F2CB: db $FC ; wait for key and new line
#_08F2CC: db $FA ; clear message box
#_08F2CD: db $29, $43, $28, $3E ; おまえは
#_08F2D1: db $F9 ; new line
#_08F2D2: db $FE, $04, $62, $65 ; ext command 04: message 62 if alignment >= 112; 65 if >= 144

;===================================================================================================

; わたしと ことなる ぞくせいのもの
; ここで ほろびるが よい!
Message_00_0C_62:
#_08F2D6: db $50, $34, $30, $38, $CF, $2E, $38, $39 ; わたしと⎵ことな
#_08F2DE: db $4D, $CF, $A5, $2C, $32, $26, $3D, $47 ; る⎵ぞくせいのも
#_08F2E6: db $3D ; の
#_08F2E7: db $F9 ; new line
#_08F2E8: db $2E, $2E, $A9, $CF, $42, $4F, $AC, $4D ; ここで⎵ほろびる
#_08F2F0: db $9C, $CF, $4A, $26, $94 ; が⎵よい!
#_08F2F5: db $FC ; wait for key and new line
#_08F2F6: db $E5, $01, $64 ; [COMMAND E5:01,64]

;===================================================================================================

Message_00_0C_63:
#_08F2F9: db $E5, $00, $64 ; [COMMAND E5:00,64]
#_08F2FC: db $D3, $63 ; go to message 63

;===================================================================================================

Message_00_0C_64:
#_08F2FE: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08F300: db $FA ; clear message box
#_08F301: db $D3, $66 ; go to message 66

;===================================================================================================

; おなじ ぞくせいのものだな
; すべてを うみだす こんとんの みちを すすもう
; おまえには これを わたそう
Message_00_0C_65:
#_08F303: db $29, $39, $A2, $CF, $A5, $2C, $32, $26 ; おなじ⎵ぞくせい
#_08F30B: db $3D, $47, $3D, $A6, $39 ; のものだな
#_08F310: db $F9 ; new line
#_08F311: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08F313: db $D6, $00, $9D, $78, $30 ; place sprite 9D in slot 00 at XY:{78,30}
#_08F318: db $FE, $07, $13 ; ext command 07: draw buffered text then wait 18 frames
#_08F31B: db $D6, $00, $00 ; delete sprite in slot 00
#_08F31E: db $DE, $01, $00, $1C, $01 ; load 1x demon 011C
#_08F323: db $E4, $00 ; load demon $00
#_08F325: db $31, $AE, $37, $51, $CF, $27, $44, $A6 ; すべてを⎵うみだ
#_08F32D: db $31, $CF, $2E, $52, $38, $52, $3D, $CF ; す⎵こんとんの⎵
#_08F335: db $44, $35, $51, $CF, $31, $31, $47, $27 ; みちを⎵すすもう
#_08F33D: db $F9 ; new line
#_08F33E: db $29, $43, $28, $3A, $3E, $CF, $2E, $4E ; おまえには⎵これ
#_08F346: db $51, $CF, $50, $34, $33, $27 ; を⎵わたそう
#_08F34C: db $FC ; wait for key and new line
#_08F34D: db $FA ; clear message box

;===================================================================================================

; >[CHASE]は [ITEM]を
; «てにいれた»
Message_00_0C_66:
#_08F34E: db $E1, $12 ; set $0A50 to item 12
#_08F350: db $97 ; >
#_08F351: db $F0 ; write player name
#_08F352: db $3E, $CF ; は⎵
#_08F354: db $F3 ; write item name from $0A50
#_08F355: db $51 ; を
#_08F356: db $F9 ; new line
#_08F357: db $FE, $3C, $67 ; ext command 3C: go to message 67 if no space for item
#_08F35A: db $F2, $2D ; prewritten text 2D
#_08F35C: db $FC ; wait for key and new line
#_08F35D: db $FE, $28 ; ext command 28: add item to inventory from $0A50
#_08F35F: db $D0, $24 ; set progress bit 24
#_08F361: db $D3, $68 ; go to message 68

;===================================================================================================

; «みつけたが もちきれなかった»
Message_00_0C_67:
#_08F363: db $F2, $72 ; prewritten text 72
#_08F365: db $FC ; wait for key and new line

;===================================================================================================

Message_00_0C_68:
#_08F366: db $D0, $6C ; set progress bit 6C
#_08F368: db $E7, $00 ; call routine 01E5CD with value 00 TODO
#_08F36A: db $FE, $1A, $4D, $CB, $19, $00, $00, $00 ; ext command 1A: 4D,CB,19,00,00,00
#_08F372: db $FF ; end of message

;===================================================================================================

; >«だれもいない»
Message_00_0C_69:
#_08F373: db $97 ; >
#_08F374: db $F2, $2C ; prewritten text 2C
#_08F376: db $FC ; wait for key and new line
#_08F377: db $D3, $68 ; go to message 68

;===================================================================================================

; >«とびらは とざされている»
Message_00_0C_6A:
#_08F379: db $D6, $00, $6F, $60, $28 ; place sprite 6F in slot 00 at XY:{60,28}
#_08F37E: db $D2, $33, $6B ; test progress bit 33 for message 6B
#_08F381: db $97 ; >
#_08F382: db $F2, $69 ; prewritten text 69
#_08F384: db $FC ; wait for key and new line
#_08F385: db $FF ; end of message

;===================================================================================================

; >とびらを あけますか?
Message_00_0C_6B:
#_08F386: db $97, $38, $AC, $4B, $51, $CF, $25, $2D ; >とびらを⎵あけ
#_08F38E: db $43, $31, $2A, $95 ; ますか?
#_08F392: db $F8, $6C ; YES/NO - go to message 6C if YES
#_08F394: db $FF ; end of message

;===================================================================================================

Message_00_0C_6C:
#_08F395: db $D6, $00, $78, $60, $28 ; place sprite 78 in slot 00 at XY:{60,28}
#_08F39A: db $FE, $07, $03 ; ext command 07: draw buffered text then wait 2 frames
#_08F39D: db $D6, $00, $00 ; delete sprite in slot 00
#_08F3A0: db $D2, $0C, $6D ; test progress bit 0C for message 6D
#_08F3A3: db $FE, $1A, $48, $8C, $19, $00, $00, $00 ; ext command 1A: 48,8C,19,00,00,00
#_08F3AB: db $D0, $0C ; set progress bit 0C
#_08F3AD: db $FF ; end of message

;===================================================================================================

Message_00_0C_6D:
#_08F3AE: db $FE, $1A, $48, $0A, $19, $00, $00, $00 ; ext command 1A: 48,0A,19,00,00,00
#_08F3B6: db $D1, $0C ; clear progress bit 0C
#_08F3B8: db $FF ; end of message

;===================================================================================================

; >«とびらは とざされている»
Message_00_0C_6E:
#_08F3B9: db $D6, $00, $6F, $60, $28 ; place sprite 6F in slot 00 at XY:{60,28}
#_08F3BE: db $D2, $4A, $6F ; test progress bit 4A for message 6F
#_08F3C1: db $97 ; >
#_08F3C2: db $F2, $69 ; prewritten text 69
#_08F3C4: db $FC ; wait for key and new line
#_08F3C5: db $FF ; end of message

;===================================================================================================

; >とびらを あけますか?
Message_00_0C_6F:
#_08F3C6: db $97, $38, $AC, $4B, $51, $CF, $25, $2D ; >とびらを⎵あけ
#_08F3CE: db $43, $31, $2A, $95 ; ますか?
#_08F3D2: db $F8, $70 ; YES/NO - go to message 70 if YES
#_08F3D4: db $FF ; end of message

;===================================================================================================

Message_00_0C_70:
#_08F3D5: db $D6, $00, $78, $60, $28 ; place sprite 78 in slot 00 at XY:{60,28}
#_08F3DA: db $FE, $07, $03 ; ext command 07: draw buffered text then wait 2 frames
#_08F3DD: db $D6, $00, $00 ; delete sprite in slot 00
#_08F3E0: db $D2, $0B, $71 ; test progress bit 0B for message 71
#_08F3E3: db $FE, $1A, $48, $03, $19, $00, $00, $00 ; ext command 1A: 48,03,19,00,00,00
#_08F3EB: db $D0, $0B ; set progress bit 0B
#_08F3ED: db $FF ; end of message

;===================================================================================================

Message_00_0C_71:
#_08F3EE: db $FE, $1A, $48, $85, $19, $00, $00, $00 ; ext command 1A: 48,85,19,00,00,00
#_08F3F6: db $D1, $0B ; clear progress bit 0B
#_08F3F8: db $FF ; end of message

;===================================================================================================

Message_00_0C_72:
#_08F3F9: db $FA ; clear message box
#_08F3FA: db $E1, $F0 ; set $0A50 to item F0
#_08F3FC: db $FE, $29 ; ext command 29: take item from $0A51 TODO
#_08F3FE: db $E1, $F2 ; set $0A50 to item F2
#_08F400: db $FE, $29 ; ext command 29: take item from $0A51 TODO
#_08F402: db $E9, $01, $73 ; go to message 73 maybe TODO
#_08F405: db $D6, $80, $4C, $78, $28 ; place sprite 4C in slot 80 at XY:{78,28}
#_08F40A: db $FE, $1C, $02 ; ext command 1C: $02 TODO
#_08F40D: db $D3, $74 ; go to message 74

;===================================================================================================

; >[MOMO]の たましいが あらわれた
Message_00_0C_73:
#_08F40F: db $D6, $80, $1E, $78, $28 ; place sprite 1E in slot 80 at XY:{78,28}
#_08F414: db $FE, $1C, $02 ; ext command 1C: $02 TODO
#_08F417: db $97 ; >
#_08F418: db $ED ; write female protag name
#_08F419: db $3D, $CF, $34, $43, $30, $26, $9C, $CF ; の⎵たましいが⎵
#_08F421: db $25, $4B, $50, $4E, $34 ; あらわれた
#_08F426: db $FE, $07, $C0 ; ext command 07: draw buffered text then wait 191 frames
#_08F429: db $FA ; clear message box

;===================================================================================================

; [MOMO]:
; このままでは ふたりとも しんでしまうわ
; せめて あなただけでも いきのびて!
; じかんが ないわ
; «・・・»さようなら [CHASE]«・・・»
; >[MOMO]は トラポートを となえた
Message_00_0C_74:
#_08F42A: db $ED ; write female protag name
#_08F42B: db $9A ; :
#_08F42C: db $F9 ; new line
#_08F42D: db $2E, $3D, $43, $43, $A9, $3E, $CF, $40 ; このままでは⎵ふ
#_08F435: db $34, $4C, $38, $47, $CF, $30, $52, $A9 ; たりとも⎵しんで
#_08F43D: db $30, $43, $27, $50 ; しまうわ
#_08F441: db $F9 ; new line
#_08F442: db $32, $46, $37, $CF, $25, $39, $34, $A6 ; せめて⎵あなただ
#_08F44A: db $2D, $A9, $47, $CF, $26, $2B, $3D, $AC ; けでも⎵いきのび
#_08F452: db $37, $94 ; て!
#_08F454: db $D2, $30, $75 ; test progress bit 30 for message 75
#_08F457: db $FE, $07, $C0 ; ext command 07: draw buffered text then wait 191 frames
#_08F45A: db $FA ; clear message box
#_08F45B: db $A2, $2A, $52, $9C, $CF, $39, $26, $50 ; じかんが⎵ないわ
#_08F463: db $F9 ; new line
#_08F464: db $FE, $07, $40 ; ext command 07: draw buffered text then wait 63 frames
#_08F467: db $F2, $0B ; prewritten text 0B
#_08F469: db $2F, $4A, $27, $39, $4B, $CF ; さようなら⎵
#_08F46F: db $F0 ; write player name
#_08F470: db $F2, $0B ; prewritten text 0B
#_08F472: db $FE, $07, $C0 ; ext command 07: draw buffered text then wait 191 frames
#_08F475: db $FA ; clear message box
#_08F476: db $97 ; >
#_08F477: db $ED ; write female protag name
#_08F478: db $3E, $CF, $70, $83, $CD, $5A, $70, $51 ; は⎵トラポートを
#_08F480: db $CF, $38, $39, $28, $34 ; ⎵となえた
#_08F485: db $FE, $07, $C0 ; ext command 07: draw buffered text then wait 191 frames
#_08F488: db $FF ; end of message

;===================================================================================================

Message_00_0C_75:
#_08F489: db $FC ; wait for key and new line
#_08F48A: db $FF ; end of message

;===================================================================================================

; まずは 1たいめだ
FusionMessage_00:
#_08F48B: db $43, $A3, $3E, $CF, $02, $34, $26, $46 ; まずは⎵1たいめ
#_08F493: db $A6 ; だ
#_08F494: db $FF ; end of message

;===================================================================================================

; そして 2たいめだ
FusionMessage_01:
#_08F495: db $33, $30, $37, $CF, $03, $34, $26, $46 ; そして⎵2たいめ
#_08F49D: db $A6 ; だ
#_08F49E: db $FF ; end of message

;===================================================================================================

; さいごに 3たいめをえらぶのだ
FusionMessage_02:
#_08F49F: db $2F, $26, $A0, $3A, $CF, $04, $34, $26 ; さいごに⎵3たい
#_08F4A7: db $46, $51, $28, $4B, $AD, $3D, $A6 ; めをえらぶのだ
#_08F4AE: db $FF ; end of message

;===================================================================================================

; がったいさせるケンを えらぶのだ
FusionMessage_03:
#_08F4AF: db $9C, $58, $34, $26, $2F, $32, $4D, $65 ; がったいさせるケ
#_08F4B7: db $8A, $51, $CF, $28, $4B, $AD, $3D, $A6 ; ンを⎵えらぶのだ
#_08F4BF: db $FF ; end of message

;===================================================================================================

; 1ST SELECT
FusionMessage_04:
#_08F4C0: db $02, $1D, $1E, $CF, $1D, $0F, $16, $0F ; 1ST⎵SELE
#_08F4C8: db $0D, $1E ; CT
#_08F4CA: db $FF ; end of message

;===================================================================================================

; 2ND SELECT
FusionMessage_05:
#_08F4CB: db $03, $18, $0E, $CF, $1D, $0F, $16, $0F ; 2ND⎵SELE
#_08F4D3: db $0D, $1E ; CT
#_08F4D5: db $FF ; end of message

;===================================================================================================

; 3RD SELECT
FusionMessage_06:
#_08F4D6: db $04, $1C, $0E, $CF, $1D, $0F, $16, $0F ; 3RD⎵SELE
#_08F4DE: db $0D, $1E ; CT
#_08F4E0: db $FF ; end of message

;===================================================================================================

; RESULT
FusionMessage_07:
#_08F4E1: db $1C, $0F, $1D, $1F, $16, $1E ; RESULT
#_08F4E7: db $FF ; end of message

;===================================================================================================

; ケンと がったいさせるナカマを えらぶのだ
FusionMessage_08:
#_08F4E8: db $65, $8A, $38, $CF, $9C, $58, $34, $26 ; ケンと⎵がったい
#_08F4F0: db $2F, $32, $4D, $71, $62, $7B, $51, $CF ; させるナカマを⎵
#_08F4F8: db $28, $4B, $AD, $3D, $A6 ; えらぶのだ
#_08F4FD: db $FF ; end of message

;===================================================================================================

; エコービル
TerminalDestinationName_00:
#_08F4FE: db $60, $66, $5A, $C5, $85 ; エコービル
#_08F503: db $FF ; end of message

;===================================================================================================

; けんきゅうじょ
TerminalDestinationName_01:
#_08F504: db $2D, $52, $2B, $56, $27, $A2, $57 ; けんきゅうじょ
#_08F50B: db $FF ; end of message

;===================================================================================================

; シンジュク
TerminalDestinationName_02:
#_08F50C: db $68, $8A, $BB, $90, $64 ; シンジュク
#_08F511: db $FF ; end of message

;===================================================================================================

; イケブクロ
TerminalDestinationName_03:
#_08F512: db $5E, $65, $C6, $64, $87 ; イケブクロ
#_08F517: db $FF ; end of message

;===================================================================================================

; ギンザ
TerminalDestinationName_04:
#_08F518: db $B6, $8A, $BA ; ギンザ
#_08F51B: db $FF ; end of message

;===================================================================================================

; シナガワ
TerminalDestinationName_05:
#_08F51C: db $68, $71, $B5, $88 ; シナガワ
#_08F520: db $FF ; end of message

;===================================================================================================

; ウエノ
TerminalDestinationName_06:
#_08F521: db $5F, $60, $75 ; ウエノ
#_08F524: db $FF ; end of message

;===================================================================================================

; カテドラルカオス
TerminalDestinationName_07:
#_08F525: db $62, $6F, $C3, $83, $85, $62, $61, $69 ; カテドラルカオス
#_08F52D: db $FF ; end of message

;===================================================================================================

; カテドラルロウ
TerminalDestinationName_08:
#_08F52E: db $62, $6F, $C3, $83, $85, $87, $5F ; カテドラルロウ
#_08F535: db $FF ; end of message

;===================================================================================================

; ロッポンギ
TerminalDestinationName_09:
#_08F536: db $87, $92, $CD, $8A, $B6 ; ロッポンギ
#_08F53B: db $FF ; end of message

;===================================================================================================

; T.D.L.
TerminalDestinationName_0A:
#_08F53C: db $1E, $9B, $0E, $9B, $16, $9B ; T.D.L.
#_08F542: db $FF ; end of message

;===================================================================================================

; シブヤ
TerminalDestinationName_0B:
#_08F543: db $68, $C6, $80 ; シブヤ
#_08F546: db $FF ; end of message

;===================================================================================================

; トウキョウタワー
TerminalDestinationName_0C:
#_08F547: db $70, $5F, $63, $91, $5F, $6C, $88, $5A ; トウキョウタワー
#_08F54F: db $FF ; end of message

;===================================================================================================

; とちょう
TerminalDestinationName_0D:
#_08F550: db $38, $35, $57, $27 ; とちょう
#_08F554: db $FF ; end of message

;===================================================================================================

; じたく
TerminalDestinationName_0E:
#_08F555: db $A2, $34, $2C ; じたく
#_08F558: db $FF ; end of message

;===================================================================================================

; こんごうしんかい
TerminalDestinationName_0F:
#_08F559: db $2E, $52, $A0, $27, $30, $52, $2A, $26 ; こんごうしんかい
#_08F561: db $FF ; end of message

;===================================================================================================

; びょういん
TerminalDestinationName_10:
#_08F562: db $AC, $57, $27, $26, $52 ; びょういん
#_08F567: db $FF ; end of message

;===================================================================================================

; スガモプリズン
TerminalDestinationName_11:
#_08F568: db $69, $B5, $7F, $CB, $84, $BC, $8A ; スガモプリズン
#_08F56F: db $FF ; end of message

;===================================================================================================

; ERROR
TerminalDestinationName_ERROR:
#_08F570: db $0F, $1C, $1C, $19, $1C ; ERROR
#_08F575: db $FF ; end of message

;===================================================================================================

;  かう
ShopActionMessage_00:
#_08F576: db $CF, $2A, $27 ; ⎵かう
#_08F579: db $FF ; end of message

;===================================================================================================

;  うる
ShopActionMessage_01:
#_08F57A: db $CF, $27, $4D ; ⎵うる
#_08F57D: db $FF ; end of message

;===================================================================================================

;  そうび する
ShopActionMessage_02:
#_08F57E: db $CF, $33, $27, $AC, $CF, $31, $4D ; ⎵そうび⎵する
#_08F585: db $FF ; end of message

;===================================================================================================

;  ステータスを みる
ShopActionMessage_03:
#_08F586: db $CF, $69, $6F, $5A, $6C, $69, $51, $CF ; ⎵ステータスを⎵
#_08F58E: db $44, $4D ; みる
#_08F590: db $FF ; end of message

;===================================================================================================

;  みせを でる
ShopActionMessage_04:
#_08F591: db $CF, $44, $32, $51, $CF, $A9, $4D ; ⎵みせを⎵でる
#_08F598: db $FF ; end of message

;===================================================================================================

;  そとに でる
ShopActionMessage_05:
#_08F599: db $CF, $33, $38, $3A, $CF, $A9, $4D ; ⎵そとに⎵でる
#_08F5A0: db $FF ; end of message

;===================================================================================================

;  かうのを やめる
ShopActionMessage_06:
#_08F5A1: db $CF, $2A, $27, $3D, $51, $CF, $48, $46 ; ⎵かうのを⎵やめ
#_08F5A9: db $4D ; る
#_08F5AA: db $FF ; end of message

;===================================================================================================

;  もちものを せいとんする
ShopActionMessage_07:
#_08F5AB: db $CF, $47, $35, $47, $3D, $51, $CF, $32 ; ⎵もちものを⎵せ
#_08F5B3: db $26, $38, $52, $31, $4D ; いとんする
#_08F5B8: db $FF ; end of message

;===================================================================================================

Message_00_00_Pointers:
#_08F5B9: dw Message_00_00_00
#_08F5BB: dw Message_00_00_01
#_08F5BD: dw Message_00_00_02
#_08F5BF: dw Message_00_00_03
#_08F5C1: dw Message_00_00_04
#_08F5C3: dw Message_00_00_05
#_08F5C5: dw Message_00_00_06
#_08F5C7: dw Message_00_00_07
#_08F5C9: dw Message_00_00_08
#_08F5CB: dw Message_00_00_09
#_08F5CD: dw Message_00_00_0A
#_08F5CF: dw Message_00_00_0B
#_08F5D1: dw Message_00_00_0C
#_08F5D3: dw Message_00_00_0D
#_08F5D5: dw Message_00_00_0E
#_08F5D7: dw Message_00_00_0F
#_08F5D9: dw Message_00_00_10
#_08F5DB: dw Message_00_00_11
#_08F5DD: dw Message_00_00_12
#_08F5DF: dw Message_00_00_13
#_08F5E1: dw Message_00_00_14
#_08F5E3: dw Message_00_00_15
#_08F5E5: dw Message_00_00_16
#_08F5E7: dw Message_00_00_17
#_08F5E9: dw Message_00_00_18
#_08F5EB: dw Message_00_00_19
#_08F5ED: dw Message_00_00_1A
#_08F5EF: dw Message_00_00_1B
#_08F5F1: dw Message_00_00_1C
#_08F5F3: dw Message_00_00_1D
#_08F5F5: dw Message_00_00_1E
#_08F5F7: dw Message_00_00_1F
#_08F5F9: dw Message_00_00_20
#_08F5FB: dw Message_00_00_21
#_08F5FD: dw Message_00_00_22
#_08F5FF: dw Message_00_00_23
#_08F601: dw Message_00_00_24
#_08F603: dw Message_00_00_25
#_08F605: dw Message_00_00_26
#_08F607: dw Message_00_00_27
#_08F609: dw Message_00_00_28
#_08F60B: dw Message_00_00_29
#_08F60D: dw Message_00_00_2A
#_08F60F: dw Message_00_00_2B
#_08F611: dw Message_00_00_2C
#_08F613: dw Message_00_00_2D
#_08F615: dw Message_00_00_2E
#_08F617: dw Message_00_00_2F
#_08F619: dw Message_00_00_30
#_08F61B: dw Message_00_00_31
#_08F61D: dw Message_00_00_32
#_08F61F: dw Message_00_00_33
#_08F621: dw Message_00_00_34
#_08F623: dw Message_00_00_35
#_08F625: dw Message_00_00_36
#_08F627: dw Message_00_00_37
#_08F629: dw Message_00_00_38
#_08F62B: dw Message_00_00_39
#_08F62D: dw Message_00_00_3A
#_08F62F: dw Message_00_00_3B
#_08F631: dw Message_00_00_3C
#_08F633: dw Message_00_00_3D
#_08F635: dw Message_00_00_3E
#_08F637: dw Message_00_00_3E
#_08F639: dw Message_00_00_40
#_08F63B: dw Message_00_00_41
#_08F63D: dw Message_00_00_42
#_08F63F: dw Message_00_00_43
#_08F641: dw Message_00_00_44
#_08F643: dw Message_00_00_45
#_08F645: dw Message_00_00_46
#_08F647: dw Message_00_00_47
#_08F649: dw Message_00_00_48
#_08F64B: dw Message_00_00_49
#_08F64D: dw Message_00_00_4A
#_08F64F: dw Message_00_00_4B
#_08F651: dw Message_00_00_4C
#_08F653: dw Message_00_00_4D
#_08F655: dw Message_00_00_4E
#_08F657: dw Message_00_00_4F
#_08F659: dw Message_00_00_50
#_08F65B: dw Message_00_00_51
#_08F65D: dw Message_00_00_52
#_08F65F: dw Message_00_00_53
#_08F661: dw Message_00_00_54
#_08F663: dw Message_00_00_55
#_08F665: dw Message_00_00_56
#_08F667: dw Message_00_00_57
#_08F669: dw Message_00_00_58
#_08F66B: dw Message_00_00_59
#_08F66D: dw Message_00_00_5A
#_08F66F: dw Message_00_00_5B
#_08F671: dw Message_00_00_5C
#_08F673: dw Message_00_00_5D
#_08F675: dw Message_00_00_5D
#_08F677: dw Message_00_00_5F
#_08F679: dw Message_00_00_60
#_08F67B: dw Message_00_00_61
#_08F67D: dw Message_00_00_62
#_08F67F: dw Message_00_00_63
#_08F681: dw Message_00_00_64
#_08F683: dw Message_00_00_65
#_08F685: dw Message_00_00_66
#_08F687: dw Message_00_00_67
#_08F689: dw Message_00_00_68
#_08F68B: dw Message_00_00_69
#_08F68D: dw Message_00_00_6A
#_08F68F: dw Message_00_00_6B
#_08F691: dw Message_00_00_6C
#_08F693: dw Message_00_00_6D
#_08F695: dw Message_00_00_6E
#_08F697: dw Message_00_00_6F
#_08F699: dw Message_00_00_70
#_08F69B: dw Message_00_00_71
#_08F69D: dw Message_00_00_72
#_08F69F: dw Message_00_00_73
#_08F6A1: dw Message_00_00_74
#_08F6A3: dw Message_00_00_75
#_08F6A5: dw Message_00_00_76
#_08F6A7: dw Message_00_00_77
#_08F6A9: dw Message_00_00_78
#_08F6AB: dw Message_00_00_79
#_08F6AD: dw Message_00_00_7A
#_08F6AF: dw Message_00_00_7B
#_08F6B1: dw Message_00_00_7C
#_08F6B3: dw Message_00_00_7D
#_08F6B5: dw Message_00_00_7E
#_08F6B7: dw Message_00_00_7F
#_08F6B9: dw Message_00_00_80
#_08F6BB: dw Message_00_00_81
#_08F6BD: dw Message_00_00_82
#_08F6BF: dw Message_00_00_83
#_08F6C1: dw Message_00_00_84
#_08F6C3: dw Message_00_00_85
#_08F6C5: dw Message_00_00_86
#_08F6C7: dw Message_00_00_87
#_08F6C9: dw Message_00_00_88
#_08F6CB: dw Message_00_00_89
#_08F6CD: dw Message_00_00_8A
#_08F6CF: dw Message_00_00_8B
#_08F6D1: dw Message_00_00_8C
#_08F6D3: dw Message_00_00_8D
#_08F6D5: dw Message_00_00_8E
#_08F6D7: dw Message_00_00_8F
#_08F6D9: dw Message_00_00_90
#_08F6DB: dw Message_00_00_91

;===================================================================================================

Message_00_01_Pointers:
#_08F6DD: dw Message_00_01_00
#_08F6DF: dw Message_00_01_01
#_08F6E1: dw Message_00_01_02
#_08F6E3: dw Message_00_01_03
#_08F6E5: dw Message_00_01_04
#_08F6E7: dw Message_00_01_05
#_08F6E9: dw Message_00_01_06
#_08F6EB: dw Message_00_01_07
#_08F6ED: dw Message_00_01_08
#_08F6EF: dw Message_00_01_09
#_08F6F1: dw Message_00_01_0A
#_08F6F3: dw Message_00_01_0B
#_08F6F5: dw Message_00_01_0C
#_08F6F7: dw Message_00_01_0D
#_08F6F9: dw Message_00_01_0E
#_08F6FB: dw Message_00_01_0F
#_08F6FD: dw Message_00_01_10

;===================================================================================================

Message_00_02_Pointers:
#_08F6FF: dw Message_00_02_00
#_08F701: dw Message_00_02_01
#_08F703: dw Message_00_02_02
#_08F705: dw Message_00_02_03
#_08F707: dw Message_00_02_04
#_08F709: dw Message_00_02_05
#_08F70B: dw Message_00_02_06
#_08F70D: dw Message_00_02_07
#_08F70F: dw Message_00_02_08
#_08F711: dw Message_00_02_09
#_08F713: dw Message_00_02_0A
#_08F715: dw Message_00_02_0B
#_08F717: dw Message_00_02_0C
#_08F719: dw Message_00_02_0D
#_08F71B: dw Message_00_02_0E
#_08F71D: dw Message_00_02_0F
#_08F71F: dw Message_00_02_10
#_08F721: dw Message_00_02_11
#_08F723: dw Message_00_02_12
#_08F725: dw Message_00_02_13
#_08F727: dw Message_00_02_14
#_08F729: dw Message_00_02_15
#_08F72B: dw Message_00_02_16
#_08F72D: dw Message_00_02_17
#_08F72F: dw Message_00_02_18
#_08F731: dw Message_00_02_19
#_08F733: dw Message_00_02_1A
#_08F735: dw Message_00_02_1B
#_08F737: dw Message_00_02_1C
#_08F739: dw Message_00_02_1D
#_08F73B: dw Message_00_02_1E
#_08F73D: dw Message_00_02_1F
#_08F73F: dw Message_00_02_20
#_08F741: dw Message_00_02_21
#_08F743: dw Message_00_02_21
#_08F745: dw Message_00_02_21
#_08F747: dw Message_00_02_24
#_08F749: dw Message_00_02_25
#_08F74B: dw Message_00_02_26
#_08F74D: dw Message_00_02_27
#_08F74F: dw Message_00_02_28
#_08F751: dw Message_00_02_29
#_08F753: dw Message_00_02_2A
#_08F755: dw Message_00_02_2B
#_08F757: dw Message_00_02_2C
#_08F759: dw Message_00_02_2D
#_08F75B: dw Message_00_02_2D
#_08F75D: dw Message_00_02_2D
#_08F75F: dw Message_00_02_30
#_08F761: dw Message_00_02_31
#_08F763: dw Message_00_02_32
#_08F765: dw Message_00_02_33
#_08F767: dw Message_00_02_34
#_08F769: dw Message_00_02_35
#_08F76B: dw Message_00_02_36
#_08F76D: dw Message_00_02_37
#_08F76F: dw Message_00_02_38
#_08F771: dw Message_00_02_39
#_08F773: dw Message_00_02_3A
#_08F775: dw Message_00_02_3B
#_08F777: dw Message_00_02_3C
#_08F779: dw Message_00_02_3D
#_08F77B: dw Message_00_02_3E
#_08F77D: dw Message_00_02_3F
#_08F77F: dw Message_00_02_40
#_08F781: dw Message_00_02_41
#_08F783: dw Message_00_02_42
#_08F785: dw Message_00_02_43
#_08F787: dw Message_00_02_44
#_08F789: dw Message_00_02_45
#_08F78B: dw Message_00_02_46
#_08F78D: dw Message_00_02_47
#_08F78F: dw Message_00_02_48
#_08F791: dw Message_00_02_49
#_08F793: dw Message_00_02_4A
#_08F795: dw Message_00_02_4B
#_08F797: dw Message_00_02_4C
#_08F799: dw Message_00_02_4D
#_08F79B: dw Message_00_02_4E
#_08F79D: dw Message_00_02_4F
#_08F79F: dw Message_00_02_50
#_08F7A1: dw Message_00_02_51
#_08F7A3: dw Message_00_02_52
#_08F7A5: dw Message_00_02_53
#_08F7A7: dw Message_00_02_54
#_08F7A9: dw Message_00_02_55
#_08F7AB: dw Message_00_02_56
#_08F7AD: dw Message_00_02_57
#_08F7AF: dw Message_00_02_58
#_08F7B1: dw Message_00_02_59
#_08F7B3: dw Message_00_02_5A
#_08F7B5: dw Message_00_02_5A
#_08F7B7: dw Message_00_02_5A
#_08F7B9: dw Message_00_02_5A
#_08F7BB: dw Message_00_02_5A
#_08F7BD: dw Message_00_02_5A
#_08F7BF: dw Message_00_02_60
#_08F7C1: dw Message_00_02_61
#_08F7C3: dw Message_00_02_62
#_08F7C5: dw Message_00_02_63
#_08F7C7: dw Message_00_02_64
#_08F7C9: dw Message_00_02_65
#_08F7CB: dw Message_00_02_66
#_08F7CD: dw Message_00_02_66
#_08F7CF: dw Message_00_02_66
#_08F7D1: dw Message_00_02_66
#_08F7D3: dw Message_00_02_66
#_08F7D5: dw Message_00_02_66
#_08F7D7: dw Message_00_02_6C
#_08F7D9: dw Message_00_02_6D
#_08F7DB: dw Message_00_02_6E
#_08F7DD: dw Message_00_02_6F
#_08F7DF: dw Message_00_02_70
#_08F7E1: dw Message_00_02_71
#_08F7E3: dw Message_00_02_72
#_08F7E5: dw Message_00_02_72
#_08F7E7: dw Message_00_02_72
#_08F7E9: dw Message_00_02_72
#_08F7EB: dw Message_00_02_72
#_08F7ED: dw Message_00_02_72
#_08F7EF: dw Message_00_02_78
#_08F7F1: dw Message_00_02_79
#_08F7F3: dw Message_00_02_7A
#_08F7F5: dw Message_00_02_7B
#_08F7F7: dw Message_00_02_7C
#_08F7F9: dw Message_00_02_7D
#_08F7FB: dw Message_00_02_7E
#_08F7FD: dw Message_00_02_7E
#_08F7FF: dw Message_00_02_7E
#_08F801: dw Message_00_02_7E
#_08F803: dw Message_00_02_7E
#_08F805: dw Message_00_02_7E
#_08F807: dw Message_00_02_84
#_08F809: dw Message_00_02_85
#_08F80B: dw Message_00_02_86
#_08F80D: dw Message_00_02_87
#_08F80F: dw Message_00_02_88
#_08F811: dw Message_00_02_89
#_08F813: dw Message_00_02_8A
#_08F815: dw Message_00_02_8B
#_08F817: dw Message_00_02_8C
#_08F819: dw Message_00_02_8D
#_08F81B: dw Message_00_02_8E
#_08F81D: dw Message_00_02_8F
#_08F81F: dw Message_00_02_90
#_08F821: dw Message_00_02_91
#_08F823: dw Message_00_02_92
#_08F825: dw Message_00_02_93
#_08F827: dw Message_00_02_94
#_08F829: dw Message_00_02_95
#_08F82B: dw Message_00_02_96
#_08F82D: dw Message_00_02_97
#_08F82F: dw Message_00_02_98
#_08F831: dw Message_00_02_99
#_08F833: dw Message_00_02_9A
#_08F835: dw Message_00_02_9B
#_08F837: dw Message_00_02_9C
#_08F839: dw Message_00_02_9D
#_08F83B: dw Message_00_02_9E
#_08F83D: dw Message_00_02_9F
#_08F83F: dw Message_00_02_A0
#_08F841: dw Message_00_02_A1
#_08F843: dw Message_00_02_A2
#_08F845: dw Message_00_02_A3
#_08F847: dw Message_00_02_A4
#_08F849: dw Message_00_02_A5
#_08F84B: dw Message_00_02_A5
#_08F84D: dw Message_00_02_A5
#_08F84F: dw Message_00_02_A8
#_08F851: dw Message_00_02_A9
#_08F853: dw Message_00_02_AA
#_08F855: dw Message_00_02_AB
#_08F857: dw Message_00_02_AC
#_08F859: dw Message_00_02_AD
#_08F85B: dw Message_00_02_AE
#_08F85D: dw Message_00_02_AF
#_08F85F: dw Message_00_02_B0
#_08F861: dw Message_00_02_B1
#_08F863: dw Message_00_02_B1
#_08F865: dw Message_00_02_B1
#_08F867: dw Message_00_02_B4
#_08F869: dw Message_00_02_B5
#_08F86B: dw Message_00_02_B6
#_08F86D: dw Message_00_02_B7
#_08F86F: dw Message_00_02_B8
#_08F871: dw Message_00_02_B9
#_08F873: dw Message_00_02_BA
#_08F875: dw Message_00_02_BB
#_08F877: dw Message_00_02_BC
#_08F879: dw Message_00_02_BD
#_08F87B: dw Message_00_02_BE
#_08F87D: dw Message_00_02_BF
#_08F87F: dw Message_00_02_C0
#_08F881: dw Message_00_02_C1
#_08F883: dw Message_00_02_C2
#_08F885: dw Message_00_02_C3
#_08F887: dw Message_00_02_C4
#_08F889: dw Message_00_02_C5
#_08F88B: dw Message_00_02_C6
#_08F88D: dw Message_00_02_C7
#_08F88F: dw Message_00_02_C8
#_08F891: dw Message_00_02_C9
#_08F893: dw Message_00_02_CA
#_08F895: dw Message_00_02_CB
#_08F897: dw Message_00_02_CC
#_08F899: dw Message_00_02_CD
#_08F89B: dw Message_00_02_CE
#_08F89D: dw Message_00_02_CF
#_08F89F: dw Message_00_02_D0
#_08F8A1: dw Message_00_02_D1
#_08F8A3: dw Message_00_02_D2
#_08F8A5: dw Message_00_02_D3
#_08F8A7: dw Message_00_02_D4
#_08F8A9: dw Message_00_02_D5
#_08F8AB: dw Message_00_02_D5
#_08F8AD: dw Message_00_02_D5
#_08F8AF: dw Message_00_02_D8
#_08F8B1: dw Message_00_02_D9
#_08F8B3: dw Message_00_02_DA
#_08F8B5: dw Message_00_02_DB
#_08F8B7: dw Message_00_02_DC
#_08F8B9: dw Message_00_02_DD
#_08F8BB: dw Message_00_02_DE
#_08F8BD: dw Message_00_02_DF
#_08F8BF: dw Message_00_02_E0
#_08F8C1: dw Message_00_02_E1
#_08F8C3: dw Message_00_02_E2
#_08F8C5: dw Message_00_02_E3
#_08F8C7: dw Message_00_02_E4
#_08F8C9: dw Message_00_02_E5
#_08F8CB: dw Message_00_02_E6
#_08F8CD: dw Message_00_02_E7
#_08F8CF: dw Message_00_02_E8
#_08F8D1: dw Message_00_02_E9
#_08F8D3: dw Message_00_02_EA
#_08F8D5: dw Message_00_02_EB
#_08F8D7: dw Message_00_02_EC
#_08F8D9: dw Message_00_02_ED
#_08F8DB: dw Message_00_02_EE
#_08F8DD: dw Message_00_02_EF
#_08F8DF: dw Message_00_02_F0
#_08F8E1: dw Message_00_02_F1
#_08F8E3: dw Message_00_02_F2
#_08F8E5: dw Message_00_02_F3
#_08F8E7: dw Message_00_02_F4
#_08F8E9: dw Message_00_02_F5
#_08F8EB: dw Message_00_02_F6
#_08F8ED: dw Message_00_02_F7
#_08F8EF: dw Message_00_02_F8
#_08F8F1: dw Message_00_02_F9
#_08F8F3: dw Message_00_02_F9
#_08F8F5: dw Message_00_02_F9

;===================================================================================================

Message_00_03_Pointers:
#_08F8F7: dw Message_00_03_00
#_08F8F9: dw Message_00_03_01
#_08F8FB: dw Message_00_03_02
#_08F8FD: dw Message_00_03_03
#_08F8FF: dw Message_00_03_04
#_08F901: dw Message_00_03_05
#_08F903: dw Message_00_03_06
#_08F905: dw Message_00_03_07
#_08F907: dw Message_00_03_08
#_08F909: dw Message_00_03_09
#_08F90B: dw Message_00_03_0A
#_08F90D: dw Message_00_03_0B
#_08F90F: dw Message_00_03_0C
#_08F911: dw Message_00_03_0D
#_08F913: dw Message_00_03_0E
#_08F915: dw Message_00_03_0F
#_08F917: dw Message_00_03_10
#_08F919: dw Message_00_03_11
#_08F91B: dw Message_00_03_12
#_08F91D: dw Message_00_03_13
#_08F91F: dw Message_00_03_14
#_08F921: dw Message_00_03_15
#_08F923: dw Message_00_03_16
#_08F925: dw Message_00_03_17
#_08F927: dw Message_00_03_18
#_08F929: dw Message_00_03_19
#_08F92B: dw Message_00_03_1A
#_08F92D: dw Message_00_03_1B
#_08F92F: dw Message_00_03_1C
#_08F931: dw Message_00_03_1D
#_08F933: dw Message_00_03_1E
#_08F935: dw Message_00_03_1F
#_08F937: dw Message_00_03_20
#_08F939: dw Message_00_03_21
#_08F93B: dw Message_00_03_22
#_08F93D: dw Message_00_03_23
#_08F93F: dw Message_00_03_24
#_08F941: dw Message_00_03_25
#_08F943: dw Message_00_03_26
#_08F945: dw Message_00_03_27
#_08F947: dw Message_00_03_28
#_08F949: dw Message_00_03_29
#_08F94B: dw Message_00_03_2A
#_08F94D: dw Message_00_03_2B
#_08F94F: dw Message_00_03_2C
#_08F951: dw Message_00_03_2D
#_08F953: dw Message_00_03_2E
#_08F955: dw Message_00_03_2F
#_08F957: dw Message_00_03_30
#_08F959: dw Message_00_03_31
#_08F95B: dw Message_00_03_32
#_08F95D: dw Message_00_03_33
#_08F95F: dw Message_00_03_34
#_08F961: dw Message_00_03_35
#_08F963: dw Message_00_03_36
#_08F965: dw Message_00_03_37
#_08F967: dw Message_00_03_38
#_08F969: dw Message_00_03_39
#_08F96B: dw Message_00_03_39
#_08F96D: dw Message_00_03_39
#_08F96F: dw Message_00_03_3C
#_08F971: dw Message_00_03_3D
#_08F973: dw Message_00_03_3E
#_08F975: dw Message_00_03_3F
#_08F977: dw Message_00_03_40
#_08F979: dw Message_00_03_41
#_08F97B: dw Message_00_03_42
#_08F97D: dw Message_00_03_43
#_08F97F: dw Message_00_03_44
#_08F981: dw Message_00_03_45
#_08F983: dw Message_00_03_46
#_08F985: dw Message_00_03_47
#_08F987: dw Message_00_03_48
#_08F989: dw Message_00_03_49
#_08F98B: dw Message_00_03_4A
#_08F98D: dw Message_00_03_4B
#_08F98F: dw Message_00_03_4C
#_08F991: dw Message_00_03_4D
#_08F993: dw Message_00_03_4E
#_08F995: dw Message_00_03_4F
#_08F997: dw Message_00_03_50
#_08F999: dw Message_00_03_51
#_08F99B: dw Message_00_03_52
#_08F99D: dw Message_00_03_53
#_08F99F: dw Message_00_03_54
#_08F9A1: dw Message_00_03_55
#_08F9A3: dw Message_00_03_56
#_08F9A5: dw Message_00_03_57
#_08F9A7: dw Message_00_03_58
#_08F9A9: dw Message_00_03_59
#_08F9AB: dw Message_00_03_5A
#_08F9AD: dw Message_00_03_5B
#_08F9AF: dw Message_00_03_5C
#_08F9B1: dw Message_00_03_5D
#_08F9B3: dw Message_00_03_5D
#_08F9B5: dw Message_00_03_5D
#_08F9B7: dw Message_00_03_60
#_08F9B9: dw Message_00_03_61
#_08F9BB: dw Message_00_03_62
#_08F9BD: dw Message_00_03_63
#_08F9BF: dw Message_00_03_64
#_08F9C1: dw Message_00_03_65
#_08F9C3: dw Message_00_03_66
#_08F9C5: dw Message_00_03_67
#_08F9C7: dw Message_00_03_68
#_08F9C9: dw Message_00_03_69
#_08F9CB: dw Message_00_03_6A
#_08F9CD: dw Message_00_03_6B
#_08F9CF: dw Message_00_03_6C
#_08F9D1: dw Message_00_03_6D
#_08F9D3: dw Message_00_03_6E
#_08F9D5: dw Message_00_03_6F
#_08F9D7: dw Message_00_03_70
#_08F9D9: dw Message_00_03_71
#_08F9DB: dw Message_00_03_72
#_08F9DD: dw Message_00_03_73
#_08F9DF: dw Message_00_03_74
#_08F9E1: dw Message_00_03_75
#_08F9E3: dw Message_00_03_76
#_08F9E5: dw Message_00_03_77
#_08F9E7: dw Message_00_03_78
#_08F9E9: dw Message_00_03_79
#_08F9EB: dw Message_00_03_7A
#_08F9ED: dw Message_00_03_7B
#_08F9EF: dw Message_00_03_7C
#_08F9F1: dw Message_00_03_7D
#_08F9F3: dw Message_00_03_7E
#_08F9F5: dw Message_00_03_7F
#_08F9F7: dw Message_00_03_80
#_08F9F9: dw Message_00_03_81
#_08F9FB: dw Message_00_03_82
#_08F9FD: dw Message_00_03_83
#_08F9FF: dw Message_00_03_84
#_08FA01: dw Message_00_03_85
#_08FA03: dw Message_00_03_86
#_08FA05: dw Message_00_03_87
#_08FA07: dw Message_00_03_88
#_08FA09: dw Message_00_03_89
#_08FA0B: dw Message_00_03_8A
#_08FA0D: dw Message_00_03_8B
#_08FA0F: dw Message_00_03_8C
#_08FA11: dw Message_00_03_8D
#_08FA13: dw Message_00_03_8E
#_08FA15: dw Message_00_03_8F
#_08FA17: dw Message_00_03_90
#_08FA19: dw Message_00_03_91
#_08FA1B: dw Message_00_03_92
#_08FA1D: dw Message_00_03_93
#_08FA1F: dw Message_00_03_94
#_08FA21: dw Message_00_03_95
#_08FA23: dw Message_00_03_96
#_08FA25: dw Message_00_03_97
#_08FA27: dw Message_00_03_98
#_08FA29: dw Message_00_03_99
#_08FA2B: dw Message_00_03_9A
#_08FA2D: dw Message_00_03_9B
#_08FA2F: dw Message_00_03_9C
#_08FA31: dw Message_00_03_9D
#_08FA33: dw Message_00_03_9E
#_08FA35: dw Message_00_03_9F
#_08FA37: dw Message_00_03_A0
#_08FA39: dw Message_00_03_A1
#_08FA3B: dw Message_00_03_A2
#_08FA3D: dw Message_00_03_A3
#_08FA3F: dw Message_00_03_A4
#_08FA41: dw Message_00_03_A5
#_08FA43: dw Message_00_03_A5
#_08FA45: dw Message_00_03_A5
#_08FA47: dw Message_00_03_A8
#_08FA49: dw Message_00_03_A9
#_08FA4B: dw Message_00_03_AA
#_08FA4D: dw Message_00_03_AB
#_08FA4F: dw Message_00_03_AC
#_08FA51: dw Message_00_03_AD
#_08FA53: dw Message_00_03_AE
#_08FA55: dw Message_00_03_AF
#_08FA57: dw Message_00_03_B0
#_08FA59: dw Message_00_03_B1
#_08FA5B: dw Message_00_03_B1
#_08FA5D: dw Message_00_03_B1
#_08FA5F: dw Message_00_03_B4
#_08FA61: dw Message_00_03_B5
#_08FA63: dw Message_00_03_B6
#_08FA65: dw Message_00_03_B7
#_08FA67: dw Message_00_03_B8
#_08FA69: dw Message_00_03_B9
#_08FA6B: dw Message_00_03_BA
#_08FA6D: dw Message_00_03_BA
#_08FA6F: dw Message_00_03_BA
#_08FA71: dw Message_00_03_BA
#_08FA73: dw Message_00_03_BA
#_08FA75: dw Message_00_03_BA
#_08FA77: dw Message_00_03_C0
#_08FA79: dw Message_00_03_C1
#_08FA7B: dw Message_00_03_C2
#_08FA7D: dw Message_00_03_C3
#_08FA7F: dw Message_00_03_C4
#_08FA81: dw Message_00_03_C5
#_08FA83: dw Message_00_03_C6
#_08FA85: dw Message_00_03_C6
#_08FA87: dw Message_00_03_C6
#_08FA89: dw Message_00_03_C6
#_08FA8B: dw Message_00_03_C6
#_08FA8D: dw Message_00_03_C6
#_08FA8F: dw Message_00_03_CC
#_08FA91: dw Message_00_03_CD
#_08FA93: dw Message_00_03_CE
#_08FA95: dw Message_00_03_CF
#_08FA97: dw Message_00_03_D0
#_08FA99: dw Message_00_03_D1
#_08FA9B: dw Message_00_03_D2
#_08FA9D: dw Message_00_03_D2
#_08FA9F: dw Message_00_03_D2
#_08FAA1: dw Message_00_03_D2
#_08FAA3: dw Message_00_03_D2
#_08FAA5: dw Message_00_03_D2
#_08FAA7: dw Message_00_03_D8
#_08FAA9: dw Message_00_03_D9
#_08FAAB: dw Message_00_03_DA
#_08FAAD: dw Message_00_03_DB
#_08FAAF: dw Message_00_03_DC
#_08FAB1: dw Message_00_03_DD
#_08FAB3: dw Message_00_03_DE
#_08FAB5: dw Message_00_03_DE
#_08FAB7: dw Message_00_03_DE
#_08FAB9: dw Message_00_03_DE
#_08FABB: dw Message_00_03_DE
#_08FABD: dw Message_00_03_DE

;===================================================================================================

Message_00_04_Pointers:
#_08FABF: dw Message_00_04_00
#_08FAC1: dw Message_00_04_01
#_08FAC3: dw Message_00_04_02
#_08FAC5: dw Message_00_04_03
#_08FAC7: dw Message_00_04_04
#_08FAC9: dw Message_00_04_05
#_08FACB: dw Message_00_04_06

;===================================================================================================

Message_00_05_Pointers:
#_08FACD: dw Message_00_05_00
#_08FACF: dw Message_00_05_01
#_08FAD1: dw Message_00_05_02
#_08FAD3: dw Message_00_05_03
#_08FAD5: dw Message_00_05_04
#_08FAD7: dw Message_00_05_05
#_08FAD9: dw Message_00_05_06
#_08FADB: dw Message_00_05_07
#_08FADD: dw Message_00_05_08
#_08FADF: dw Message_00_05_09
#_08FAE1: dw Message_00_05_0A
#_08FAE3: dw Message_00_05_0B
#_08FAE5: dw Message_00_05_0C
#_08FAE7: dw Message_00_05_0D
#_08FAE9: dw Message_00_05_0E
#_08FAEB: dw Message_00_05_0F
#_08FAED: dw Message_00_05_10
#_08FAEF: dw Message_00_05_11
#_08FAF1: dw Message_00_05_12
#_08FAF3: dw Message_00_05_13
#_08FAF5: dw Message_00_05_14
#_08FAF7: dw Message_00_05_15
#_08FAF9: dw Message_00_05_16
#_08FAFB: dw Message_00_05_17
#_08FAFD: dw Message_00_05_18
#_08FAFF: dw Message_00_05_19
#_08FB01: dw Message_00_05_1A
#_08FB03: dw Message_00_05_1B
#_08FB05: dw Message_00_05_1C
#_08FB07: dw Message_00_05_1D
#_08FB09: dw Message_00_05_1E
#_08FB0B: dw Message_00_05_1F
#_08FB0D: dw Message_00_05_20
#_08FB0F: dw Message_00_05_21
#_08FB11: dw Message_00_05_22
#_08FB13: dw Message_00_05_23
#_08FB15: dw Message_00_05_24
#_08FB17: dw Message_00_05_25
#_08FB19: dw Message_00_05_26
#_08FB1B: dw Message_00_05_27
#_08FB1D: dw Message_00_05_28
#_08FB1F: dw Message_00_05_29
#_08FB21: dw Message_00_05_2A
#_08FB23: dw Message_00_05_2B
#_08FB25: dw Message_00_05_2C
#_08FB27: dw Message_00_05_2D
#_08FB29: dw Message_00_05_2E
#_08FB2B: dw Message_00_05_2F
#_08FB2D: dw Message_00_05_30
#_08FB2F: dw Message_00_05_31
#_08FB31: dw Message_00_05_32
#_08FB33: dw Message_00_05_33
#_08FB35: dw Message_00_05_34
#_08FB37: dw Message_00_05_35
#_08FB39: dw Message_00_05_36
#_08FB3B: dw Message_00_05_37
#_08FB3D: dw Message_00_05_38
#_08FB3F: dw Message_00_05_39
#_08FB41: dw Message_00_05_3A
#_08FB43: dw Message_00_05_3B
#_08FB45: dw Message_00_05_3C
#_08FB47: dw Message_00_05_3D
#_08FB49: dw Message_00_05_3E
#_08FB4B: dw Message_00_05_3F
#_08FB4D: dw Message_00_05_40
#_08FB4F: dw Message_00_05_41
#_08FB51: dw Message_00_05_42
#_08FB53: dw Message_00_05_43
#_08FB55: dw Message_00_05_44
#_08FB57: dw Message_00_05_45
#_08FB59: dw Message_00_05_46
#_08FB5B: dw Message_00_05_47
#_08FB5D: dw Message_00_05_48
#_08FB5F: dw Message_00_05_49
#_08FB61: dw Message_00_05_4A
#_08FB63: dw Message_00_05_4B
#_08FB65: dw Message_00_05_4C
#_08FB67: dw Message_00_05_4D
#_08FB69: dw Message_00_05_4E
#_08FB6B: dw Message_00_05_4F
#_08FB6D: dw Message_00_05_50
#_08FB6F: dw Message_00_05_51
#_08FB71: dw Message_00_05_52
#_08FB73: dw Message_00_05_53
#_08FB75: dw Message_00_05_54
#_08FB77: dw Message_00_05_55
#_08FB79: dw Message_00_05_56
#_08FB7B: dw Message_00_05_57
#_08FB7D: dw Message_00_05_58
#_08FB7F: dw Message_00_05_59
#_08FB81: dw Message_00_05_5A
#_08FB83: dw Message_00_05_5B
#_08FB85: dw Message_00_05_5C
#_08FB87: dw Message_00_05_5D

;===================================================================================================

Message_00_07_Pointers:
#_08FB89: dw Message_00_07_00
#_08FB8B: dw Message_00_07_01
#_08FB8D: dw Message_00_07_02
#_08FB8F: dw Message_00_07_03
#_08FB91: dw Message_00_07_04
#_08FB93: dw Message_00_07_05
#_08FB95: dw Message_00_07_06
#_08FB97: dw Message_00_07_07
#_08FB99: dw Message_00_07_08
#_08FB9B: dw Message_00_07_09
#_08FB9D: dw Message_00_07_0A
#_08FB9F: dw Message_00_07_0B
#_08FBA1: dw Message_00_07_0C
#_08FBA3: dw Message_00_07_0D
#_08FBA5: dw Message_00_07_0E
#_08FBA7: dw Message_00_07_0F
#_08FBA9: dw Message_00_07_10
#_08FBAB: dw Message_00_07_11
#_08FBAD: dw Message_00_07_12
#_08FBAF: dw Message_00_07_13
#_08FBB1: dw Message_00_07_14
#_08FBB3: dw Message_00_07_15
#_08FBB5: dw Message_00_07_16
#_08FBB7: dw Message_00_07_17
#_08FBB9: dw Message_00_07_18
#_08FBBB: dw Message_00_07_19
#_08FBBD: dw Message_00_07_1A
#_08FBBF: dw Message_00_07_1B
#_08FBC1: dw Message_00_07_1C
#_08FBC3: dw Message_00_07_1D
#_08FBC5: dw Message_00_07_1E
#_08FBC7: dw Message_00_07_1F
#_08FBC9: dw Message_00_07_20
#_08FBCB: dw Message_00_07_21
#_08FBCD: dw Message_00_07_22
#_08FBCF: dw Message_00_07_23
#_08FBD1: dw Message_00_07_24
#_08FBD3: dw Message_00_07_25
#_08FBD5: dw Message_00_07_26
#_08FBD7: dw Message_00_07_27
#_08FBD9: dw Message_00_07_28
#_08FBDB: dw Message_00_07_29
#_08FBDD: dw Message_00_07_2A
#_08FBDF: dw Message_00_07_2B

;===================================================================================================

Message_00_06_Pointers:
#_08FBE1: dw Message_00_06_00
#_08FBE3: dw Message_00_06_01
#_08FBE5: dw Message_00_06_02
#_08FBE7: dw Message_00_06_03
#_08FBE9: dw Message_00_06_04
#_08FBEB: dw Message_00_06_05
#_08FBED: dw Message_00_06_06
#_08FBEF: dw Message_00_06_07
#_08FBF1: dw Message_00_06_08
#_08FBF3: dw Message_00_06_09
#_08FBF5: dw Message_00_06_0A
#_08FBF7: dw Message_00_06_0B
#_08FBF9: dw Message_00_06_0C
#_08FBFB: dw Message_00_06_0D
#_08FBFD: dw Message_00_06_0E
#_08FBFF: dw Message_00_06_0F
#_08FC01: dw Message_00_06_10
#_08FC03: dw Message_00_06_11
#_08FC05: dw Message_00_06_12
#_08FC07: dw Message_00_06_13
#_08FC09: dw Message_00_06_14
#_08FC0B: dw Message_00_06_15
#_08FC0D: dw Message_00_06_16
#_08FC0F: dw Message_00_06_17
#_08FC11: dw Message_00_06_18
#_08FC13: dw Message_00_06_19
#_08FC15: dw Message_00_06_1A
#_08FC17: dw Message_00_06_1B
#_08FC19: dw Message_00_06_1C
#_08FC1B: dw Message_00_06_1D
#_08FC1D: dw Message_00_06_1E
#_08FC1F: dw Message_00_06_1F
#_08FC21: dw Message_00_06_20
#_08FC23: dw Message_00_06_21
#_08FC25: dw Message_00_06_22
#_08FC27: dw Message_00_06_23
#_08FC29: dw Message_00_06_24
#_08FC2B: dw Message_00_06_25
#_08FC2D: dw Message_00_06_26
#_08FC2F: dw Message_00_06_27
#_08FC31: dw Message_00_06_28
#_08FC33: dw Message_00_06_29
#_08FC35: dw Message_00_06_2A
#_08FC37: dw Message_00_06_2B

;===================================================================================================

Message_00_08_Pointers:
#_08FC39: dw Message_00_08_00
#_08FC3B: dw Message_00_08_01
#_08FC3D: dw Message_00_08_02
#_08FC3F: dw Message_00_08_03
#_08FC41: dw Message_00_08_04
#_08FC43: dw Message_00_08_05
#_08FC45: dw Message_00_08_06
#_08FC47: dw Message_00_08_07
#_08FC49: dw Message_00_08_08
#_08FC4B: dw Message_00_08_09
#_08FC4D: dw Message_00_08_0A
#_08FC4F: dw Message_00_08_0B
#_08FC51: dw Message_00_08_0C
#_08FC53: dw Message_00_08_0D
#_08FC55: dw Message_00_08_0E
#_08FC57: dw Message_00_08_0F
#_08FC59: dw Message_00_08_10
#_08FC5B: dw Message_00_08_11
#_08FC5D: dw Message_00_08_12
#_08FC5F: dw Message_00_08_13
#_08FC61: dw Message_00_08_14
#_08FC63: dw Message_00_08_15
#_08FC65: dw Message_00_08_16
#_08FC67: dw Message_00_08_17
#_08FC69: dw Message_00_08_18
#_08FC6B: dw Message_00_08_19
#_08FC6D: dw Message_00_08_1A
#_08FC6F: dw Message_00_08_1B
#_08FC71: dw Message_00_08_1C
#_08FC73: dw Message_00_08_1D
#_08FC75: dw Message_00_08_1E
#_08FC77: dw Message_00_08_1F
#_08FC79: dw Message_00_08_20
#_08FC7B: dw Message_00_08_21
#_08FC7D: dw Message_00_08_22
#_08FC7F: dw Message_00_08_23
#_08FC81: dw Message_00_08_24
#_08FC83: dw Message_00_08_25
#_08FC85: dw Message_00_08_26
#_08FC87: dw Message_00_08_27
#_08FC89: dw Message_00_08_28
#_08FC8B: dw Message_00_08_29
#_08FC8D: dw Message_00_08_2A
#_08FC8F: dw Message_00_08_2B
#_08FC91: dw Message_00_08_2C
#_08FC93: dw Message_00_08_2D
#_08FC95: dw Message_00_08_2E
#_08FC97: dw Message_00_08_2F
#_08FC99: dw Message_00_08_30
#_08FC9B: dw Message_00_08_31
#_08FC9D: dw Message_00_08_32
#_08FC9F: dw Message_00_08_33
#_08FCA1: dw Message_00_08_34
#_08FCA3: dw Message_00_08_35
#_08FCA5: dw Message_00_08_36
#_08FCA7: dw Message_00_08_37
#_08FCA9: dw Message_00_08_38
#_08FCAB: dw Message_00_08_39
#_08FCAD: dw Message_00_08_3A
#_08FCAF: dw Message_00_08_3B

;===================================================================================================

Message_00_09_Pointers:
#_08FCB1: dw Message_00_09_00
#_08FCB3: dw Message_00_09_01
#_08FCB5: dw Message_00_09_02
#_08FCB7: dw Message_00_09_03
#_08FCB9: dw Message_00_09_04
#_08FCBB: dw Message_00_09_05
#_08FCBD: dw Message_00_09_06
#_08FCBF: dw Message_00_09_07
#_08FCC1: dw Message_00_09_08
#_08FCC3: dw Message_00_09_09
#_08FCC5: dw Message_00_09_0A
#_08FCC7: dw Message_00_09_0B
#_08FCC9: dw Message_00_09_0C
#_08FCCB: dw Message_00_09_0D
#_08FCCD: dw Message_00_09_0E
#_08FCCF: dw Message_00_09_0F
#_08FCD1: dw Message_00_09_10
#_08FCD3: dw Message_00_09_11
#_08FCD5: dw Message_00_09_12
#_08FCD7: dw Message_00_09_13
#_08FCD9: dw Message_00_09_14
#_08FCDB: dw Message_00_09_15
#_08FCDD: dw Message_00_09_16
#_08FCDF: dw Message_00_09_17
#_08FCE1: dw Message_00_09_18
#_08FCE3: dw Message_00_09_19
#_08FCE5: dw Message_00_09_1A
#_08FCE7: dw Message_00_09_1B
#_08FCE9: dw Message_00_09_1C
#_08FCEB: dw Message_00_09_1D
#_08FCED: dw Message_00_09_1E
#_08FCEF: dw Message_00_09_1F
#_08FCF1: dw Message_00_09_20
#_08FCF3: dw Message_00_09_21
#_08FCF5: dw Message_00_09_22
#_08FCF7: dw Message_00_09_23
#_08FCF9: dw Message_00_09_24
#_08FCFB: dw Message_00_09_25
#_08FCFD: dw Message_00_09_26
#_08FCFF: dw Message_00_09_27
#_08FD01: dw Message_00_09_28
#_08FD03: dw Message_00_09_29
#_08FD05: dw Message_00_09_2A
#_08FD07: dw Message_00_09_2B
#_08FD09: dw Message_00_09_2C
#_08FD0B: dw Message_00_09_2D
#_08FD0D: dw Message_00_09_2E
#_08FD0F: dw Message_00_09_2F
#_08FD11: dw Message_00_09_30
#_08FD13: dw Message_00_09_31
#_08FD15: dw Message_00_09_32
#_08FD17: dw Message_00_09_33
#_08FD19: dw Message_00_09_34
#_08FD1B: dw Message_00_09_35
#_08FD1D: dw Message_00_09_36
#_08FD1F: dw Message_00_09_37
#_08FD21: dw Message_00_09_38
#_08FD23: dw Message_00_09_39
#_08FD25: dw Message_00_09_3A
#_08FD27: dw Message_00_09_3B
#_08FD29: dw Message_00_09_3C
#_08FD2B: dw Message_00_09_3D
#_08FD2D: dw Message_00_09_3E
#_08FD2F: dw Message_00_09_3F
#_08FD31: dw Message_00_09_40
#_08FD33: dw Message_00_09_41
#_08FD35: dw Message_00_09_42
#_08FD37: dw Message_00_09_43
#_08FD39: dw Message_00_09_44
#_08FD3B: dw Message_00_09_45
#_08FD3D: dw Message_00_09_46
#_08FD3F: dw Message_00_09_47
#_08FD41: dw Message_00_09_48
#_08FD43: dw Message_00_09_49
#_08FD45: dw Message_00_09_4A
#_08FD47: dw Message_00_09_4B
#_08FD49: dw Message_00_09_4C
#_08FD4B: dw Message_00_09_4D
#_08FD4D: dw Message_00_09_4E
#_08FD4F: dw Message_00_09_4F
#_08FD51: dw Message_00_09_50
#_08FD53: dw Message_00_09_51
#_08FD55: dw Message_00_09_52
#_08FD57: dw Message_00_09_53
#_08FD59: dw Message_00_09_54
#_08FD5B: dw Message_00_09_55
#_08FD5D: dw Message_00_09_56
#_08FD5F: dw Message_00_09_57
#_08FD61: dw Message_00_09_58
#_08FD63: dw Message_00_09_59
#_08FD65: dw Message_00_09_5A
#_08FD67: dw Message_00_09_5B
#_08FD69: dw Message_00_09_5C
#_08FD6B: dw Message_00_09_5D
#_08FD6D: dw Message_00_09_5E
#_08FD6F: dw Message_00_09_5F
#_08FD71: dw Message_00_09_60
#_08FD73: dw Message_00_09_61
#_08FD75: dw Message_00_09_62
#_08FD77: dw Message_00_09_63
#_08FD79: dw Message_00_09_64
#_08FD7B: dw Message_00_09_65
#_08FD7D: dw Message_00_09_66
#_08FD7F: dw Message_00_09_67
#_08FD81: dw Message_00_09_68
#_08FD83: dw Message_00_09_69
#_08FD85: dw Message_00_09_6A
#_08FD87: dw Message_00_09_6B

;===================================================================================================

Message_00_0A_Pointers:
#_08FD89: dw Message_00_0A_00
#_08FD8B: dw Message_00_0A_01
#_08FD8D: dw Message_00_0A_02
#_08FD8F: dw Message_00_0A_03
#_08FD91: dw Message_00_0A_04
#_08FD93: dw Message_00_0A_05
#_08FD95: dw Message_00_0A_06
#_08FD97: dw Message_00_0A_07
#_08FD99: dw Message_00_0A_08
#_08FD9B: dw Message_00_0A_09
#_08FD9D: dw Message_00_0A_0A
#_08FD9F: dw Message_00_0A_0B
#_08FDA1: dw Message_00_0A_0C
#_08FDA3: dw Message_00_0A_0D
#_08FDA5: dw Message_00_0A_0E
#_08FDA7: dw Message_00_0A_0F
#_08FDA9: dw Message_00_0A_10
#_08FDAB: dw Message_00_0A_11
#_08FDAD: dw Message_00_0A_12
#_08FDAF: dw Message_00_0A_13
#_08FDB1: dw Message_00_0A_14
#_08FDB3: dw Message_00_0A_15
#_08FDB5: dw Message_00_0A_16
#_08FDB7: dw Message_00_0A_17
#_08FDB9: dw Message_00_0A_18
#_08FDBB: dw Message_00_0A_19
#_08FDBD: dw Message_00_0A_1A
#_08FDBF: dw Message_00_0A_1B
#_08FDC1: dw Message_00_0A_1C
#_08FDC3: dw Message_00_0A_1D
#_08FDC5: dw Message_00_0A_1E
#_08FDC7: dw Message_00_0A_1F
#_08FDC9: dw Message_00_0A_20
#_08FDCB: dw Message_00_0A_21
#_08FDCD: dw Message_00_0A_22
#_08FDCF: dw Message_00_0A_23
#_08FDD1: dw Message_00_0A_24
#_08FDD3: dw Message_00_0A_25
#_08FDD5: dw Message_00_0A_26
#_08FDD7: dw Message_00_0A_27
#_08FDD9: dw Message_00_0A_28
#_08FDDB: dw Message_00_0A_29
#_08FDDD: dw Message_00_0A_2A
#_08FDDF: dw Message_00_0A_2B
#_08FDE1: dw Message_00_0A_2C
#_08FDE3: dw Message_00_0A_2D
#_08FDE5: dw Message_00_0A_2E
#_08FDE7: dw Message_00_0A_2F
#_08FDE9: dw Message_00_0A_30
#_08FDEB: dw Message_00_0A_31
#_08FDED: dw Message_00_0A_32
#_08FDEF: dw Message_00_0A_33
#_08FDF1: dw Message_00_0A_34
#_08FDF3: dw Message_00_0A_35
#_08FDF5: dw Message_00_0A_36
#_08FDF7: dw Message_00_0A_37
#_08FDF9: dw Message_00_0A_38
#_08FDFB: dw Message_00_0A_39
#_08FDFD: dw Message_00_0A_3A
#_08FDFF: dw Message_00_0A_3B
#_08FE01: dw Message_00_0A_3C
#_08FE03: dw Message_00_0A_3D
#_08FE05: dw Message_00_0A_3E
#_08FE07: dw Message_00_0A_3F
#_08FE09: dw Message_00_0A_40
#_08FE0B: dw Message_00_0A_41
#_08FE0D: dw Message_00_0A_42
#_08FE0F: dw Message_00_0A_43
#_08FE11: dw Message_00_0A_44
#_08FE13: dw Message_00_0A_45
#_08FE15: dw Message_00_0A_46
#_08FE17: dw Message_00_0A_47
#_08FE19: dw Message_00_0A_48
#_08FE1B: dw Message_00_0A_49
#_08FE1D: dw Message_00_0A_4A
#_08FE1F: dw Message_00_0A_4B
#_08FE21: dw Message_00_0A_4C
#_08FE23: dw Message_00_0A_4D
#_08FE25: dw Message_00_0A_4E
#_08FE27: dw Message_00_0A_4F
#_08FE29: dw Message_00_0A_50
#_08FE2B: dw Message_00_0A_51
#_08FE2D: dw Message_00_0A_52
#_08FE2F: dw Message_00_0A_53
#_08FE31: dw Message_00_0A_54
#_08FE33: dw Message_00_0A_55
#_08FE35: dw Message_00_0A_56
#_08FE37: dw Message_00_0A_57
#_08FE39: dw Message_00_0A_58
#_08FE3B: dw Message_00_0A_59
#_08FE3D: dw Message_00_0A_5A
#_08FE3F: dw Message_00_0A_5B
#_08FE41: dw Message_00_0A_5C
#_08FE43: dw Message_00_0A_5D

;===================================================================================================

Message_00_0B_Pointers:
#_08FE45: dw Message_00_0B_00
#_08FE47: dw Message_00_0B_01
#_08FE49: dw Message_00_0B_02
#_08FE4B: dw Message_00_0B_03
#_08FE4D: dw Message_00_0B_04
#_08FE4F: dw Message_00_0B_04
#_08FE51: dw Message_00_0B_06
#_08FE53: dw Message_00_0B_07
#_08FE55: dw Message_00_0B_08
#_08FE57: dw Message_00_0B_09
#_08FE59: dw Message_00_0B_0A
#_08FE5B: dw Message_00_0B_0A
#_08FE5D: dw Message_00_0B_0C
#_08FE5F: dw Message_00_0B_0D
#_08FE61: dw Message_00_0B_0E
#_08FE63: dw Message_00_0B_0F
#_08FE65: dw Message_00_0B_10
#_08FE67: dw Message_00_0B_11
#_08FE69: dw Message_00_0B_12
#_08FE6B: dw Message_00_0B_13
#_08FE6D: dw Message_00_0B_14
#_08FE6F: dw Message_00_0B_15
#_08FE71: dw Message_00_0B_16
#_08FE73: dw Message_00_0B_17
#_08FE75: dw Message_00_0B_18
#_08FE77: dw Message_00_0B_19
#_08FE79: dw Message_00_0B_1A
#_08FE7B: dw Message_00_0B_1B
#_08FE7D: dw Message_00_0B_1C
#_08FE7F: dw Message_00_0B_1D
#_08FE81: dw Message_00_0B_1E
#_08FE83: dw Message_00_0B_1F
#_08FE85: dw Message_00_0B_20
#_08FE87: dw Message_00_0B_21
#_08FE89: dw Message_00_0B_22
#_08FE8B: dw Message_00_0B_23
#_08FE8D: dw Message_00_0B_24
#_08FE8F: dw Message_00_0B_25
#_08FE91: dw Message_00_0B_26
#_08FE93: dw Message_00_0B_27
#_08FE95: dw Message_00_0B_28
#_08FE97: dw Message_00_0B_29
#_08FE99: dw Message_00_0B_2A
#_08FE9B: dw Message_00_0B_2B

;===================================================================================================

Message_00_0C_Pointers:
#_08FE9D: dw Message_00_0C_00
#_08FE9F: dw Message_00_0C_01
#_08FEA1: dw Message_00_0C_02
#_08FEA3: dw Message_00_0C_03
#_08FEA5: dw Message_00_0C_04
#_08FEA7: dw Message_00_0C_05
#_08FEA9: dw Message_00_0C_06
#_08FEAB: dw Message_00_0C_07
#_08FEAD: dw Message_00_0C_08
#_08FEAF: dw Message_00_0C_09
#_08FEB1: dw Message_00_0C_0A
#_08FEB3: dw Message_00_0C_0B
#_08FEB5: dw Message_00_0C_0C
#_08FEB7: dw Message_00_0C_0D
#_08FEB9: dw Message_00_0C_0E
#_08FEBB: dw Message_00_0C_0F
#_08FEBD: dw Message_00_0C_10
#_08FEBF: dw Message_00_0C_11
#_08FEC1: dw Message_00_0C_12
#_08FEC3: dw Message_00_0C_13
#_08FEC5: dw Message_00_0C_14
#_08FEC7: dw Message_00_0C_15
#_08FEC9: dw Message_00_0C_16
#_08FECB: dw Message_00_0C_17
#_08FECD: dw Message_00_0C_18
#_08FECF: dw Message_00_0C_19
#_08FED1: dw Message_00_0C_1A
#_08FED3: dw Message_00_0C_1B
#_08FED5: dw Message_00_0C_1C
#_08FED7: dw Message_00_0C_1D
#_08FED9: dw Message_00_0C_1E
#_08FEDB: dw Message_00_0C_1F
#_08FEDD: dw Message_00_0C_20
#_08FEDF: dw Message_00_0C_21
#_08FEE1: dw Message_00_0C_22
#_08FEE3: dw Message_00_0C_23
#_08FEE5: dw Message_00_0C_24
#_08FEE7: dw Message_00_0C_25
#_08FEE9: dw Message_00_0C_26
#_08FEEB: dw Message_00_0C_27
#_08FEED: dw Message_00_0C_28
#_08FEEF: dw Message_00_0C_29
#_08FEF1: dw Message_00_0C_2A
#_08FEF3: dw Message_00_0C_2B
#_08FEF5: dw Message_00_0C_2C
#_08FEF7: dw Message_00_0C_2D
#_08FEF9: dw Message_00_0C_2E
#_08FEFB: dw Message_00_0C_2F
#_08FEFD: dw Message_00_0C_30
#_08FEFF: dw Message_00_0C_31
#_08FF01: dw Message_00_0C_32
#_08FF03: dw Message_00_0C_33
#_08FF05: dw Message_00_0C_34
#_08FF07: dw Message_00_0C_35
#_08FF09: dw Message_00_0C_36
#_08FF0B: dw Message_00_0C_37
#_08FF0D: dw Message_00_0C_38
#_08FF0F: dw Message_00_0C_39
#_08FF11: dw Message_00_0C_3A
#_08FF13: dw Message_00_0C_3B
#_08FF15: dw Message_00_0C_3C
#_08FF17: dw Message_00_0C_3D
#_08FF19: dw Message_00_0C_3E
#_08FF1B: dw Message_00_0C_3F
#_08FF1D: dw Message_00_0C_40
#_08FF1F: dw Message_00_0C_41
#_08FF21: dw Message_00_0C_42
#_08FF23: dw Message_00_0C_43
#_08FF25: dw Message_00_0C_44
#_08FF27: dw Message_00_0C_45
#_08FF29: dw Message_00_0C_46
#_08FF2B: dw Message_00_0C_47
#_08FF2D: dw Message_00_0C_48
#_08FF2F: dw Message_00_0C_49
#_08FF31: dw Message_00_0C_4A
#_08FF33: dw Message_00_0C_4B
#_08FF35: dw Message_00_0C_4C
#_08FF37: dw Message_00_0C_4D
#_08FF39: dw Message_00_0C_4E
#_08FF3B: dw Message_00_0C_4F
#_08FF3D: dw Message_00_0C_50
#_08FF3F: dw Message_00_0C_51
#_08FF41: dw Message_00_0C_52
#_08FF43: dw Message_00_0C_53
#_08FF45: dw Message_00_0C_54
#_08FF47: dw Message_00_0C_55
#_08FF49: dw Message_00_0C_56
#_08FF4B: dw Message_00_0C_57
#_08FF4D: dw Message_00_0C_58
#_08FF4F: dw Message_00_0C_59
#_08FF51: dw Message_00_0C_5A
#_08FF53: dw Message_00_0C_5B
#_08FF55: dw Message_00_0C_5C
#_08FF57: dw Message_00_0C_5D
#_08FF59: dw Message_00_0C_5E
#_08FF5B: dw Message_00_0C_5F
#_08FF5D: dw Message_00_0C_60
#_08FF5F: dw Message_00_0C_61
#_08FF61: dw Message_00_0C_62
#_08FF63: dw Message_00_0C_63
#_08FF65: dw Message_00_0C_64
#_08FF67: dw Message_00_0C_65
#_08FF69: dw Message_00_0C_66
#_08FF6B: dw Message_00_0C_67
#_08FF6D: dw Message_00_0C_68
#_08FF6F: dw Message_00_0C_69
#_08FF71: dw Message_00_0C_6A
#_08FF73: dw Message_00_0C_6B
#_08FF75: dw Message_00_0C_6C
#_08FF77: dw Message_00_0C_6D
#_08FF79: dw Message_00_0C_6E
#_08FF7B: dw Message_00_0C_6F
#_08FF7D: dw Message_00_0C_70
#_08FF7F: dw Message_00_0C_71
#_08FF81: dw Message_00_0C_72
#_08FF83: dw Message_00_0C_73
#_08FF85: dw Message_00_0C_74
#_08FF87: dw Message_00_0C_75

;===================================================================================================

FusionOptionPointers:
#_08FF89: dw FusionMessage_00
#_08FF8B: dw FusionMessage_01
#_08FF8D: dw FusionMessage_02
#_08FF8F: dw FusionMessage_03
#_08FF91: dw FusionMessage_04
#_08FF93: dw FusionMessage_05
#_08FF95: dw FusionMessage_06
#_08FF97: dw FusionMessage_07
#_08FF99: dw FusionMessage_08

;===================================================================================================

TerminalDestinationNamePointers:
#_08FF9B: dw TerminalDestinationName_00
#_08FF9D: dw TerminalDestinationName_01
#_08FF9F: dw TerminalDestinationName_02
#_08FFA1: dw TerminalDestinationName_03
#_08FFA3: dw TerminalDestinationName_04
#_08FFA5: dw TerminalDestinationName_05
#_08FFA7: dw TerminalDestinationName_06
#_08FFA9: dw TerminalDestinationName_07
#_08FFAB: dw TerminalDestinationName_08
#_08FFAD: dw TerminalDestinationName_09
#_08FFAF: dw TerminalDestinationName_0A
#_08FFB1: dw TerminalDestinationName_0B
#_08FFB3: dw TerminalDestinationName_0C
#_08FFB5: dw TerminalDestinationName_0D
#_08FFB7: dw TerminalDestinationName_0E
#_08FFB9: dw TerminalDestinationName_0F
#_08FFBB: dw TerminalDestinationName_10
#_08FFBD: dw TerminalDestinationName_11
#_08FFBF: dw TerminalDestinationName_ERROR

;===================================================================================================

ShopActionMessagePointers:
#_08FFC1: dw ShopActionMessage_00
#_08FFC3: dw ShopActionMessage_01
#_08FFC5: dw ShopActionMessage_02
#_08FFC7: dw ShopActionMessage_03
#_08FFC9: dw ShopActionMessage_04
#_08FFCB: dw ShopActionMessage_05
#_08FFCD: dw ShopActionMessage_06
#_08FFCF: dw ShopActionMessage_07

;===================================================================================================

; TODO garbage?
#_08FFD1: db $F5,$59,$F5,$60,$F5,$64,$F5,$6D
#_08FFD9: db $F5,$72,$F5,$76,$F5,$7F,$F5,$85
#_08FFE1: db $F5,$8D,$F5,$93,$F5,$97,$F5,$9B
#_08FFE9: db $F5,$A3,$F5,$AE,$F5,$B6,$F5,$BE
#_08FFF1: db $F5,$C8,$F5,$0C,$F6,$AD,$DE,$05
#_08FFF9: db $DF,$52,$DF,$86,$DF,$BB,$A5

;===================================================================================================
